[
    "One patch came unglued almost immediately; the others peeled off after one use by my son. Complete waste of money and time.",
    "I have used self healing mats before and this one as just as good as all the others. The quilting ruler is larger than most sold on Amazon, and that's the main reason I purchased this set.I was skeptical about the rotary cutter, as I have always used Olfa products, but it works just as well. Overall I'd recommend this set to a beginning quilter; it has all the tools you'd need to begin your first quilt and the quality is pretty great!",
    "We bought this sewing machine in March and my wife is learning to sew. We do not use the machine very often so it is very disappointing that we are now on our second visit to the shop. The first one happened just within the 90 day warranty, and we were able to send to official center 60 miles away. That problem was clearly a manufacturing defect where a part came loose inside. This second problem is the actual sewing is now not correct. Appears to be a tension problem, but everything appears ok. At this point, we are on the edge of buying a new machine that is more robust. I will wait and see what the shop says tomorrow. Could cost us more to fix it than it's worth. Timing is terrible, as my wife started a class two days ago. The reliability of this product is unacceptable. Very unhappy. (Are all the new machines plastic now? Miss the old metal units and metal bobbins).",
    "This books picks up where the instruction manual leaves off. I recently purchased a serger and this book helped me to familiarize myself with the machine, different types of threads and the various types of stitches that can be made with a serger. The photos and clearly written instructions in each chapter made me very comfortable with my machine. The author provides the right amount of detail to guide you step-by-step without becoming overwhelmed. I highly recommend this book to beginners, but it's also a good resource for the more advanced.",
    "My seam ripper that was over 20 years old finally broke and I was desparate to find a replacement to use for my upholstery business. I thought I could get by with a cheap replacement,Singer Seam Ripper 4-Inch with Ball and Cover, but unfortunately I got what I paid for. It wouldn't cut a fine hair if it tried and believe me I tried! I had to throw it away and start looking again. I came across this seam ripper and took a chance. I am very pleased with it's performance and quality. I have to cut through upholstery thread and this seam ripper slices through the thick threads and tight stitches like a hot knife through butter. It is much larger than your typical seam ripper, so be aware of that(it's 5 1/2\" long). If you don't mind working with a larger seam ripper then this is definitely worth buying.",
    "Im not gonna lie when i read some negative reviews on this product i was kind of nervous, but then i decided to order this product and give it a shot! This storage cart is such a good product and its also very easy to assemble. I use this to store my make up and its very convinient for me since i have a somewhat large collection of cosmetics.The only downside is if you put a lot of heavy items in the drawers it will weigh it down which can cause the drawer to go off track but other than that its perfect! Also if u have a small room this will be perfect for you it takes almost no space! I would recomend this product to anyone who just needs something simple to store cafts or makeup or anything for that matter! Dont let the negative reviews spook you, you also might love it like me!",
    "It is sticks very well to lay fabric on it for embroidery however it is also a little hard to unstick it from finished product. I would recommend this for anyone that is beginning to embroider with heavy material.",
    "I actually do not know how well this gadget works since I have not been able to use it. I am not saying it is a bad product, but if you don't know anything about sewing this is not for you. The instructions that come with it have non-specific diagrams which makes it almost impossible to even get familiar with which part is what. it should come with better instructions.",
    "If you happen to do a lot of drafting, or working with very large spreadsheets and enjoy being able to make changes without hurting or destroying other data, these pens are the perfect fix.Sized perfectly and with different widths, you simply can't go wrong.Well worth the money, and seem to last forever. Just be cautious when pressing hard on your paper, these will be destroyed very quickly.",
    "I use this glue pen for scrapbooking and the pen is very useful and works well. The tip is very fine allowing me to cleanly glue small cutouts onto my pages. I have also used the glue pen with glitter to write words or draw pictures on the pages. This works well and the letters/pictures turn out very clearly.",
    "Item was as described with easy instructions. Easy to complete and does match the picture! Would recommend to beginners, good quick project.",
    "After getting my bottle, I wrote a few sample words and doodles with every pen and ink I own on a sheet of paper. Getting this sampler thoroughly wet, only two inks remained: Noodler's Waterproof Black and Sharpie Permanent. Sure, you could read some of the other colors and brands, but Noodler's had literally no change.I tried to rub the wet paper some, and the paper came apart before the ink showed any smears.I've written 20 or 30 pages with this ink in a Lamy Safari Extra Fine Nib with no clogs, goops, or issues.",
    "After reviewing many home sewing machine articles, I finally chose the Brother CS600i. Some of the reviews suggested difficulties with the automatic needle threader and/ or the bobbin tension settings. It is true that you have to look very carefully at the final thread retaining bail just above the needle to see which side to hook the thread on, but I finally got it figured out. The automatic needle threader is a bit tricky, but when I saw that the thread must be pulled up rather than down to catch onto the tiny hook,, bingo!The machine has the ability to automatically set the recommended stitch length and width dimensions and to tell you what foot to put on it. Unfortunately I had to use a small flash light to see the numbers and letters on the small screen. No big deal.So far the bobbin and thread tensions have not been a problem. What was confusing was the direction to &#34;baste&#34;titch without telling me how to do that. I found a clue in the frequently asked question in the Brother web site. All you do is set the tension wheel to 3 and the stitch length to 4. Again, Bingo!The machine has a narrower throat that my Viking, but this can be worked around with a bit of innovating.All-in-all I have have a lot of enjoyment just trying out all of the stitches described in the very complete instruction manual.Nice work, Brother..",
    "I would recommend getting the smaller size that is solid, rather than a cylinder. It seems like the cylinder isn't as strong as the solid round magnets.",
    "I did a lot of research before purchasing this sewing machine, both in local stores and online. I read many of the reviews on this machine before making the purchase. I have not yet had a chance to look at or try all the attachments, accessories, and stitches. There's so much!! The machine is very light weight, but seems very sturdy. It's very quiet and runs smoothly. Threading the top of the machine is very simple and I like that the bobbins are the same size as those I had from the Kenmore machine I'm replacing. The additional detachable table and hard cover are great bonuses. I was worried about having this machine shipped to Hawaii (cost and condition), however, to my great delight, shipping was FREE and the machine arrived in 4 days, in perfect condition!! I'm very happy with this machine and the price, and the convenience of home delivery cannot be beat! Thank you!",
    "Love this mat very much. This is my second one. It is prone to &#34;gouging&#34; if you aren't careful but as far as using blades goes it is perfect.",
    "Grandson loved it! We all played with it right away. It's easy to use and fun for all ages. Arrived in perfect condition",
    "If you are pin basting a quilt top, you need a lot of pins, so one package won't do it. But, the curved shape makes all of that pining goes faster and easier. I like this size, rather than the smaller ones --- again I find it easier to manipulate them.",
    "great foot ,for zipper s and cording you can get very close to the cording and zippers. great little foot.",
    "This is just what I wanted. I drilled a hole in each top arm. I mounted on my wall above my sewing table. I have every thing at my finger tips.",
    "The contempary style is what I wanted for the couple I am stitching it for. The only problem I have with it is the needle, the eye is to small to get three strands of floss through.",
    "this is a great machine and reasonably priced too. I would recommend it to anyone new at sewing or a pro",
    "As a beginner, this is a really simple, easy-to-use machine and I love it! I was worried that it would be too lightweight, but actually that is not a problem at all. The computer screen and accompanying manual make it easy to figure things out. I'm so glad I bought this machine!",
    "Good quality & they do the job, What more to say. It's a Great value for the 2 pack of scissors",
    "It seems that to have the machine fit snugly in this case, you should keep the original packaging materials. This may have been communicated somewhere, but I missed it. I believe this case will fit perfectly over the machine packed in its styrafoam surround. I am going to up the product rating from a 2 to a 3 because the case will do its job to keep the machine safe IF you have that packing material. It would be very safe to ship the machine in that configuration. I, however, tossed the machine's packaging the day before as the machine arrived before the case. Unless you pack some fabric or other material in the case, the machine is going to slip and slide around. Luckily, I had some extra fabric to stuff around the sides, but still felt I had to be extra careful moving the case. I also find the case difficult to snap together. Again, it seems to me that original styrafoam packaging would \"push\" the sides of the top out to fit perfectly with the bottom. Since I don't have that, I have to play with it a bit. I love the machine, but not the case. If I actually use it a lot, I will likely replace the case.",
    "Bought this item as a Christmas gift for my daughter and after using it she was delighted. It worked as advertized and with no problems.",
    "I received my order on time. I am really satisfied with my Swingline Electric 3 Hole punch. I really enjoy using and it is very handy having this around at work.",
    "I was unable to find this crochet hook int he stores so I had to order it on the internet. By the time I paid for shipping plus the price of the hook, I could have purchased the item I was making with the hook. However, I was thankful to be able to get it even though it turned out to be costly. It is well made and fit my project perfectly.",
    "I used to sew a lot when I was younger, but just have not found the time. I gave my sewing machine away and finally decided to get one for the occasional time I need one. I looked at this one on-line and it got great reviews...and here is another one! This does everything you need for basic sewing...and beyond. I love mine!!!",
    "The case truly is universal as my Brother sewing machine is very old and it fits well. I had searched for this very thing and now have found it.",
    "We used this to make hand castings of children. The directions were simple to understand and made the project much easier than I was expecting. From this 3 lb box we made ten childrens hand casts. They turned out wonderful with good detail. When I make these next time I would purchase this without any second thoughts.",
    "keep the sewing to the standard, any you'll do A-Ok. Though Mac folks beware, the instruction CD comes only for the PC (you can read the content... just not the viewing order/interactive parts -- be sure to call Brother to request the Video version of the instructions... if you are mechanically inclined.. you won't too much of the instructions to get started... but it'll be helpful with the inevitable troubleshooting.",
    "All I've done so far is make alterations on a shirt (basically sewing seams and hems) but it seems to work fine. I haven't used a sewing machine in at least 10 years but this machine was pretty easy to use and I set it up pretty quickly. If I had never touched a machine before I don't think the instructions would have made sense to me, though.I don't know about the 30 stiches but if you need something very simple and affordable to sew straight lines I can recommend this machine.",
    "I too was disappointed as the front cover on mine was also warped. The magnetic pages allowed the photos to stick well however and I really liked how my 8 x 10 inch photos fit just right.",
    "I bought this to replace a Brother machine that failed after 15 years. This machine's embroidery is superior to my old machine. More stitches and the stitches are rendered better. The action is smooth (but it's the noisiest machine I've ever had). I was pleasantly surprised with the construction of the machine, I was expecting cheap construction for such an inexpensive machine.There are a few bad features. The machine is not very responsive to the presser foot. I'm used to a machine stopping and starting directly with the presser foot. This machine goes a few stitches after the pressure is completely off the foot. And the needle always returns to the up position, so every time you need to turn a corner or do something where the needle must be down, you have to manually crank it a half stitch. The 'reverse' button is in a awkward place and there is a really annoying 'needle threader' that hangs directly to the right of the needle. This can't be removed or moved off to the side, so it just hangs in your way. It would have been a much better design to just include a cheap little threader in the storage box for the people who can't thread a needle by hand.",
    "This paper is has a great texture that holds graphite well. I don't use it for finished art because I prefer sturdier surfaces such as illustration board, but I adore this paper as something to draw my initial sketches and studies on. :D",
    "Previous use of the product influenced purchase of larger selection of colors. Product is excellent. I was very impressed with the speed of delivery.",
    "This easel is so nice, its exactly what I wanted. Plenty of storage in the drawer for paints, brushes, etc. The angle of the board can be adjusted to nearly flat also. As an idea, I purchased an ordinary bread board that fit into the clamps and that is what I use to tape the art paper to on top of the easel, and it works very nicely. LOVE it, thanks!",
    "It comes in handy for art projects. I bought it to scrape watercolor paintings for accent. It also comes in handy for framing and have used it for several unrelated tasks around the kitchen.",
    "I bought this for a little office/crafts station I have set up in my bedroom. Space is a major premium, especially desk space since I don't have much, and what I do have I need for laying out pages to scrapbook. This little ingenious contraption keeps all of my gel pens, calligraphy pens, and scissors handy. I get into it a couple of times a day, not to mention how important it is to me when I'm scrapbooking or writing letters and using multiple pens. It's so easy to see all the pens and their various colours because of slots to hold the pens so each can be seen clearly.The tray is useful as a catch-all for miscellaneous beads, embellishments, etc. I use a lot of small embellishments often, and the trays keep them organized and accessible all while saving space.",
    "We love the idea of this table but found several main problems:1) Cheaply made-- the legs on aon put his foot through the hole in one of the benches while standing on it, which is very dangerous and if my husband hadn't been there to catch him, he would have fallen over with his foot still stuck in the bench3) Stains easily--even crayon marks don't wipe off easily from the surface of this table and marker stains are permanentAll in all, not happy with this product particularly for the price",
    "We use these scissors around children everyday and they work great!!I would recommend these to anyone for many uses.",
    "David Sibley has written an excellent field guide. This book surpasses National Geographic's &quot;Field Guide to Birds of North America&quot; and the Peterson's Series of Bird Guides. It includes a greater number of illustrations and portrays more of the various ages of the birds. One has to appreciate the flight views of the many birds.The colors of the illustrations are excellent. This corrects one compliant of the 3rd edition of National Geographic Field Guide. Advanced and beginning birders will benefit from the examples. The range maps have been adjusted in several cases. Sibley has taken great care in producing the most up-to-date field guide.The accompanying text is very informative. It is packed with information about each species. Sibley &quot;Guide to Birds&quot; definitely shows that years were taken to produce this comprehensive reference.If there is a downside, this book is heavy. Many pages were required to incorporate all the interesting and informative information contained in this fabulous book!Sibley has set a new standard in Bird Field Guides. It will be years before this book is surpassed. Sibley's \"Guide to Birds\" is a must book for any birders library.",
    "Elmer's Washable School Glue Sticks are a good adhesive choice for parents of young children. This product comes from a trusted name in glue and it's a product that can be counted on to perform its intended function with minimal messiness.Like the Elmer's liquid School Glue of old, Elmer's Washable School Glue Sticks also wash out using soap and water. The glue will wash out no matter how long it has been in the clothing. Whether it is still wet or completely dry, this glue can be removed from a child's clothing by washing them in the usual manner, according to the manufacturer's recommendation. There are no worries that your child's favorite shirt or blouse will be ruined when Elmer's Washable School Glue Sticks are in use. One run through the washing machine and the glue is gone.One variation of these glue sticks is the purple color. The product is the same as the regular (white) variety, but the color of the stick is purple. When spread on paper it still looks purple and many little kids will enjoy the color. But once it is dry, it changes back to clear so there is no need to worry that it will leave a colored mark. Some kids won't have any preference but others will strongly prefer the purple color to the plain white variety.Are there any cons with this product? I can think of only two: 1. A single tube doesn't last very long and 2. The product isn't designed for heavy duty use. If a person has a large amount of items to glue, the tube will be used up quickly making it less economical than other types of glue. Also, this is not heavy duty glue. Other Elmer's products can be used to glue all sorts of different materials but the glue in Elmer's Washable School Glue Sticks is not designed for this. Light materials like paper and cardboard are the only things on which this glue can be safely used. If you attempt to use it as an adhesive for something heavier, the glue will likely fail and the object will fall back apart.Overall, Elmer's Washable School Glue Sticks are a very good product for young kids. They are not as messy as liquid school glue and the ease of use makes youngsters less likely to accidentally get glue on their clothing. But if they do, there is no worry- the glue washes out easily. The glue is nearly 100 percent safe for kids and it makes a good choice of glue for little ones who want to exercise their creativity in a safe, controlled environment.",
    "Do you have cats? Do you have breakable items that you would like to display? Are you afraid of your cat vindictively knocking over said items? Fear no more!! I have 2 Bengals and have used this stuff for picture frames, vases, candle holders, and other fragile knick-knacks for the past 5 years. It does not damage or leave marks on furniture and the cats show no interest in the items stuck down by the substance once they realize they can't easily knock them over.This stuff is NOT for use on walls but for holding down objects on horizontal surfaces. It is also stiff and not very tacky out of the package. You need to pull of a piece and manipulate it with your hands. Once the stuff is warmed up, it gets softer and tackier. At this point you affix to the object in question and the surface. It will cool and stick to the surface just fine. You can always re-position later. You just use mild force to remove the object from the surface, remove the putty, warm up the putty, and move to new location. If you do it right, it is not noticeable at all. I highly recommend this for any cat owner with fragile belongings.Thanks for taking the time to read my review, and I hope you found it helpful in making a purchase decision.",
    "This ink has impressed me in many ways.When you first hold it the glass bottle is of high quality. It feels sturdy and strong and doesn't feel like a cheap bottle. The print though does seem a little tacky on this bottle.Regarding the ink, it proves to be one of the most versatile products I have used. It does what it avertises, which is a big positive.",
    "I just wanted to say that I use this pad all the time for my designing. Great paper for my purposes. This time the pad was delivered with a bend in the pad from shipping. I put in for a return, and the new pad was here in 2 days. Also as a bonus of no hassle the old pad was given to me to do what I wanted with it, I passed it on to a kindergarten class for drawing. a win, win. Thanks so much for doing better then the right thing for me.",
    "We have the set by the same name brand that come in a fish that holds the markers. They are great! We bought these as replacements to put in the fish...they are HORRIBLE!!! They fall apart when my daughter tries to draw and the sponge that is meant for cleaning the marker...all it does is smear it! HORRIBLE!!! My daughter LOVED the 1st set! Used them in the tub at least once a day until they were nubs! I dont know whats was wrong with this set?!?",
    "This is a portfolio that is large enough to carry my photographs but light enough that I don't ache after carrying it to an exhibition. It protects my images and is attractive.(The reviewer was compensated for posting this review. However, the opinion stated in the review is that of the reviewer and the reviewer alone. Further, the reviewer independently selected this product to review and has no affiliation with the product maker/distributor, Amazon or the review requester.)",
    "This seam ripper does what it does, it rips what ever you want to rip. Its strong and sturdy. comes with a protector cover to avoid injuries. The size is just right for handling.",
    "The worst product on the market hands down. Call me stupid for not reading the reviews before hand. They will tear up your ring rip clothes and stab a person in the hand.",
    "I have always been a fan of matte paper, however, I have been experimenting with Epson Lustre and it is the best for definition and over all in every catagory. Tks Amazon.",
    "Be warned when you buy this that the length is not 2 yards as advertised. It is only 1.5 yards!",
    "i recieve my packages in great condition.thank you,danielle m. moore",
    "This works great for one layer of fabric - but does not work that well with 2 or more. The pair I purchased seem to be less sharp back towards the handle which quite frankly could just be a defect in my pair. The handles are easy to use - the spring action obviously makes it less fatiguing on your hands. I just wish I could find a pair of pinking scissors that worked on more than one layer, since I use them to cut the ends of new fabric before I wash it; it reduces the fraying that often happens in the wash/dryer.",
    "I am traveling and it is a smart tool to have for quickjobs. Although, I have misplaced the instructions to fillthe bobbins with higher quality thread. I believe all theattachments are here with me. Unfortunately, there isn't anybobbin coding system or marks on the machine to indicate theprocess for threading them. Someone with no experience would'ntbe able to figure it out. I will not give up. I'm stickingparts in the various holes to test which way works. Oh, by theway, don't drop the little spring, it's seems to be a vitalpart.",
    "I was so intimidated when I received this, I let it sit for a whole weekend before I tried it. I didn't need to be worried. It is easy to operate and I am thrilled with the two &#34;infinity dresses&#34; I made. These infinity dresses were made without a pattern, and I am just a beginner at sewing. The four thread stitch still allows plenty of stretch to my spandex fabrics and made these two dresses total successes.I was really worried about threading the machine. The good news is there are lots of good instructional videos on YouTube. (The videos that come with the machine are old, out-dated, and only run on Windows computers. They are worth a quick look, but the YouTube videos are much better.) Even better, it comes with four reels of thread already in place. This was enough to make both dresses. The best tip: when you almost run out of one thread, tie a new thread onto the end and let it run right through the machine. Works right up until you get to the two needles. The other two threads have no needle eyes or problems.If you are a beginner, like me, I think this machine will help you with those stretchy fabrics.",
    "we bought these as an inside toy to have around the house for my sons train themed party which was a big hit and now we use them for fun with either push cars or our ride ons outside or in the playroom. the base falls off easly when picked up but theyre strdy and cute when in use.",
    "it came very fast only a few days and I ordered it on christmas eve. the lighter is the full fledge pb-207 with no child lock which was exactly how it was advertised. i would recommend this to anyone looking for a good pocket torch lighter.",
    "I actually love this pattern. By far my favorite out of all the ones I have bought. Just so cute!",
    "I can hole punch 30 sheets at a time now, which is great when you're a tutor.It's big but worth the space when it saves so much time.",
    "I love the pictures and I am working on getting the complete set.I am enjoying the work. Thank you.",
    "Good, basic calfskin watchbands for a very reasonable price. They won't last forever but appear to be very well made and I won't shed any tears when I have to replace one when it starts to look worn.",
    "It is 18\"It is black as promisedIt separates at the bottomIt is metalI am using this to replace a zipper in my granddaughter's jacket.WHY have they substituted plastic zippers for kids?Glad I was able to find it on Amazon so I could use Prime.",
    "This is a wonderful alternative to traditional thimbles as you can place it on the side of your finger, my grandmother has arthritis and this is easier for her to use.",
    "Let's face it. This lovely paper is not suitable for every image, or every kind of image. But if you like to work creatively, it is a very nice paper to have on hand. When you find the right image for it, I think you'll know before you ever hit print.",
    "My daughter received this bead set for her 3rd birthday. The hand painted beads are bright and attractive, and she was eager to start beading. However, the rough texture of the wood on the inside of the beads makes it a frustrating experience- she isn't able to bead without assistance. We ended up exchanging the beads for a set with a smoother interior surface. My sister also purchased these beads for her nearly three year old, and she had the same experience; her daughter was unable to string the beads- the laces snag on the rough interior surface, making it difficult to bead.",
    "When I received this product, the sleeves were separated from the binding, where they should've been attached. Completely unacceptable, even at this price.",
    "I use this foot on oy Bernina 920 machine. It does it's job well, though it takes lots of practice to get your handing feeding the fabric just right.",
    "I've owned a Singer and wasn't impressed. I have owned 2 other Brothers in the past and liked them fine, but this is an exceptional machine. I've never had anything like it. I was so impressed, my mother wanted one and has recently received it. Don't waste your money on an expensive machine, this is a great deal and you won't get more for you money.",
    "I stitched this as a gift for my mother who is a seascape artist, oils. She gets compliments from people thinking she painted it. I have moved out of state and miss it so much I am going to stitch another for myself.The kit is very involved and tedious due to all the colors and the aida cloth count, size 18, but so totally worth it. It took me two years to complete the kit.I framed it in a wooden frame for my mother but for myself I will see about a metal frame as that is what I like.You will not be disappointed in this kit.Happy stitching.",
    "PROS1. Very hot flame2. Larger tank size for the overall size of the tourch3. Easy to fillCONS1. Flame will only light on highest setting2. Flame often goes out a second or so after lighting3. Flame goes out with even the lightest of breeze4. The flame will go out for no reason from time to time5. The 'stand' for the torch is poorly designed and makes it very hard to keep it levelAt over $30 there is no excuse for such poor quality/design. Please look elsewhere for a quality torch.",
    "These sketchbooks are really great. The lighter paper makes for more pages. The pages have sufficient \"tooth\" to grip your media, but aren't as stiff or toothy as the 80 lb paper. The pages are large. Since it is spiral bound, it is easy to flip pages behind, rather than having to tear them out and store them.",
    "So far I haven't been disappointed. They do what they say and they are sturdier than I thought they would be. Thanks for the cutters",
    "This machine is fantastic. It has many features and gets the job done. A lot of value for very little money.",
    "I make a lot of craft items using straight pins such as beaded Christmas ornments,curly ribbon wreaths, etc. and these pins are perfect! I had tried another brand and they bent easily when you tried to stick them into styrofoam and wasted a lot of them. I made a curly ribbon wreath for Independence Day and these pins worked out perfectly. Not one bent or failed to go into the styrofoam. The point is sharp for easy insertion and the metal is not soft to avoid bent pins.I am very happy with Singer's pins and will more than likely buy more for future projects.",
    "I have had nothing but trouble with the machine since I bought it. I used it only a few times and it started breaking needles. I looked in the manual and it said that the bobbin case was scratched and so I bought another at $35.00 and that did not work. So I decided to see if a professional could help. Well he did for a short time and then it started having the same problem. I spent $80.00 to have it fixed the first time and decided to take the next $80.00 and apply it towards another machine instead of getting frustrated again.",
    "This one is perfect size if you are not doing sewing for big projects and you have less space for your sewing area.. It comes into use for all cutting i do.",
    "I bought the quilt years ago and somehow lost my color directions so I was never able to finish it. I was so excited when I found this on amazon the exact same thing that now I can finish both and have it out year round",
    "I recently purchased this machine through Amazon, and it was defective - the feeder teeth that move the fabric through the machine did not work/move at all. I called Simplicity's 1-800 customer help number at least 10 times; a machine answered every time. I left three messages and NEVER received a call back in two weeks. No other number is listed for the company. I finally returned the sewing machine through Amazon. (And I can't say enough about how great Amazon is about returns when something is wrong with the product - much appreciated!) I then bought another sewing machine but it is NOT a Simplicity - why buy from a company that won't even return your calls? I got a Brother instead ... so far, so good.",
    "I ordered the popup snowflake punch, what I got was a regular snowflake punch. Very disappointed as I could have gotten a regular punch at any bookstore or toy store locally. However as I'm overseas, returning is unfortunately not an option.",
    "A little difficult to figure out at first but totally amazing product once I got the hang of it. I will be purchasing one for my mom soon!",
    "This is my first Amazon review, so I am pleased to say I'm very happy with these snips. After I made my first rag quilt using traditional scissors and suffering extreme hand soreness for days, I knew I had to do something different for my future quilts. Since I've started a little rag quilting business, I ordered two different scissors to make sure I always had scissors to clip my quilts and the other scissors stopped working after one and a half lap-sized quilts. But, so far these Fiskars have not failed me & after 6 quilts within the last few weeks, they are still going strong. They did start to catch a little on my last quilt, but my husband adjusted the screw by the blade and they were good as new. If you plan to make more than one rag quilt, I would definately invest in these because your hands will thank you!",
    "I ended up buying this at walmart. it was 114$ plus tax. It seems to sew very good and has alot of neat features that i havent even attemted to use yet. It is easy to thread and has an automatic needle threader (I have never used one and was suprised at how easy it was to use).",
    "Just received my Brother SE270D computerized sewing and embroidery Machine. WOW. It replaces my (35 year old) Kenmore. My how technology has changed the world of sewing. I love and would highly recommend this machine to any level of seamstress. Delivery was prompt and the price was right! Thanks",
    "This is a pefect gift to combine with good quality modelling clay. My 2-yr old luvs this and develops dexterity and coordination using these. I'm going to add some cookie cutters to the set.",
    "My kids loved these. They worked great & lasted about 2 days on light colored hair. They are a good way to play with color without it being permanent. They can see what they like and don't like. I would recommend these",
    "I bought this book to be an on-the-shelf reference (it is definitely too heavy to be a field guide, and is not meant to be), but now I would buy it just for the beauty of the drawings. They are fantastic. I think any person at least mildly interested in nature would like it just for the beauty and details of the drawings.Apart from that, together with the &quot;Guide to Bird Behavior&quot; it will also do everything you could possibly expect from a birding reference book.",
    "This construction paper was of very good quality and is extremely durable unlike those other cheap kinds you buy at your local store. I bought these for my 2 yr old daughter who loves drawing and she had some metallic crayons that would only draw on black paper. I would say go ahead and purchase it if you're looking for some good quality construction paper at a decent price. Prompt shipping as well.",
    "I received my kitchen shears today and they do not appear to be the same as what is pictured and described on Amazon. The blades are extremely short. Too short to do the kitchen tasks described in the reviews. Since the product reviews are all several years old my guess is that the item has changed. Amazon needs to update the picture and the product descpription to accurately reflect the product. Otherwise you will be disappointed.",
    "These scissors have a lovely positive action and extremely comfortably grips. The edges seem a bit rough and they were not great for collage on paper-Matisse would probably disapprove. A bit of hand-sharpening improved things, but it doesn't seem like you should have to sharpen brand new scissors.",
    "In fact I may order one for myself. I ordered this for my 13 yr-old grand-daughter and she was thrilled with it. It arrived in just a few days and I would have expected to pay a lot more for this quality (granted, it was on sale).I'm completely happy with my purchase.",
    "I collect vintage children's books and as with many vintage books there are often tears in the dust jackets. This stuff is absolutely a necessity for repair and reinforcing damaged areas. The tape doesn't yellow, crack or lose its glue over the years and when a book is stored. I have also used it to reinforce paperback book covers, magazine edges, and especially on well loved books that my three grandchildren have worn out. Great for spines on the Scholastic type paperbacks, for repairing ripped pages and covers. If you are a reader who treasures books you'll find a lot of use for this product!",
    "I found that some of the tiny pieces I placed in the 150 would flip over before they reached the tape. I have to use really long tweezers to make sure it goes in properly. You can't just reach your fingers in easily to get it out, if it flips. I couldn't do it without the tweezers. It's great for the bigger pieces. I don't recommend this if you are doing a lot of pieces at once, because you have to rub a stylus around all the edges on the outside, and the inside. Otherwise, when you pull off the tape on top, you'll get sticky on the front of your pieces.",
    "I received my yarn order promptly and it was about 15% less than what I would have paid in local stores. Now if it were only eligible for Amazon Prime, this would be a GREAT buy!There are many specialty and hard to find yarns available on Amazon--this was quite a pleasant surprise, particularly because they are generally much lower in price than in my local stores.",
    "I was a bit apprehensive ordering pastels online for fear they would arrive broken. Fortunately they arrived intact and on time. Good deal considering my local art store was asking more for the same set. Haven't tried them out yet, but I own a smaller set of Nupastels and they are my favorite pastels.",
    "For $[...] I expected much better quality. The thing fell apart after just over a year.",
    "I received this machine as a gift and immediately started sewing. I've sewn purses and bags with this machine with hardly any trouble. I've recycled jeans and used denim over and over. While I was finishing a denim bag today, barely a month after receiving it, something on the inside of my machine snapped and started grinding. The needle no longer moves and the machine will barely turn on. I'm sorry for my mom, who purchased it for me for Christmas, as it isn't worth what she paid for it, never mind all of accessories and material that we both purchased. All of this after Amazon sent out the machine and it was stolen by UPS! Buyer Beware!!!",
    "I'm not sure why there are so many negative reviews of this serger. Because of the reviews, I decided to buy the Brother that is priced similarly but with better reviews. However, I had a gift card to Joann and this was the only serger they sold, so I ended up getting this one figuring I could return it if it was as bad as the reviews say.I was pleasantly surprised to take it out of the box and immediately begin serging. It came already threaded and ready to go. I had no serging experience and it took less than 2 minutes to figure out how to start. After a week or so of regular use, a thread broke. I figured, \"Here it comes. Here comes the part everyone is complaining about.\" I looked at the manual and it took just a few minutes to rethread the broken thread and start serging again. Again, I cannot figure out what everyone is complaining about.For a final test before I wrote this review, I decided to unthread and then rethread the whole machine. It wasn't that it was that hard, it was tricky to thread the needles, but really it wasn't that big of deal using the tweezers that the machine came with. Honestly, I found threading my regular sewing machine for the first time more challenging when I first began sewing than I did puzzling out how to thread this serger. So I'm very pleased with this purchase. It serges well and is easy to use, so I'm happy.EDITED 1/13/12The tension got wonky after a few months, and I haven't been able to use it. I had a friend who is quite experienced with sergers look at it, and she wasn't able to adjust the tension to get it working properly again. So it's just been sitting on my sewing table collecting dust. I will probably take it to get serviced, but I hate to shell out the money to have it serviced when it is still so relatively new. However, I haven't come up with any better options. As a result, I'm knocking off a couple of stars because it only really functioned well for a few months.EDITED 12/9/12I did take it to a repair shop and spent $65 to get it serviced. It has worked fine since then. If I had to do it over again, I would have bought a different brand, but that being said, after servicing, this serger has worked fine again.",
    "I am a novice sewer and finally killed my first 80 dollar singer. I wanted a middle of the road quality replacement. This one has been a fabulous machine, sews quickly and efficiently, come with tons of extras, most of which I haven't even tried yet. The automatic threader is more work than it's worth I think but perhaps it will become easier as I learn the machine for now it's easier just to thread the machine without it. So far so good.",
    "I bought this to hold my whiteboard up, and sure it does indeed do so. However, if I apply just a little less than baby pressure, the locks that hold the white board up loosen and the whole thing falls. It happens quite a bit, but personally I've learned to be very sensitive with it.",
    "I bought this 3 hole punch for work, based on all the positive reviews.I definitely agree with the other reviewers... This thing is diesel and easily goes through up to 40 sheets, maybe even a little more. The holes are consistently in the center of the paper and it never gets jammed. Everyone at work that borrows it comments on how well it works, too...",
    "Too small, has a seam around the edge that moves and ends up in the middle of your shirt. Is too thin, shirt ends up with a Chicken wire design ironed into it.",
    "This is a good looking, smooth handling 2 or 3 hole adjustable punch. Solidly constructed it appears to be a great value at Amazon's price. Just received it but it looks smart and works well so I am pleased.",
    "I was very pleased with the items that I ordered. The company did a good job of fixing a mix up in shipment and it cost me nothing to rectify it. My husband is very happy with his 5 year Wedding Anniversay gift. Was exactly what he wanted.",
    "This is a very basic, useable but limited, wire drawing tool which can be used to reduce size of wires or chains (annealed, of course). This plate, however, is simply drilled from both sides, therefore creating a taper from both sides. But the taper is not polished nor shaped at all, and the results will be rather limited and the surface very scratchy. Since I did NOT purchase this draw plate to pull wires, but to use for putting a head on when making rivets, it will be fine for that.A good quality draw plate will be well tapered and have highly polished inside surfaces where the wire will be pulled through; this one is not at all like that. But you would pay about 10 times the price for a 50 hole draw plate of that quality, and quite a bit more for hard, long wearing carbide inserts.The drawback of the carbide inserts as compared to tool steel is that carbide is so much harder that it can be fractured if struck or even if the draw plate were dropped (under the \"right\" circumstances). And carbide can only be polished using diamond powders, while tool steels can be re-polished using the standard polishing media, so small scratches can be polished out if they occur in tool steel drawing die. And I have scratched carbide drawing dies, so it can happen.The bottom line is that this draw plate may do for a starter; but you should consider something a bit better if you plan to use it for drawing wires or chains.",
    "I am a BIG fan of Prismacolor Pencils and we use them in our graphic dept all the time. What I noticed was these were not as soft as what they used to be. I'm not sure if Prismacolor changed their pencils or if it is this particular pencil box. It did say Soft Core Colored Pencils so I was expecting them to be softer for an easier blend. BUT they are still very good quality and would recommend Prismacolor over any other brand.",
    "I have had and used a Buttoneerfor the past 15+ years. Skometime the fasteneer does not catch or breaks, but overall it is quick and effective in adding a new or reattaching a button. For awhile it was unavailable so I am happy to see it again available.",
    "I have always wanted this type of scissor as I grew up with mentors in crafting that used them. I also find that they cut quite sharply.",
    "This past weekend, I finished a painting I had been working on for a week that included markers as well as acrylic paint. I took the project outside to spray, and the markers ran all over the painting. I am starting again tonight with the painting! Very sad. The markers were permanent, and it says on the can that this does not smear...liars!!! ;) Just thought I'd give a heads up!Other than that, it is a great product, :)",
    "The Crop In Style XXL Rolling Tote is excellent for storing my origami supplies. When I teach, a lot of my time is spent planning, loading, and transporting supplies; when I get home from class, more time is spent putting things away. Now all of my supplies are in one place and easily transported from home to class. I have more time and energy for folding and teaching. Though it is heavy when fully loaded, the tote rolls easily, and feels sturdy and secure. Strong handles on the sides allow you to lift the tote from floor to table. If I could change one thing, I would make the interior a bright color such as yellow or red, so that any items at the bottom of the tote could be seen more easily. Even so, this is an excellent item, and a good value at the price offered at Amazon.",
    "The product lists itself as a giant paper pad, but there's nothing giant about it. It's a standard 11 x 14, but not large enough for floor projects. I purchased a Giant paper pad at toys r us instead.",
    "Borrowed a Buttoneer from a friend to see how well it worked. After 10 attempts, I finally got one fastener to hold. Would be easier to spin the thread, make my own needle, then hand sew it the button on. Skip the aggrevation. I would have rated it a zero if I could have.",
    "Was a bit disappointed when I received the item in the mail. Container holding the charcoal was tin-ny and cheap. I guess the contents themselves (pieces of charcoal, other pencils) were all fine- it's just that the presentation/box it came in was lacking. Also discovered that the outside cardboard and plastic packaging was damaged and partly opened. Made me question how reputable the company was- and why I didn't just go for a more recognizable brand (Faber Castell, Strathmore, etc). Disappointed since I was giving it as a gift. Ended up purchasing another set- post-Christmas, a Prisma-Color collection from Strathmore. The packaging/presentation was much nicer. I guess this set would have been fine- if you were looking to pay less money and didn't need it as a gift.",
    "I have tried many papers as an amateur photographer. I have an Epson Stylus Photo 2400 printer. I use the UltraChrome K3 ink and get absolutely incredible results. It is as sharp as the glossy (or nearly so) and doesn't reflect lights back. It dries almost instantly. It feels like a photo. I always get complements.",
    "quick delivery the only thing is I thought it was sectioned for different pain colors. Even though it isn't it will work well",
    "I bought this with the intention of learning how to carve rubber stamps. Although I haven't gotten to spend too much time trying to learn this craft, I will say that this stuff carves really smoothly. There is the issue of the ends not being level due to the cutting process at the factory so there is an 1/4\" border that is unusable.",
    "I paid ~$4 for this product. Over many years, I have used tons of this product to.....1) Attach rather heavy metal/plastic surge protectors to walls2) Secure a rechargeable mouse base to a wood desk3) Stick a plastic USB hub to a plastic desk4) Hold a plastic motion detector light ~7 feet over one of my desks - On a wall5) Secure various wires that are frequently used6) On various other objects around my house* Before applying to any surface, I sanitize the surface and let the area dry. Then, I stick the Velcro on and make sure it has thoroughly adhered. Lastly, I stick the objects together and do not move them for hours. This procedure and product only failed when I did not use enough Velcro. This item is like double back tape, but more useful.",
    "I learned a lot from this DVD, and found it inspiring. I was recuperating from foot surgery, so could only sit with my foot elevated. This DVD not only helped pass the time, but provided me with ideas and motivation for when I could get back to my crafting!",
    "This would be a marginal cleaner if it had power; after 3 minutes of use the tiny, fragile filter [for which replacements do not exist] gets full and you must stop, remove and clean this useless filter. Be careful, it's made of thin paper and if you tear it you might as well throw the vacuum away. I have waited in vain since August 2005 for replacement filters. It is now January 2006. Still waiting.",
    "I bought this toy for my 2 1/2 year old granddaughter. She loves it and I would highly recommend it to others. Right now we are just stringing whatever feels good. But as she gets more comfortable with that part I will start showing her how to make patterns.I am satisfied with the quality but I think a more rambunctious child could break the pieces if they played too hard.",
    "It is useful to have such tools and the affordable price allows us to have them handy for any occasional work doing crafts of some sort.",
    "This is a wonderful product and I may be buying more. Love organization and I have so many flosses that I use when embroidering that this piece works well.",
    "I needed some stuff sewn by machine and having it done by someone else would be too expensive. I asked my wife and she told me that she didn't have the skill level required. So, I bought this machine, followed the directions in the printed manual and now I'm sewing all kinds of fabric together. (Some of it is even usable when I'm done.) For a first machine this is wonderful. It won't do thick multiple layers (I've done 4 layers of fleece, but it didn't like it.) and I wouldn't try leather unless it was really thin, but it will do the basics and then some.Cautions: Use good thread or you will have problems with your thread breaking or tangling on the bottom. Don't sew too fast for the fabric you are working on or your thread will break. (Fleece requires a medium speed at the most.) Don't try to start too close the the edge of your fabric or the feet won't feed. (At least with fleece.)Tip: When sewing fleece use masking tape to stabilize the fabric and keep it from stretching and bunching. Just don't sew through the tape; sew next to it. After testing several stitches I've been using the triple stitch (02) at the lowest settings for fleece with good results. (Yes, I've been sewing a lot of fleece. It's one of the major reasons I bought the machine.)",
    "Just a board and two smaller boards. Not worth the $70 I paid. You can go to home depot and buy board for $10. Crap!",
    "While not a skilled carver or whittler (read: complete beginner), this was leaps and bounds better than carving with a pocket knife. It was suprisingly sharp right out of the package. I would recommend buying a strop or sharpening rig with this to keep up its edge.",
    "I love this yarn it is so nice, the colors are great quality and so is the yarn. There is a good amount to make lots of knitted stuff or crochet! I am so pleased with this purchase I am looking forward to more in the future!",
    "These hooks are awesome. Mine came with all 10 sizes f-n as advertised. They are light weight & glide through yarn easier than aluminum hooks. Will recommend to friends!",
    "I have used this coloring several times and always end up with a weird purple fondant instead. I even have a hard time making gray. You could use the method of mixing the dye to the melted marshmellows or using dark modeling chocolate with it to give it a base (Google: How to make Black Fondant) but from what I've read Americolor has a better black dye. I use Wilton products all the time but this one is a dud.",
    "The brushes were ok but the largest shed badly and was more trouble than it was worth to use.So I would not recommend this set",
    "The product is easy to use and with an online video from Bernat, I was good to go. See: [...] for the best instructions on how to use the Loom.",
    "Since these are so thin, they don't make holes in your work. The other thicker rings make gaps in fine knitting. Be warned, though, since these are so thin and light, they tend to get lost easily so buy extra.",
    "Love these markers - a little pricey, but completely worth it. Every artist/architect needs them!",
    "The cutting mechanism is not properly aligned to begin with, so that the hole does not punch properly. Beyond this, the metal in the tool itself is not very strong, so if you press too hard you will bend it, rendering it completely useless.",
    "Had the privilege of attending an air brush workshop, not put on by Badger, But I learned shaking is not the answer....Had &#34;problems&#34; learning to airbrush..All have gone away after using this mixer. It doesnt just move the big clumps around in the bottle, it shatters them into usefull paint! Totally blends even old paint, partially dried when mixed with thinners..",
    "The price for these scissors is the same as what it costs for 1 pair of my favorite scissorsWestcott Titanium Bonded Non Stick Scissors, 8\" Straight. I've had the others for about a year and I panic when I think my children have absconded with them. They have been awesome. Because I have liked them so well, I was very curious about how these would handle. These scissors are great for paper, but they don't do as well on cardboard as my other pair. The handle feels slightly cheaper (I like the ridges on the other pair). I can cut thin fabric with them and tape as well. These scissors just feel differently than the other pair. They're lighter duty scissors, clearly. For that purpose, they're great. They do cut evenly, easily, and are comfortable to hold. For the price, they're a good value, I think. If you need heavier duty scissors, I'd recommend looking at one pair of the others.I'm thankful to have two more pairs to spread out around our house. Hopefully now my really good pair won't go missing!",
    "Like one of the other reviewers, I ordered this as a pack of six. However, it arrived and it was a single canvas in a giant box. What happened to the other five? When I contacted Amazon, it says that they're out of stock for these. Why is this happening to more than one person? Just be sure to check your box. The canvas was nice and actually what I wanted but I didn't want to pay for six and get one...",
    "Christmas morning we opened presents and that afternoon we started our first set of rocks to polish. Our whole family has injoyed the amazing transformation of the rocks as we complete each step. My 10 year old loves to collect rocks and wanted this toy more than anything, and my 5 year old has fallen in love with the beautiful gems. They come out smooth and shiny like the ones you see for sale... We have transformed a little over a pound of rocks since we started and the Tumbler is still working like new. As a Mother I am impressed with how much interest my children have taken in erosion. My 10 year old has been reading books on the forces of nature in its natural state and the changeing of lanscapes, and as we clean the rocks and prepare for the next step in the Tumbleing process He has been eager to tell my 5 year old about the entire process and how it takes millions of years for a rock to get like this naturally and we are doing it in less then one month. I am considering getting another one for my younger child to have to polish her own collection of rocks. If you are considering getting this toy I am sure your family will be as satisfied as mine is.",
    "A little over a year ago I bought my wife a Brother CS6000i sewing machine. She and two of my daughters have used it for quilting, re-upholstering several chairs, and general sewing with good results. Based on their experiences, second one was purchased for my younger daughter. Enough said?",
    "I had glasses that were covered with about a million fine lines and was having eyestrain using them. The warning next to the product name scared me, but I really felt I had no choice-- it was either this or buy new glasses! I followed everyone's advice: I washed them gently, then applied Armor Etch to a small section to see if it would work... it didn't seem to do anything, but then realized there was still film on the other side of the lens! So I just went for it, applying thickly to both sides of the lenses, still in the frame. After about 5 minutes, I rinsed, and it was amazing! There was still a little film stuck on there, but with a second application,it all came off. If you are worried like I was that it wouldn't work, don't worry, it works!!",
    "I bought this for my 5yo's and they love it. I can't tell you how many sheets of paper they have covered with images they just traced over and over. However they love it and for that so do I.",
    "Content and quality are quite good. Our grandson loves it as much as his video games. It appears to be a well made box.",
    "I am new to embroidery but this little progam is great for a beginner and advance. I just wish the blank memory cards were cheaper.",
    "These handcuffs were okay, but I thought they could of been a little smoother, and easier to open but otherwise they do everything they're suppose to do..",
    "This board acts like a cross between watercolor paper and an etch-a-sketch. Using just water, your brush strokes go on and quickly appear as dark lines on the board, but as the water dries the lines fade to shades of grey and then disappear completely. Unlike real brush and ink, this never gets messy, as it is only water. It's wonderful to practice brushwork for caligraphy or drawing, but becomes its own separate art form due to the added element of the drying times. (Which part of the drawing will disappear first? Which parts become shadows instead of lines?) We left ours out and set up for a week after we got it, and found ourselves casually stopping to paint an image. It is relaxing and enjoyable for any age.",
    "Does what it says. Very inexpensive. Holds my decorative plate (10 inches in diameter) perfectly.",
    "I ordered this TV stand after looking for a very long time for a stand that had the storage capacity I needed. The stand was ordered on 12/27/08, with an estimated delivery of 1/6 to 1/9/09. It wasn't even shipped until 1/6/09, and didn't arrive until 1/15/09. When I opened the box and began assembly, half the screws for the first step were missing. Also a shelf was packed damaged, as there was no damage on the box. I am now waiting for the replacement parts, which were ordered 8 days ago. This may be a lovely stand when it is assembled, but it has been nearly a month since I ordered it and I'm still waiting to see it put together. Update: 12/26/09 - Parts arrived, stand was easy to put together. However one of the doors is binding. Does not effect the look of the stand. It is a nice addition to my livingroom. Would now give it 4 stars.",
    "I own a Hot Off The Press - Home Pro Eyelet Setterit is okay, just one click and you set the eyelets, but it kind of deforms them a little, specially those with shapes like stars or flowers, I don't know if I don't use it correctly, but I tried many ways and my eyelets always looked a little funny and I lost several shaped ones that got so deformed I couldn't use them, and since I couldn't use it on the middle of a 12x12 paper I figured I would try a different setter.The Making Memories instant setter is so easy to use and I love it because:1. You can place your eyelets anywhere.2. Even though it takes about 5 pushes to completely set an eyelet it is easy to do so, and I am 8 months pregnant.3. The eyelets looks great, nothing is deformed, not even the cheap star eyelets I bought, it has different sizes so I can finally use those 1/4\" mickey eyelets I bought on Disney4. The case is pretty and organized.",
    "The Lobo is very easy to assemble. Good quality oak wood. Durable finish. Very easy to change from upright to table.",
    "I have a Badger 105 airbrush along with a couple of Badger 150s. They need supplies regularly to keep them going. Buying the needles, tips and other expendables from Amazon is great because the Badger company is the one who supplies the parts quickly, at good price and with excellent customer service. Five Stars.",
    "Good product, but I only paid 300 $ for it at Wallmart in NY.",
    "Considering the price of a tailor form this is a good deal even after the adjustments. The only itch was a custom fee that was an extra COD.",
    "A bit time consuming for kids to use. I bought them for my little handicapped kiddos and they really were quite safe with them and it really builds up hand muscles but don't use them for large crafts as it will be too taxing for their hands. I took them with me went I switched to kindergarten and they also worked great for the little ones who are not quite ready for regular scissors. I also used them during center time so that all the kids could be independent with a cutting activity no matter what their level of scissor skills.",
    "I used these at a center for my kindergarten children. I sorted the letters into fishing tackle boxes and used pipe cleaners instead of the strings. The children were very productively \"busy\" at the center. Great product for families and classrooms.",
    "First off, the basics, which seem to be lacking in the product description: 51 sheets, 17 colors, including primary colors, fluorescents, and metallics.This paper is probably a good choice for kids or origami beginners. The paper is thick, glossy, and bright, making it easy to fold and fairly vivid for designs. It's hard to get delicate with small folds, though, because of the thickness, and the one-color sheets (which are white on the back) aren't particularly interesting for use in designs, once you've made a few.The enclosed booklet is pretty basic, and includes five designs: airplane, swan, fortune cookie (looks like classic \"fortune teller\"), wishing star, and inflatable cube. Again, good for absolute beginners, but it's not a set of paper that I'd buy more than once.",
    "I am new to sewing, but not totally novice. I had helped and watched my mother and grandmother sew clothes for my sister, and took a few sewing lesson in home Eco. So, I would say that I have a very basic understanding of sewing. I have had my machine for at least 1 year.Things I really like about the sewing machine is the ease of which you can get the machine ready to go, and the automatic needle threader. (I hate threading needles).Now for the problems with the machine:The light by the needle is not nearly as bright as my old singer sewing machine. Almost to the point of saying the light is worthless.The cloth guides are only around the needle area. since the bobbin cover is clear plastic (instead of metal like the old days) I find guiding the cloth to be more of a task. Of course the task is not impossible, but for a beginner, it is slightly annoying.The sewing machine is extremely light weight. I do not except to get years of service out of this machine.And I wish there would have been some better instructions included with the unit.",
    "I was a bit disappointed by how small it was, but that was my fault for not looking at the specs.It was shipped promptly and came in perfect condition, Thank you!!!",
    "Mrs. Spudman tells me that these are her favorite pair of scissors, and she has no shortage of scissors. She uses these Fiskars for her sewing and quilting projects, and they never fail her. For a very sharp, comfortable pair of scissors that can cut through the most demanding of fabrics, she highly recommends these scissors. Even after several years of frequent use the durable Fiskars have maintained their sharpness and good performance.She let me make a few cuts with her favorite pair of scissors, and I must say they are very comfortable and quite remarkable in function.",
    "I suppose that you could, if you so desired, tote this volume with you on your next birding trip. It would without a doubt help you figure out just what in the world that little brown job skulking in the brush pile might be. You could also mark it up with various notes about what you have seen, where you saw them, oddities, etc... There is plenty of room on the oversize (for a field guide at least) pages. I must say though that if you do either of the above things you had better buy two copies as the book is just plain gorgeous to look at and marring the pages seems a sin.It is clear from first glance that this is book is a labor of love, created by a man who is at the top of his field. The paintings are beautiful the text lucid. I could heap praise on this book all day. It is that good. I do however not think that it is really a field guide. It is too big and the two regional guides (Eastern and Western) that Sibley published after this one serve that purpose far better.Bottom-line: this is the best armchair field guide that I have seen.",
    "The trolley is a good size and is made of a good material, however the wheels are lacking. I have used it three times and one wheel has already split. I would not buy this product again because without good wheels, it is not usable.",
    "I love these little things. I take a large, medium and flat along with a portable Cottman watercolor kit and use them for sketching. They're under the size limit for liquids in carry-on luggage, which makes them an excellent airplane companion. I can't recommend them for really rough cold press paper though as the tips (even on the large) are so small that wear on the bristles becomes noticeable very quickly and makes it hard to get a really fine lines. I would also recommend carrying a larger brush for washes or just unscrewing the tip and dropping water directly on the page as covering a large area with the tiny tips on these things is a pain. But, they're great with a Moleskine watercolor sketchbook or a real smooth hot press. Arches 140 lb hot press might even be a bit rough once water hits it and the surface starts to get worked up.",
    "These cutters are worth the price (an arm and a leg). They make my jewelry look even more professional and are a pleasure to use. Wish I had found them 10 years ago.",
    "This being my first scrapbook attempt, I found that the Pioneer Family Treasures E-Z Load Memory Book was easy to use and I found that most of the colored paper was designed for the 12 x 12 features. Nice and heavy duty construction. The plastic cover is an added feature to help keep the book looking clean. The plastic cover also allows one to added photos, etc without the fear of tearing on the outside of the book.",
    "Worked great in a laser printer- no smearing or paper jams etc. Perfect for the project I bought it for.",
    "LOVE this machine! Very easy to use and so quiet! I love the cassette that threads the machine and top loading bobbin. The embroidery part worked great the first time I used it. My favorite features would have to be the thread cutter and the ease of not using the foot pedal (although included). I think this is a great machine for beginners and those like myself who have been sewing for years!",
    "These blades are just as described, just like the stores and at a wonderful price if you do much quilt cutting they save lots of time. Thanks for the quick service.",
    "These paints have been wonderful. I purchased them for my toddler and they work well. It does take a little bit of practice for them to be able to hold the bottle straight up and down, but my two year old is able to do it. The paints are a wonderful alternative for traditional finger paints (for days when you don't feel like washing down the walls after art time...). They come in vibrant colors, dry quickly, clean up easily and overall are a lot of fun.",
    "At only a little more than a dollar a pair, you really can't go wrong here, especially when if you get caught during the wrong part of a supplies sale and end up having to buy the expensive pair at like $5. They cut as well as to be expected with kid scissors, but don't expect to be able to carry it around in the box. It's very flimsy and arrived to us nearly busting open, so you'll probably need a small plastic supplies case to store them in properly. A great bargain.",
    "This was the perfect sewing machine for those that don't sew a lot. It is light and portable and easy to use.",
    "This product is fantastic, it's very easy to use and is easily the most for the money. Unfortunately I bought it from a company with a 95% rating, I've learned my lesson. The powercord that plugs into the actual machine, the one you have to have to make it work, doesn't even fit ! And this product was supposedly, \"New\" ? How is it new if you pop in an odd sized cheap chinese made power cord that doesn't even fit the Brother machine ?",
    "Shipped fast and looks great, I love it being borderless.But really, who is the model in this picture? She is gorgeous. I think I am in love.",
    "I use these pigments as inlays for my wood turnings with CA glue. Great colors and depth. Definitely reccomend these to everyone.",
    "I bought this little gadget and then didn't open the package for months. It just didn't look like it could possibly make much impact. It did a great job sharpening my scissors. It saved my old utility scissors from the trash can. They are as good as new. And I no longer have \"junk\" scissors for use on plastic and \"good\" scissors for use on paper only! This little thing can make them all like new. It may not perform like the more expensive sharpeners, but it does a great job and the price is right.",
    "this sewing machine is great it has all the stitches that my wife needs and more",
    "The case is wel built. It is much to large for the average size machine but it has plenty of storage so you can pack things around your machine so it will be safe.",
    "I got this for my wife so she didn't always have to put her purse on the floor or on the table. I'm surprised they don't sell these in stores where expensive hand bags are sold. I would highly recommend it to anyone who has a nice bag that they would like to avoid damaging or getting covered in unknown gunk.",
    "This machine is as close to perfection as you can get for the money. I have another EuroPro which is a piece of absolute crap that I can't even give away, but this one has outsewn everything, even my Heavy Duty machine by WHITE.It does all of the basics you need - such as straight and zig zag stitches and buttonholes. It comes with the essential accessories you need. It is lightweight and compact and doesn't hog space. At the time I got mine, it was available in royal blue, which makes quite the fashion statement.I recommend this to the beginner and the expert. I sew several layers of fleece in the making of teddy bears. It handles thick denim and silk with the same ease.",
    "This chair is cute and the perfect size for kids. I had no problems assembling it. I am a photographer and i use this when photographing kids. It's sturdy and a great size for toddlers and kids.",
    "Seems to be ok, maybe breaks a little easier than ideal, but has more or less worked fine for basic mending.",
    "I needed several plate stands, or easels to display decorative plates I had. Saw these on Amazon and ordered them.They look great, support and show off the plates well and were priced right.If you need attractive plate stands, I would advise you to take a look at these.Priced right and do the job sums it up for me.",
    "The diamond coated sanding drum is exactly what I need, but for a 1/8\" shaft. The one I bought turned out to be for a 1/4\" shaft, but this is exactly what I need. I hope the distributor can special order diamond coated sanding drums for the 1/8\" shank.",
    "I picked this one after hearing how many problems people were having with their Singer Sergers. It comes pre-threaded with different colored string to easily show you how to thread it. There is also a dvd that shows how to do it, but I just followed the threads and was able to thread it on my first try in under 30 minutes. It works really well too. The only thing bad is the little trimming tray is hard to attach and too small. It has yet to yam on me or break thread since I re-threaded it.",
    "Red Heart Super Saver Yarn is a pretty great bargain. Michael's sells it for about $2.99 (I doubt it's much different at other large brand craft stores) and as you can clearly see, you get a lot for a little and there are a good deal of colors to choose from. The yarn itself is 100% acrylic - part of the reason it's so inexpensive. To some, this can be a serious drawback. Many people dislike the somewhat scratchy feel of it, and I can't blame them. It's not the softest yarn in the bunch, but who can be surprised with such a nice price? I would not recommend this yarn to use for sweaters or other clothing items. Unless you're making it for yourself and don't mind the somewhat scratchiness. (Note: a single wash can help ease the scratchiness.) Another thing to note is many people are \"yarn sensitive\" and acrylic can bother the skin. In which case, I'd look for cotton and other natural fiber yarns. But on the flip side, Red Heart Super Saver is perfect for stuffed animals, dolls, and amigurumi of that sort. It's durable, especially when you figure that you won't be throwing your amigurumi in the wash that often. I find it easy to work with, especially because it's a tight yarn and stuffed toys generally benefit from Red Heart's tightness. Unless you're making a stuffed toy for a baby to snuggle with, it's great for children's toys. And, who can forget the price! A few other drawbacks, though minor, I noted are that I tend to find a couple superficial tangles in the skeins that annoy but do not ruin the whole thing. Also, I occasionally pick up a skein that just doesn't work the way I'd like it to. For example, I bought a skein of the skin colored one and found that it just didn't work like the other skins of RHSS did. I guess there are lemons in every product, but still a bit annoying.Overall...PROS:- Excellent price- Large color palette, including some unique multicolored options- Widespread availability- Good for making stuffed toys/amigurumi- Easy to work with for many- Lot of yarn included- Durable sans the washing machineCONS:- Scratchy (though one wash can help soften it up)- Acrylic (only a con for some)- Splices a little easier than other yarns (I repeat, you get what you pay for!!)- Wears after a couple washes- Occasional little tangles in the skein- Some skeins are lemonsOverall, I recommend this yarn for someone who would like to use it for toys, not garments. Blankets and large afghans, I think it would work for that too as long as it wasn't designed to be soft or sensitive on the skin.",
    "I'm not an artist, I just love to colour. I have a lot of different kinds of coloring media and I use Dover, Pomegranate, and Mindware coloring books. I'm not so much concerned with the blending capabilities of these markers as I am with their abilty to lay down smoothly on the paper without leaving streaks and ink pools. For me, these markers have not performed as well as the Sharpie Brush Tip markers when it came to just coloring. I have not used them for artistic projects because as I mentioned before, I'm not an artist, so I can't judge them in that respect, but I do appreciate a good marker. The ink flow is very good, almost too good, sometimes too much ink flows out and you get those dark ink dots on your page. What I have noticed with this set is that the chisel end is large and a little awkward to use, like you don't have as much control over your strokes. Also, the tip of the chisel gets dull/soft easily, so you have a squished point like you get when you press too hard on your marker. The other end of the marker is much better for detail work, but you do get more ink pool dots and streaks. I've posted a page from Mindware Classic Mosaics in my account so you can see how the ink lays down. I probably won't spend the money again to get these markers, I'm much happier with my Sharpies for what I do.",
    "Honestly, this is the best ink you can buy. Even if you chose to 'try it', one bottle will last for several years.",
    "Not only is the product excellent and does exactly what it is supposed to do, but the service was amazing. I received it very quickly. I will definitely be ordering more from this seller. Highly recommend!",
    "My daughter was very excited to receive this for Christmas, until she tried to change the thread that came with the machine. It literally would not work anymore. I tried everything. Maybe it's defective.....but from other reviews I read, I think it's just a really bad attempt at a great idea. Too bad....she is very disappointed....",
    "I had a buttoneer about 15 years ago and it worked great. I searched for and ordered another because that first one had been so handy. The plastic piece that holds the button on is flimsy, they break in half when you try to put the button on. It probably took 5 or 6 times before I got one to work, then it came off the first time I washed the garment. Unless you can find an antique, don't buy it.",
    "This is a excellent paper especially for fine art use, It has been discontinued. (S041447) Epson texured fine art paper, 24x50 roll, however Epson has a direct replacment for it (S042304), however Amazon along with most other suppliers, do not carry or know of the new replament, I tried to speak to a Amazon rep on the phone to advise him of the new replacment but he could not help me, anybody know how to let Amazon know the there is a replacment? Thanks",
    "For the price its a decent gift. They do lead you to believe that its an actual stone when in reality, it is not. Its more like a plaster.",
    "I put my 80 pages of my Disney scrapbooks together the day I got them. I love to have all the same size pages. I was glad to find them and at a resonable price. I received them quickly and packed perfectly.",
    "The drawers fall off the tracks easy, so don't put anything heavy in them, like paper or stamps. They also get very dusty inside them. The knobs come unscrewed from time to time as well. They are good for little things like glitter, embossing powder, or brads and eyelets. Check Costco for a much lower price, but if you don't have a Costco in your area, or they don't have them anymore this price is about good as it gets.",
    "Terrible machine for embroidery. I have replaced most of the moving parts for the embroidery feature and it still won't work right. Do Not Buy This Machine if you are looking for an embroidery machine.",
    "The Printed Treasures printable fabric sheets I bought are so easy to use and excellent quality. The price even went down just as I ordered them, which was a huge bonus!I have always trusted Jo Ann Fabrics to give excellent and quick service, and they certainly did not disappoint at all -- my fabric sheets arrived very quickly. Thanks!",
    "This product is the Bruce Lee to your Chuck Norris. Product is very well built. No loose screws or parts and the product feels ideal for long uses without failure. Punches through 20 pages no problem. As long as you can put your elbow grease into it, you can punch through more than 20. On its arrival, I punched through over 100 pages for a binder with loose paper; works like a charm.I will edit this review if the product breaks. If you don't see an edit, that means I'm still using the product and it hasn't failed yet.",
    "The Steadler stick eraser is the best eraser is the best eraser around. As a textile designer, I always have the need to erase different types of mediums, and I find the Steadler stick mar plastic eraser is the only one that work for me.R LawrenceCT",
    "It is a great portfolio for holding large printsi have my 12x18 prints stored there, they look amazing in this portfolio",
    "all labels are peling off and cups are not very good. But overall its a good cheap set. Nothing that should stop you from buying it.",
    "This is great for creating quick and easy triangles from a long strip of fabric. Can save on fabric by rotating edge on edge.",
    "After a month or so of owning a pair of these, one of the blades broke at the pivot while cutting open some plastic packaging. The dog-chewed-up-the-handle pair that my parents have had for what seems like decades would have had no problem.These are not the scissors I was looking for. Perhaps I got a knock-off pair? I don't know, but I am disappointed.",
    "My 5 year old was so excited to receive this as a gift and loves the different images on the stamps and multi-color inkpad. However, I wish there were a lid on the case to keep the stamps from falling out. It needs to be stored flat, which is not always practical for a child cleaning up art supplies. Otherwise, the stamps are well-made and sturdy.",
    "Loew Cornell make solid brushes. Im using this with oil paint. Do be aware that the picture shown is for size comparison. I mistakenly thought you get a set of brushes. Doesnt demean how great of a brush it is though. Very tiny for fine details.",
    "these paints ordered when i got my air brush setup....the paint goes on smooth and easy...i know some say well its the air brush system doing it....well dont forget if the paint is done wrong it wont work either...so good paint makin and good colors",
    "My Wal*Mart is no longer stocking candle making stuff, so they've put it all on clearance. This is one of the items that they had on clearance, and on a lark, we bought it. Candle making is always something I wanted to get into, but since space and money is tight in my house, this was a kind of last attempt at this particular hobby.Now, I've had this gadget for 24 hours almost, and I've made 3 candles, and I'm working on my first set of votives. This is the most user friendly candle making craft I've ever seen, and I'm infinitely glad I got this gizmo which, truly does, work as easily as the box makes it out to work. Within half an hour of getting this home, I was making candles. All you have to do is some light assembly, plug it in, and follow the instructions. Voila!This really comes with everything you need... A pound of blue wax granules, a pillar candle cast, a stopper, wicks. All you do is pour it in the hopper, turn on the heat, wait 5 minutes, stir the wax, wait another 5 minutes, and pour. About an hour later, you do a second pour to fill in the dip in the middle of the candle, then you let it set overnight. In 12 hours, you have a store-quality candle. It's really quite amazing.I was worried that it'd be impossible to get the candle out of the mold, and I was worried that cleaning the hopper would be a nightmare. Neither proved true. The candles come free of the little mold with a good rap on the countertop (if a good rap doesn't cut it, throw it in the freezer for about 30 minutes and try again... It'll slide right out), and the hopper is easily wiped clean (as long as you do it immediately after you're finished pouring... If you don't wipe it, don't sweat it, it'll still work and it won't gunk up your next candle). The only big problem I've found is, apparently, a problem for most candle makers, is a well sinks around the wick after it cools. This is easily corrected with a second pouring. With practice, you'll turn out perfect candles. :)Some tips for people who're making candles with this gizmo... if you melt too much wax and you still have some left over after your second pouring, use an empty, small, ice cube tray and fill up some of the ice cubes with the extra wax. Use those cubes of wax to make those fancy candles with the different colored squares in them. Also, if you're going to add herbs into the candles, add them directly into the mold, not the hopper. Add fragrance right before you pour. Also, expect you'll have to do re-pours, so save yourself some wax. Threading the wick can be a trick, so tie the end of the wick with dental floss and use that to pull the wick through the hole. I found it was much easier to secure the wick to the metal pick over the top of the candle, then plug the hole as opposed to plugging the hole then tying the pick (don't worry, when you get it, you'll know what I'm talking about).Anyway, if you like candlemaking, you NEED this !",
    "I had no idea these rotary cutters and self-healing mats existed until I joined a quilting group. This kit even comes with a ruler! I used the Fiskars rotary cutter in class and liked how easy it was to work, so I ordered it. My daughter and I have already used the kit to make two tie blankets.",
    "I ordered the Brother LS2125i Easy-To-Use Lightweight Basic 10-Stitch Sewing Machine on April 4, 2011 from Amazon and could hardly believe it when it was delivered only 2 days later on April 6, 2011. I am a widower and have only used it one time but it worked great. I loaded the Bobbin and it was very easy to do. The only problem I had was threading the needle due to my poor eyesight. I couldn't believe all the features on it. As a male I will not use the vast majority of them but they are there should I ever want to. I think it is a great Sewing Machine for a Beginner like meself. Operators's Manual is printed in easy-to-understand English with pictures showing you how to do everything. I recommend it very highly.",
    "Only one 1/8 x 1/8 strip comes in the box. even though the description seems to indicate otherwise. You can purchase a single strip of balsa wood in any hobby shop for less than .50CDO NOT BUY THIS ITEM!",
    "Couldn't be happier with the pens, just what I expected. Fantastic! I am filling a book with a lot of Zentangles.",
    "This was a big big hit with my 6 year old grandson. He was thrilled to get it as a gift and has enjoyed using it from the start.",
    "As the previous reviewer has stated this isn't the easiest yarn to work with. This is a textured yarn & thus should be treated as such when purchasing. It would work great for loom knitting, or other craft projects but as a crocheter or needle knitter I would only recommend if you are experienced.It has a thick texture feel with a lot of lumps & bumps. That aside, if you enjoy creating unique projects using mixed textures & yarns as I do this is a great option. It is not as soft or thin as other boucles I have used. It has a much thicker texture which creates a very unique project. It is perfect for Fashion items such Hats, Scarfs, Purses, Backpacks etc. I have not found another yarn with this unique chunky texture (except other bernat brand boucle) so I often order it for projects...HOWEVER it seems quite pricey on here. Buying it at other craft stores even online it is about 1/3 cheaper elsewhere.(currently $8.69 on Amazon & $5.99 elsewhere)",
    "I had package wrapped and it was torn the bag was to small for the box and now i have to wrap it that was $10 down the drain",
    "I ordered this product because i wanted wooden crochet hooks but didnt want to spend a lot of money. i received the product with all the hooks stated.I have used them already to do learn granny squares and i love it, they are light and easy on the hands. Most of the the time with the metal hooks i get cramped hands, but with these i did not.definitly worth the money spent a good value..",
    "This product is sold as 2 kits - Maxi & the Mini kit for $25. Sounds like a good deal doesn't it ? I thought so too - however, you only receive the Maxi kit andAmazon writes: I'm sorry about the problem you had with your \"Sheaffer(R) Calligraphy Kit, Set Of 7\". I've checked your order and see it was placed with \"Marketfair Stationery\", a third-party seller on our website. Because Marketfair Stationery 's inventory is constantly changing, we can't replace items sold by them that are Fulfilled by Amazon.And to resolve the problem Amazon offers: Otherwise, if you're interested in keeping the \"Sheaffer(R) Calligraphy Kit, Set Of 7\", I'd like to offer you a refund of $5.00, which is 20% off the price. To accept this refund, just click the link below to let us know and we'll issue the refund to your Credit Card.And I respond: Let me see if I understand you - the maxi kit is selling for $18.52 and you want me to pay $20 ?I won't be ordering from Amazon without asking some questions first !",
    "The knifes cut great and you have plenty to choice from. I can't say that I was disappointed with the box because it does what its supposed to which is hold blades/knives and I don't plan on having it displayed in a museum.Again, wondering selection of blades and a good looking box to hold them in which is why I went with this set.",
    "30X is plenty to see most small items. I use this to read the GIA laser mark on my wife's engagement ring diamond after its been cleaned or adjusted to make sure it wasn't swapped out on us.",
    "love it, just as described in my online research (more words required so this is nothing just taking up space).",
    "Originally, I had to return it because the 75-pen/pencil caddy was torn 5\" along a seam. The Amazon customer service person was great, & even though I had to return the whole item (no cost to me), I received the replacement in time for my crop.Regarding the pen caddy, it has its own pocket in the tote, & it can be reverse folded to stand on the crop table - very handy for pen viewing & access.I don't use the interior compartments. I remove them to make room for my items, which are already self-contained & too tall for my other totes.The height of the tote is especially important to me. Other totes are too short to carry some of my containers, etc. Plus, it makes a great stand for paper, etc. when your table area is limited.The front outer compartment has plenty of room for cutting mats, scoring board, etc., plus clear, Velcro pockets to hold smaller items. Then the side pockets are also user friendly.The telescoping handle is very helpful, which is even more important when a tote like this can get very heavy when loaded.If I knew that this tote would last for more than just a couple of years, I'd rate it 5 stars, but it's still new & too soon to tell.",
    "I highly recommend this sampler especially if you are new to machine embroidery. A wide range of colors to work with most projects.",
    "This stuff works. Just clean the parts and squeze some out and use a tool to position it where you want it and hit it with a small flame or an iron and it flows nice and makes a tough joint.",
    "The finish of all the products inside are rather poor. One of my majorly regrettable purchases here in Amazon. I wouldn't recommend this even if you have been painting the same thing for the last twenty years.",
    "I am a new self taught knitter. This book has been a wonderful knitting experience for me. I learned how to knit on double pointed needles with this book. All the patterns are very clear and easy for a new knitter. I have knitted half the hats in this book so far. The hats are so cute everybody wants one. Susan B Anderson has a blog: [...] and there is also a group on Ravelry [...] called Itty-Bitty Knits. On both of these sites you can contact Susan with any questions. She also has tutorials on her blog. She is sweet, talented and very friendly. If I could only recommend one book on knitting this would be the one.Happy knitting!Womanwithstixs",
    "This is without a doubt the best book for ornithologists and lay persons interested in birds. The illustrations are nonpareil and the accompanying text is a treasure trove of information. This book is the definitive books about birds to date. It is outstanding.Sibley speaks to his readers' collective intelligence; his work provides comprehensive material in a very interesting format. He is a master communicator; his readers will readily absorb the information he wishes to impart in this work and will certainly appreciate the illustrations.Sibley has indeed set new standards, soared across new frontiers in this presentation. This is a book that will not only be studied and remembered, but cherished and treasured.",
    "First, I bought this because it was described as having a drop in bobbin. It is not. The bobbim jambs unless you hold the threads as you start each seam. I have never had to do that with any of my other sewing machines. I sew a lot of heavy fabric and bought this machine for that reason, but save your money and get a better machine. The reverse button fell off after a weeks use. I was able to put it back on but that just shows the quality.As for the free patterns...I was suprised at how fast they arrived. Less than a week after I sent my order in.",
    "This is one of the first fabric landscape books I have purchased. It was clearly written, has beautiful photographs, and was a true inspiration for me. I have learned a lot from this book, and created several projects based on the ideas in the books.The book is well organized, and I have returned to it a number of times for some additional inspiration and ideas after the initial reading. This is always a sign that the book is very good!Chapter 1. Getting started. This chapter talks about general techniques such as useful tools, adding borders, cutting, glueing, design walls, etc.Chapter 2. Creating your own landscape quilt. This chapter has step by step instructions of creating the book cover quilt \"Black eyed susan\" and two others. The basic techniques in these chapters are a great foundation on doing your own designs.Chapter 3. Adding Garden accessories. This chapter talks about adding other elements to your art work, such as picket fences.Chapter 4. Cutting free-form shapes. This chapter concentrates on cutting and design, includes a number of beautiful examples.Chapter 5. Creating woodland scenes. This chapter covers doing tree landscapes. Trully beautiful, one of my favorite chapters for inspiration.Chapter 6. Creating Water, Sky, Mountains, and Snow. The title of the chapter is very descriptive, it teaches techniques, gives ideas, and has many examples.Chapter 7. Finishing touches. This chapter talks about embellishments, such as machine embroidery, ribbon embroidery, three dimensional appliqu&eacute;, and so forth.I highly recommend this book. It teaches and it inspires.",
    "Strong, sharp and nice to handle. Too bad the Oxo people didn't take a cue from gardening shears & make these so that you can open and lock them with one hand. Having to use two hands to open and close these scissors is a real annoyance.",
    "I have been sewing for overfourty years ,and so I am aquainted with sewing machines starting with my grandmother's treadle White to my current Viking.My Viking had to go for its yearly tension repair so I was left ( not very happily , I might add) in the middle of a project that required a lot of straight and zigzag stitching ..... I decided to buy a good BACKUP machine.I read the reviews and checked the Consumer Report (March 2009) and found the Brother XL2600I. I decided that if the reviews were correct then this was exactly what I was looking for....and it was and is. This is a great little basic machine. The stitches are uniform, the tension is amazingly perfect , and the instructional manuel is EASY to understand . This machine allows the project to be the focus of the sewing experince.The price is exceptioanl for the quality of the product.Good buy.",
    "You get what you get. You know the brand and it is good. I will use it in class as well as my kiddos.",
    "With these new oines you just have the clear plastics so all you can see is the color of the button. Much nicer than the originals.",
    "Exactly what was needed to mend jacket sleeves. Arrive promptly and am satisfied. Now I can repair the sleeves on my jacket.",
    "I had a Singer machine that was over 40 years old. I decided that a new one was in order.This is just what I needed. It works fine and has great options that work for me.The instruction booklet is very easy to understand.If you need more than just a basic machine, this is one that you should consider purchasing.The price was similar to other sites and I got it from Amazon because I have never had a problem with anything that I have purchased in the past.You just can't go wrong with the machine and purchasing it from Amazon.",
    "This perforator does exactly what it was purchased for, but since it is so small, it feels kind of awkward in my hand. I bought this tool becuase I needed it to accurately make a straight perforated line. Since the blade is so small, I cannot have it rest against my guide ruler. I am able to get it to work, but it is not perfect. But, for the price, I cannot really complain. I have not yet located another hand help perforator tool.",
    "I bought this mat so that I do more with my scrapbooking and it sure is great!! It really is self-healing. I've used it several times and it still looks like new! Thank you!",
    "Tyr blendy pens seemed good, but after a WEEK of using them they were all dryed out!! It's not worth it!",
    "Brother Deluxe Electronic Sewing Machine - CS6000iI have really enjoyed using this machine. Easy to get started with clear directions and illustrations. It is very light weight, I easily can lift with one hand to take to my quilting class. I includes many extras like a case, flat surface attachment and several feet for which most machines charge extra. I like the needle threader,it runs smooth and the stitches are easy to change with the chart on the machine front.",
    "The roll of canvas arrived in the factory box/packaging which was fully in tact and not damaged in any visible way. The roll inside once opened and started to be fed into the plotter had two tears in the middle of the canvas sheet about 1\" long each and about 2 feet into the roll. The only explanation I can come up with is that it was put into the box this way as the box appears to be in perfect shape, the plastic wrap on the roll was not damaged in any visible way. To lose 2+ feet off a 20 foot roll is quite a bit of lost material/money. That's why I only gave it 4 stars. I've had glossy paper arrive with tape on the gloss surface which also damaged the first foot or so.Other than that initial flaw, the canvas works perfectly for inkjet plotting of photos so far in an HP Z6100.",
    "As a buyer I always look for quaility. I have purchased from this seller many times and I have always been pleased with the items I buy. As a designer of jewelry I have to make sure that the items I use are real and not marred in any way. This particular fan always makes a lovely necklace,especially when I add some rose quartz beads. The delivery time is amazing as I never have had to wait for long before my order gets here. I highly recommend this seller and the items for sale,",
    "I always us Epson paper for my Epson printer, This paper has a much better price and is the same quality.",
    "I purchased this for my husband to use in labeling and attaching numerous extra keys that we have in our home.",
    "I really like this set of colored pencils. I use them to color mandalas for relaxation. The pencils reached me in good condition and I haven't had any problem with broken pencils. I've only ever used Crayola colored pencils before, so by comparison, these pencils are very rich and smooth. The colors go on very vibrant.",
    "Within hours of sewing on my new Singer CE-100 Futura Sewing and Embroidery Machine my entire project was ruined. I was sewing with satin and a basic straight stitch when suddenly the bobbin housing popped out of the machine with such violent force that it broke the needle and jammed the satin so tightly into the machine that it had to be cut out of the machine. At first I thought it was because perhaps the bobbin was not loaded or because the tension was off and chalked it up to my excitement to rush into a new project on my hour old machine, however, after closer examination, two more needles, a yard of $95.00 satin and a half of a spool of thread, I learned that the housing which is made of flimsy plastic was split at the screw. The thread was getting caught in the split thus causing me to scrap my entire project, not to mention the time spent and emotional attatchment to my project... and now I am the disappointed owner of a useless machine. What a complete waste of time and expensive lesson this has been!",
    "The Brother XL2600I is a great machine. I have yet to put it to extreme testing but have sewed on it and love the way is works, the easy threading or the machine and the bobbin. The many stitches are great. The only concern I have are the directions. They are poorly put together and read horribly.",
    "I love my Light tracer! It produces nice bright light without being blinding to look at. The surface of the box does not get hot, so you can work with it for a long time.I use it to transfer my drawings onto fabric for quilting and embroidery, and it works beautifully.10\" by 12\" size does not limit me to that size artwork. It is easy to transfer larger drawing by doing them in pieces. I just shift both the drawing and the fabric, since it is so easy to see through fabric and drawing to re-align them once you move to the next section.The light box is light and stores away neatly. The cardboard case that it came in is sturdy and has a handle. The box is easy to store it away and take it out when you need it.",
    "I have been sewing since Jr. High and always used either a Singer or whatever they used in school. I'm 62 now and I'm tired of breaking needles, machines that are too hard to thread and dialing for tension and stitch length. It was always a guessing game. After totally destroying the whole needle assembly on my old Singer I got frustrated enough to make a snap decision to get a Brother-on line-sight unseen. I must say I was nervous about my decision. The machine arrived next day. Straight out of the box I assembled two lap blankets for my grandchildren. I look forward to using the many many other fun computerized options that my new machine offers.",
    "Great serger for a great price. Just like what most of the reviews on this machine,,, wonderful.I was very cautious, because of all the threading combinations. But, Brother did something that was so useful in having the machine prethreaded and ready to go. It took all the scariness away. The videos were very helpful, The book was also helpful.I was up and running in minutes. I have had the machine for three weeks now. I completely rethreaded several times with different colored threads, no problems.Just serging away... having fun.",
    "While I have no doubt that this gadget also works well for punching holes in leather belts, I used it to punch an extra hole in my shoe buckle strap. Worked perfectly. It also works well for punching holes in anything less sturdy than leather. Works equally well for cloth and some thin plastic. I'm pleased.",
    "I love being able to do different craft items with my kids and when I saw this product, it seemed like it had interesting potential. I had used printable iron-on transfers before, and while they were fine for limited use, they just did not have the look I would want for some item, like a tote bag or apron.This package is 5 sheets of printable cotton backed with heat seal fabric. The packaging says that you can sew this on also, but since I used the whole sheet at once, I didn't see that happening. I decided to try the transfer on a canvas tote bag. I made my photo full-sized, did a draft quality test print on paper, and decided that it looked good. I then printed the picture onto the transfer at a higher quality set at normal paper setting. When it came off of the printer, I was surprised at how nice my picture printed. It had the look of a canvas painting, giving it a little bit of softness and texture without sacrificing the sharpness of the photo. I was very happy. I let the page sit overnight because the directions were not clear about how long the drying time should be, though it did not appear that it would smudge, even fresh from the printer. When I was ready to apply the transfer, I trimmed the little bit of the edge that was not printed on with a scrapbooking trimmer, though scissors would work fine. I then cropped the corners to round them. No problems, it handled just like heavy paper. Finally, I laid the tote bag on my ironing board, centered the transfer on the bag, and ironed it (no steam, cotton setting) for a minute or so, though it only calls for five seconds. The adhesive set nicely with no glue leaking out of the sides and no lumpiness. The edges adhered well, with no lifting. My kids were amazed that I'd made, not bought, the bag. We are very pleased with the results.I could picture using this on other items like a canvas apron, a canvas storage cube, or the insert says album covers, pillows, quilts, etc. I would not be afraid to try this on a more meaningful project now that I saw how nice the results are and have a feel for the process. The directions say these are washable (you must wait 24 hours though) but you should apply to the surface before the surface has been washed. They recommend hand washing separately in cold water, no chlorine bleach, and lay flat to dry.I would recommend this for a fun project with very nice results. I got quality results with ease of use. I was very pleased and impressed even though I frequently do projects like this.",
    "I bought these scissors over 15 years ago at a craft store and remember being annoyed at paying $20 for them! They have paid for themselves over and over again though the years. I am only replacing them now as they have become dull and sticky after years of rough wear and tear. The handle is very confortable. I have had good experiences with Mundial knives and scissors.",
    "After reading all the accolades, I don't need to pile on any more. This is truly a new standard in guide to birds. Do note that it is not small and it is not that light either, so it might not be a good field guide to carry around all day in the woods.",
    "I use these scissors at work. You can cut tape or labels and the blades never get sticky. You get a straight even cut every time. I wrote my name on them so that they will always come back to my desk.",
    "It did not work for my 11 year old son. It was the same as right handed scissors. He could not see where he was cutting and became very frustrated. Glad it worked for others. Not for us.",
    "Ink writes and flows great in my Lamy Safari. Actually made a nice difference in the way the pen writes. Its pitch freaking black and I know that one day the unused portions of this bottle will be poured over something I hold dear. Most likely by a small child or other irresponsible party. It also seems to be as bullet proof/eternal as advertised. I haven't extensively tested it but I have had writing come into contact with water. Writing with my Lamy cartridge ink would disappear in a puddle of cloudy blue water. The Noodler's ink holds fast to the paper with minimal smearing. I have read that as time goes on it makes an even more permanent bond with cellulose.",
    "The description for this product clearly states \"two 54 inch panels\". This is not what was shipped. The package has two 27-inch panels for a total window coverage of 54-inches. I will now have to order a second set to provide the necessary coverage, making these a more expensive option and a bigger hassle!",
    "Bought to make banners for my sons youth football team to break through at the beginning of their games. Good quality.",
    "This organizer can be used in 3 different ways, and all give you both vertical and horizontal space. Exactly what I wanted.",
    "After having joint replacement in both thumbs due to osteoarthritis, using a \"regular\" rotary cutter wasn't easy and I wanted to protect my hand joints! This ergonomic cutter works well and is much easier on the thumbs and wrist, but the little spring which closes the cover automatically didn't last long. It's a tiny wire and it just popped off. I can't figure out how to get it back on, so was disappointed in that mechanism, but am pleased overall with this cutter. It still works without the spring but the blade isn't covered - the little cover just swings now.Purchasing through Amazon was great - good prices and I got it quickly.",
    "I am going to disagree with Jasmine not being good for small letters. I love to use it for small letters. It cuts the perfect size for fitting on to tags used in layouts. I originally bought it to use on Christmas layouts because of the elegant look it had. I use it a lot in other layouts because the small letters are versatile.",
    "I have not started my scarf yet, but the yarn is alot thinner than pictured. I'm sure the scarf will not be very heavy. The color is pretty. I planned to make scarves for the family to wear with their coats, but they will probably be more for wearing inside with a sweater or blouse.",
    "These are beautiful wood blocks and we have fun with their shapes and differnt sizes. This is a great toy.",
    "Looked like a great idea but the magnet is too weak to support anything heavier than a piece of paper.",
    "These act as a filler for our Lortone rock tumbler. It helps prevent chipping of the rocks. We don't reuse the beads so think of this as a disposable part of your rock tumbler. Whenever its time to go to the next finer grit then we use new beads because you can't clean the grit out of the beads. It might be possible to reuse these but then you have to separate them and keep track of the fineness of the grit you used along with each step in order to not scratch your rocks. We fill the rock tumbler halfway with the beads, water and rocks.",
    "This is one of those items that really is too good to be true. I've read reviews of people saying that it doesn't work because the stitching just pulls out and because it doesn't have a second bobbin underneath, but that actually isn't true. If you pull the tailend thread through the fabric, you can tie it off and it'll hold the stitching. And the thread actually loops onto a hook underneath, where you would expect a second bobbin to be, and that's how it makes stitches.The REAL issue with this is that the thread often slips off the the hook in the middle of sewing and you have a bunch of loose stitches. When it doesn't slip, it's great! Too bad it doesn't ever NOT slip. I managed to sew one seam of a dress I was making, the first seam, and after that it wouldn't sew without dropping stitches. Luckily I got this as a gift, and it has inspired me to start sewing, but now I need to get my hands on a actual machine that ACTUALLY sews. Don't waste your $10 + shipping on this!! Put it towards a real machine.",
    "Not a six pack...well apparently it's a gambler's pack...you MIGHT get six, you'll probably get one. I got only one and now have to deal with packing this back up and returning it for a refund. DO NOT WASTE YOUR TIME.",
    "I use this paper to print my fine art paintings. It's beautiful. Iuse an epson printer with pigment inks. Love this paper.",
    "The hole puncher has a solid feel to it, and seems to be well constructed (I will update this review later if it turns out this is not the case). I have punched up to 10-12 pages in it with no problems. The holes are even and fit in a binder. This is what I was looking for.I did try to find a hole puncher made in the USA, but couldn't (I like when people state that it is made in USA in their reviews). This one is not - made in China.",
    "Durable and good looking. Colors are very cute for girls. Very happy with purchase. I put pads on the bottom of the tables and chairs to protect our wood floors.",
    "This set is perfect for pre-polishing platinum jewelry. I have been personally using one for more than 5 years. This product is available from many of the jewelry supply houses for less money, and replacements are individually sold as well.",
    "Bought this for my office and I must say it is ROCK SOLID and delivers flawless punches time after time. It's now about a year old and still performing as if it were new. So often these types of products are flimsy at best, but this one is not. It will not disappoint.",
    "Wow,this is it , same knife I bought twenty some odd years ago. Left my woodsman in a tree out fishing with the children. Bought a camper and another woodsman.why change paddles in mid stream this is a good choice if you buy and you are buying your first this is it .",
    "I purchased this as a Christmas gift for the kids. Within an hour of this being played with, the cheap plastic material this is made with had a hole in it and one of the handles was beginning to tear off. This is probably best for a baby to roll around or sit and play on. Amazon promptly had UPS pick this up and we were refunded very quickly. I was surprised at how little this weighed, now I know why. I love Amazon, just not cheaply made tumbling mats.",
    "I bought this so that I could keep some of my child's oversized art-work... the gems they bring home from pre-school and some of the pictures she makes on her easel at home. It's working perfectly and I'm very happy with my purchase.",
    "I am new to hand-quilting, so I did not know what size to expect these needles to be. They looked super small which made me skeptical, but are so easy to thread, and glide in and out of layers of fabric so beautifully, that I am in love with them.",
    "Soft blended color, just a little harder than pastel pencils. I'm mixing them. Excellent for detail work. Takes well even on black paper. Wish they had a little more color variety. Should have gotten the larger set.",
    "Still having problems getting the upper tension correct. Still too tight. Keep re-threading the machine but haven't found the problem yet.",
    "This, so far, is a great little place for my 32 month old daughter to play. The dry erase and magnetic side is so much fun for sticking magnet ABC. And writing them with the marker as well.we love this little thing. i initially wanted something bigger, but could not find the white board/magnet combo in anything else that satisfied me. I would still prefer for this to be a little bigger. And its pretty light weight. Good cuz my daughter can move it to another area to play, but bad cuz it has to be against something to prevent it from sliding around while she plays.",
    "The perfect product for those of us with larger necks. I can now make my too-tight necklaces fit how I want them, choosing which extender to use.Very prompt service, nice packaging, quality product. I would buy this again.",
    "received in about a week from amazon. then there's a form to send into wall lenk to get the customized head. that's supposed to take up to two weeks. called 'em after two weeks; machines are down and will be fixed in a few more days. i am coming up on the fourth week after sending the form to wall lenk. just called and will be receiving the custom head after 4 weeks of sending in the form. i have two projects that have been sitting and waiting to get branded. for saving a few bucks... you make the call. approximately 5 weeks lead time after ordering from amazon. once i finally get it, i am assuming it will work properly.",
    "I purchased these shears because of their brand name. I'm totally sold on Fiskars products because of their balance of quality / price. I haven't used these shears, yet, but I tried them out on a scrap textured denim - they cut thru it almost like butter with a nice, clean cut. I have arthritic hands, so ease of use is extremely important to me, and I'll have no problem using these.",
    "A lot of really great ideas for different journals and different reasons for journals. Made me want to do more of these. Great directions and clear pictures",
    "This is much lighter than I expected-- although it is exactly as advertised. It will probably be on the floor more often than not. It is just that I am used to the heaver mag. pin cushions.",
    "I am very happy with this Brothers XL26001 sewing machine it works great and is very affordable I have made many friends happy by sewing up the hems on their clothes and probably made new customers for Amazon for the fast service they have given me Keep up the good workA very happy customerRobert",
    "I was excited as was the staff in my office. We do so much hole punching that we thought an electric hole punch would releive us of constant manual labor. I figured for the price we would have no problems. But I was amazed to find out that it can't punch through papers if they have staples. Almost all of the papers we file have staples so the machine is pretty much usseless to us. Also, it doesn't even come close to puching what it states is the max number of papers. Plan on half. Also. Paper chips don't all make it in the recepticle. If you pick it up you'll have little bits of paper everywhere. It was disappointing to say the least. Back to the manual hole punch.",
    "Age 10 -- he likes to try to do origami out of a book also purchased on AmazonHe liked the gift",
    "I haven't enough time for complete review yet. But so far I like it!Very good price. It's working pretty quite. Easy to operate.Thanks.",
    "This case truly does make beading a breeze.... keeps beads from spilling into each other even when traveling... Very cool cases I highly approve!",
    "WELL THESE STICKERS ARE AWSOME...THE 3D-EFFECT IS STUNNDING NO DOUBT,THEY ALSO MAKE A GREAT CARD IF YOU WANT THAT SPECIAL HOMADETOUCH.I KNOW WHAT EVER YOU USE THIS SET FOR YOU WON'T BE LET DOWN .THIS SET IS SPEICAL FOR ANY GIRL AGES 9-TO-92 ALL WILL BE DELIGHTED.INENDDING IF YOU WANT TO ADD THAT EXTRA PRINCESS TOUCH TO ANY AND ALL THIS SET IS FOR YOU",
    "Just what it should be, no surprises, sturdy and easy to use. Good value for the cost.",
    "This product arrived promptly, was well packaged, and none of the colors were dry. This is a good set to have on hand for large projects. The colors easily mix and water can be added to change the coverage.",
    "This serger is fabulous. Its easy to use and does most thinks you would need a serger for. The instructions are great and it comes with a CD-rom video that helps you understand the fuctions of the machine. It comes all set up and ready to use. I got a great deal on this machine from Amazon but it would have been a value even if it cost a little more. I tried a White (that actually costs more) and it was aweful. It vibrated off the table almost. And the set up and threading was hard to understand (especially since it didnt come with any instructions). The Brother runs smooth even at high speed sewing and I rarely have any troubles (like thread breakage, etc). Did I mention this is the first time I used a serger? If every first time user bought a Brother, I am sure more people would use sergers.",
    "\"Well what can I say except...excellent!!!! A word of warning my friends, it gets really really hot!! When you glue something you need to be very cautious because the first time I used it I burned myself. All in all it is a great product:)\"",
    "No exception with this. Good paper and pretty colors.",
    "I have been sewing since I was a child. I LOVE this machine!! It is the best I have ever used. I have had no problems whatsoever with it, and now even look forward to hemming and small fixit's. I use to avoid delicate or heavy fabrics with my other machines because the tension would always muck up. I've nad no trouble adjusting the tention (when needed) and the machine sews beautifully!! This is also a very quiet machine!! The needle threader is wonderful. Very easy to see and use stitch adjustment nobs and the included video is very helpful if you need more instruction than what is in the manual. However, Singer I suggest an instruction DVD for easier menu search. All in all, highly recommended. Totally don't get the negative reviews.",
    "This machine was exactly what I was looking for, dependable but light enough to move around to various locations like the kitchen table or travel.",
    "I am a pretty crafty person at times and these scissors help me craft my little heart out without my hand getting tired. I am also left handed and these scissors are good for either handed person (hallelujah!). The blade is a good length, it operates smoothly, the scissors are spring loaded for an easy open and have a lock for when you want them to stay closed.These earned all 5 stars!",
    "This was a fun project. I now have a beautiful memorial of my beloved dog.Be patient and allow the cement to set up before doing paw prints-if too soft will not work. Plenty of time to do the art work.",
    "This easel is very sturdy and well made. The finish on it is very nice and the hinges work well.",
    "Tweezers are always difficult to find when you really need them. So I purchased this set to have some extras around. The price was great, but the quality of these tweezers are 2nd rate. Tweezers should be 100% rust-proof stainless steel. These are NOT. Though some of them are, there are a couple that are made from an alloy that is not rust-proof. One set began showing rust the first week after I received them. They are a jeweler's set, but they can't be used in sterile situations such as removing splinters and such. I was expecting tweezers that could be used for a variety of purposes. If that is what you are looking for, perhaps you should look at other sets and maybe spend more and guarantee you will receive 100% sterile Stainless-Steel tweezers.",
    "I used these velcro rounds to help me make my halloween costume. These were the brand that were suggested from the etsy store that I purchased some of my costume from and I agree with her recommendation as they were very durable and useful.",
    "This hole punch is solid and is working well so far. I've used it to cut a couple hundred pages. No troubles. The slider for the page length is pretty stable. I've got no complaints, and the price was good.",
    "I love this DVD! The only reason I'm not giving it five stars is because I'm having trouble with the volume. The sound is very weak, but the video is 1st rate. The production values are high and the content is great. The beautiful projects are fully described as Tim demonstrates each step and provides a complete list of supplies needed for each. The menu is easy to navigate and very user friendly. If you enjoy Tim Holtz, you will love this video. It is well worth the price.",
    "i ordered for a christmas present and i have a big work schedcule so i dont have much time for shopping. i received the plastic and the charge for this but no the product. so it has put me in a big bind. i have no present for my dad and they didnt offer to maybe upgrade the scissors just to give me my money and tell me they were out of stock!",
    "These rings are great, I wanted a whole bunch of them for various jobs around the house.. they are strong enough for any key ring job..",
    "Simple, yet effective tools and quality snap materials that allowed me to quickly replace broken snaps on my boat's camper top canvas. It is an essential in any boater's onboard tool kit.",
    "I had one of these sets a while back and lost it, very pleased to get the same set it covers all my crafting needs",
    "I purchased these patches to cover up a hole in my favorite jeans. I followed the instructions in the package, ironed on the patch, and made sure that the seal was firm. However, a week later, the patch fell off, just from normal wear. The jeans haven't even been washed. I will try again since there were multiple patches included but that was a pretty poor start.",
    "I've owned this machine for 6 years until it gave me a problem. I am a novice sewer, mostly using the machine for small, simple projects. It may not be the strongest, but I faulted myself when jamming it from fabrics that were too thick. One day the bobbin winder function stopped working. I took it in to get serviced; the sewing store folks basically told me the machine is fairly cheap, \"doesn't have a frame.\" All the mechanics of the machine is attached to plastic, and the bobbin winder's plastic was melted and sticky. I'm not an expert on machines and sewing, but I suppose this machine is good for beginners, but it doesn't last.",
    "beautiful paper, every sheet is different, but the sheets are not 6\" x 6\" so didn't turn out really great for the purpose for which I purchased it.",
    "Second calligraphy brush rest order. Same as before. Outstanding service - delivered ahead of schedule, arrived in perfect condition.",
    "My 6 year old got this for Christmas 6 months ago. I still can't figure out how to make it work right. I am a professional seamstress and I can't work this crappy little plastic thing. How is a child supposed to? I wish we could return it, but the relative who purchased it didn't keep a receipt. I think I'm going to go buy her a real mini machine.",
    "This is the 10 one I have had and the only sewing machine I would buy. the Brother holds up better than anything I have ever tryed. you will love it .",
    "I just love my new machine....no foot pedal and an easy threader and start-stop feature with a great up-down feature to the needle. Front clear bobbin case is a dream for me so I don't run out ...and easy to load...again JUST LOVE IT !!!!!!",
    "My art teacher says that Prismacolor are the best colored pencils for professional work. They allow you to build up and blend the colors, saturating the paper until you get an almost paint-like fullness, without the typical white space between the pencil lines.My teacher let me use her set for a picture, and I was very pleased with the way the shadows on my stone wall turned out, and the wood textures. Finally, I decided that I wanted my own set.She also says she prefers the sets in tins, because the pencils are easier to lift out. In the boxes with trays, as the pencils get shorter, they like to hide down in the bottom of the trays where it's hard to see if they're there or not.On the whole, worth the investment if you want top-quality results, with beautiful blending and a full range of useful hues. (Believe it or not, you'll come to appreciate all the cool grays, warm grays, and French grays. They're what you'll use to dull or intensify the other colors.)",
    "It is hard to tell by the picture what it really looks like. When we put the sewing machince it there was lots of room which made the machine not very stable. We bought it because we also bought a Brothers Sewing Machine.",
    "I needed this because was making a blanket and stores decided to discontinue selling the color. was fast and matched exactly what i was using before so was able to finish blanket",
    "I've had my machine for less than a month, so do not yet have extensive experience with it. However, I have found it to be super-easy to use and I like it a lot so far. For the price, it certainly seems to be a good machine. A couple small criticisms: the light could definitely be brighter--and unless I leave a lot of thread through the needle, it tends to come unthreaded.",
    "I have had a number of kitchen shears lately. I ran across the reviews and saw that this item got a good score. I thought it might be too small but ordered it anyway. Right off the bat it was obvious the Fiskars worked better than any I had. It consists of two pieces of steel with handles that can be completely separated for instant cleaning. It must be the careful design that makes them far superior to others I have used.",
    "These came in very handy when putting up crown moulding. Using them to determine the correct angles and to setup the moulding on the saw saved me many incorrect cuts.",
    "Very happy! Did the job, worked great for my project, price for the 25-pack was perfect. Very happy! THANK YOU",
    "I recently bought this item and am a little disappointed with it. I've used it only once and already one blade is broken and I haven't had time to enjoy using it.Can anyone tell me where i can get replacement blades please. I think I might need to buy a few.",
    "This is a really helpful tool to remove the designs you create with the cricut from the mat. I bought the cricut and this tool has made my life easier.",
    "I have been sewing most of my 56 years - started out standing at my mother's treadle machine before I ever started to school. I have had plenty of experience with both sewing and serging machines. I have been a loyal Singer user because I was always satisfied with the ease of use, and the value for the dollar...until I met this serger. I purchased it online through Amazon. I spend many more hours threading and rethreading this machine than I do sewing with it. Even tying on a new color of thread and pulling it through does not work with this machine. Every color change of thread, I spend at least an hour trying to get all the spools to work together. The thread breaks constantly, and I cannot count the number of broken or bent needles I have had sewing nothing heavier than cotton quilting squares. I kept thinking I had to be doing something wrong, but according to the manual and DVD the machine was set up correctly. Do not depend on the manual or DVD to explain how to set the tensions though - nowhere does it tell you the difference in the needle tension controls and the differential feed tension. That is all guess work.After dealing with this nightmare for a year now...I am ready to simply throw it in the trash and find a better serger. Singer lost a long time customer with this piece of junk. I could not even attempt to regain any of my costs by selling it somewhere like eBay because my conscious would not allow me to pass this machine along to another innocent user.Steer clear of this serger, it is not worth the price no matter how good the value seems.Singer 14SH6540 Differential Feed Serger Sewing Machine",
    "I used it, it worked just fine. Learning to thread it might be intimidating at first, but if you comit on \"sitting on it\" it can happen and it is a lot simpler that you would think!I had an issue, though, a slight imperfection, for what Amazon immeditely agreed on replacing it. The lower looper thread kept breaking, and as I know I was doing the threading the right way, I asked for a solution. They offered the replacement, just to make sure I am a happy customer.",
    "I'm not about to bash a box of crayons because I'm not happy with the packaging. \"New look\" upgrades are just that, and you're supposed to be paying for the product inside.I give it 4 stars because ONE crayon was damaged. I thought the tip of it was chopped off, but it wasn't. Instead that individual crayon seemed to have gotten in the sharpener backwards, so the tip was at the bottom, nevertheless the superior end was chopped off. Small potatoes, I got what I was hoping for. Which is, the best quality crayons money can buy. I'm quite happy with my purchase.",
    "I wanted to create calendars for our family. I found this a good deal for the printer (I have Lexmark Z54) and for the requirement. I had taken 5 calendars out of this and it works good for the double-side calendar. I could get an excellent finish. Color rendering is perfect and I did not find any smudging or bloating. The thickness is fine enough for a double-sided output.I also found Matte finish better than Glossy in case of inkjet printers, especially this one, the best.I would definitely recommend this product.",
    "The case is pink - not blue as shown. This was a gift for a guy. I'm still gonna use instead of going through the aggravation of a return.",
    "Can someone please tell me how to get the \"Rub a Dub Tub Crayons\" out of my grout??? I let my kids use these during bath for the 1st time today.The scrub duck that comes in pkg cleans the tiles fine, but not the grout! Please help!! My white grout appears ruined by these \"tub crayons\". Suggestions appreciated. Thanks!!",
    "I admit one can't really review a simple product like a scissors. I got this Fiskars for our toddler who likes to play-and-cut paper. It is simple and safe.Online delivery: great and timely.",
    "Only giving these a 2 Star review because I bought them with the goal of patching jeans. They colors nor the fabric match jean material & they are obvioius on Jeans. For Pants I'm sure they'll work ok, since the material is thick & the bonding glue is decent, they are also easy to use. However these are NOT for patching jeans.",
    "I'll break this into two parts, Emulsion and Cleaner.Emulsion: Perfect, *it's a small bottle, so depending on the size of screen and how many layers, you may want a larger bottle.*Screen Cleaner: Absolutely useless. It was like using water. It barely took anything off the screen. I ended up borrowing someone else's cleaner. Very disappointed.",
    "Arrived quickly and exceeded my expectations (i'm always skeptical when i see pics that it's not going to be as pic'd). Is just the right size for my 8 gallon kettle. Inlet and outlet are hose clamped together and i had no leakage with the hose fittings. Chilled my wort to 70 degrees in 20 minutes (your results will depend on your water temp). I would recommend the 50 footer over a 25 footer to anyone considering the coil type chiller.",
    "I haven't even needed the refill cartridge yet, but I will soon since I use my XRN900 for all sorts of projects! My fiancee and I bought the XRN900 along with this refill cartridge to create our own address labels and other personalized items for our wedding. It honestly could not be easier to use. We have fed inkjet paper through it and also thick 110lb cardstock. Both have worked extremely well. If you ever need to make your own stickers, use the Xyron XRN900! I haven't tried any of the other cartridges, only the permanent adhesive one, but it has worked perfectly for what we need. I am not the arts & crafts type but I do appreciate an easy-to-use machine that simplifies everything.IMHO, you really could not go wrong with this line of products.",
    "Nice product. Just what I needed. Works as easily as is advertised. Shows up and is ready to go not much assembly required.",
    "Looked at several different sewing machines after months of searching. I finally decided to purchase this machine. I really like the machine very easy to use and most of all I love the automatic needle threader. Would recommend this machine to anyone. I have just started quilting and needed a light weight machine to carry back and forth really didn't want to carry my other machine back and forth to my quilting classes.",
    "I love these pens, I use them on almost all of my projects! Just becareful no to smear them! Have to let them dry for a minute! Very smooth gliding and great results!",
    "The service from these people was PHENOMENAL and the easel pads are just great. If you've been balking at paying the prices charged in the chain office supply stores this is your solution. I do several conferences/classes a year and I've been looking for a good source of easel pads. I've found it. If you're a bulk purchaser for an institution or company you'll save a lot of money with these folks over chain office supply stores. Nice job!!",
    "I purchased my machine 4 years ago, and I am still very pleased with its performance. I've used it for many projects, and of course it needs alittle TLC from time to time, but thats not a problem. Very easy to clean out. but I do wish they manual explained where you might put some oil.",
    "It took me about 5 seconds of doing this kit before I decided I wasn't in the mood for needlepoint, but the kit is awesome. It has a really clear full-color picture on the canvas so you know right where to stitch, and the threads are presorted so nicely. The price is quite nice when you break it down by hour of entertainment that kits like this give you! I highly recommend it...if you like needlepoint! ;DYou might want to start with this kit if you've never done needlepoint before, because the instructions that came with this kit are not very informative:Dimensions Needlepoint For Dummies Daisy Diamond",
    "It does exactly what it says it will, nothing more nothing less. The drivers installed properly on the first try in Windows 7 64-bit. I designed up a test pattern in my free DesignEra software, exported it to a .pes for my Brother SE350, and opened up the software. It downloaded without a hitch and ran perfectly on the machine.",
    "My sewing is limited to hems, and items for my house, including pillow shams and duvet covers. Although I don't sew often, my standards are high. I use good quality materials, and want my seams to the straight and even. I expect a sewing machine to be heavy-duty enough to sew through two layers of upholstery fabric, plus trim or cording, including where the trim overlaps for tidy joinder. I found the Singer 6038 was not up to these, and other tasks. Specifically, the automatic needle threader did not work after I changed the needle the second time, it was not sturdy enough to sew through overlapping trim or cording, even when I tried to urge it along manually, and I was never able to get the one-step buttonhole feature to work, despite repeated attempts. The machine has a cheap appearance, being made out of plastic, and I am wondering if Singer makes a model with all of the new features, but also with their former sturdy construction.I did like the convenient storage in the base of the machine, the push-button reverse, and the ease of changing needle position, stitch, and pressure foot. However, overall, I have not been satisfied with this machine, and, after working with it for two years, have given it to my mother. I am now seeking to buy a model that will sew through more than two layers, and has a buttonhole feature that works. I recommend spending a little more for a better quality machine.",
    "This stamps are really small, and they are very simple, whichever the use u wanna give it, its going to work for sue, but i thought they were going to be bigger. The handles are amazing but the ink doesnt last long",
    "Short & Simple ... I LOVE this Tool!!! Something that you definitely wanna have by your side ... It's convenient & a good price!",
    "Not impressed. Some came with no teeth at all and some don't last well at all and I have been piercing for 3 years",
    "I bought this machine for my 10 yr. old niece for Christmas. We used it on Christmas and it sewed very well. We did not experiment with all the different stitches but I was very pleased with how it sewed.",
    "I ordered lots 'o spacers/beads the same day. Some were definitely not what I expected (poor quality), however this little batch is great! Shiney, delicate, majority are in one piece (some come with missing \"petals\" or halved or other various little manufacturing mistakes). They really show-up a piece of jewelry.",
    "This has some great information in it. More than any other American Field Guide I have ever picked up!...But with all that info comes a price...IT IS HUGE for a Field Guide! Some folks may want to stuff it there backpack anyhow. I love all the many details on each species, even more than my National Geographic Guide. I think the week point may be the maps but not enough to be highly concerned. The truth is birds fly and they all go where they want anyway (yes, I really believe this.) I like the song I.D.s and the paintings are great, sometimes a little small for the pages but for some reason it does not bother me and it seems to make up for it with all the extra paintings. Great book! If you are a serious birder you must have this in your library!",
    "I have bought better selection of colors in full sticks for about the same price - I can't imagine working with chips - the process of sumi is grinding down the pigments and I don't know how you can do that properly with chips",
    "I am totally satisfied with my Sheaffer For The Beginner Calligraphy Kit including 3 pens, 3 nibs, and 14 ink cartridges.Each pen is ergonomically designed with cushioning grips for the fingers to rest upon; with this feature the hand tends to relax, allowing for fluidity of movement and more graceful lines.The nibs are made of quality metal and perform flawlessly so the ink flows evenly and every time. I've used all sorts of technical, fountain, and art pens in my work--these pens will stand up to any of them for the task they're designed for.The inks in my kit were nothing to complain about. The colors are clean, crisp, and dry richer than when first applied; the \"light\" yellow at night turned a very substantial and beautiful deep yellow by morning. I'd call them jewel-toned.The booklet supplies the basic information you need to get started and nothing more. The 'hands' include The Sheaffer Script, The Chancery Hand, The Gothic Hand, The Unical Hand, and the Roman Serif Alphabet, in their complete upper and lower cases, along with their respective numerals 0 to 9, all large enough to trace or copy without a problem.",
    "I took forever to decide which table and chairs for my 4 grandchildren [4 yrs -14 months].Finally decided on this one and am very happy. Arrived in just a few days, was easy to assemble, is safe for the children, easy to clean and looks adorable. Could not be happier with this decision !",
    "This might be okay if you're punching thin paper, one sheet at a time, but when I tried heavier paper the plastc - yes, plastic! - handle snapped right off. Maybe mine had a defect, or a weak section, but without a metal core the plastic will eventually weaken and break. Not at all worth the money, I will never buy one like this again.",
    "I am absolutely in LOVE with my new sewing machine. I have not sewn in 18 years (since home ec, in middle school) and I was able to take this out of the box and start sewing immediately. Great helpful manual, super easy set up, etc. I thought the threading tool was silly at first, but I use it all the time. Saves my eyes, for sure.I have not had any troubles with this machine yet, which is shocking because I really have no training. In the 2 months of owning it, I have sewn scarves, pants, pjs, a dress, stuffed animals, all on a variety of fabrics ranging from faux fur to knits.",
    "I find Hagerty silver polish to be the best on the market. It doesn't require a lot of polish or elbow grease to bring up a like-new shine to your silver pieces. Even the most heavily oxidized piece will respond to Hagerty silver polish.",
    "It came very quickly, and it is unblemished and sturdy. I dedicate myself to this Canvas Paper, as it is some of the best quality paper you can get!",
    "Received in a timely manner. It was well appreciated by the grand daughter who received it. She was able to make several gift projects for Christmas.",
    "Got 5 kits for momma's day gifts from our then 2 yr old. I was able to quickly set up all 5 molds, put the beads in plastic cups, and call him over to make hand prints and place stones in the molds. Simple. Easy. I recommend using less water in the cement mix.",
    "easy to use, took us an hour to figure out initially, but now comes as second nature. delivered timely as usual",
    "I love this yarn! I use it to crochet baby blankets and they turn out thick and plush and soft. I have made about 5 of them for various shower gifts and word is that the babies love them too! I used the cream color for my latest project and it's beautiful. My favorites also include the deep purple color and the wandering vines.. I used to buy this yarn in my local store but they stopped carrying it and I HAD to have it! So happy to find on Amazon.. If you want soft and squishy and cozy, this is your yarn too!",
    "This product worked well for my 2nd grade classroom. No lumping easy to spread. I used this for a Christmas craft. I will buy this product again.",
    "I bought this book because I had heard it was a great reference. It has proven to be a useful addition to my adventures.",
    "I have been sewing since about grade school. I loved using my Mom's Signature sewing machine from Montgomery Wards. When she passed away it became mine. I've used it for many years now, but it's time to retire it. I needed something that was as easy to learn and easy to use. I was definately afraid to learn a new machine. I searched and compared for almost 2 weeks. The Brother CS6000I kept comming up with rave reviews no matter where I looked. Now that I have one of my own, I love it. The set up was easy and the performance was flawless. I have used it many times so far and I love the ease of the set up and it's so light weight I can change locations to use it and store it. I would definately reccomend this machine to anybody who loves to sew.",
    "I am very pleased with this product. Have only used 1 set so far but think the construction and variety is super great.",
    "This is a very nice looking set. It is more durable than other sets and costs half as much. One of the legs cracked in transit and the customer service at Kid Craft was great to deal with. We had no hassles to get a replacement.",
    "Folks, this isn't a pottery wheel. It is a banding wheel used for pottery, but for decorating or for sculpting to make it easier to turn your piece while working on it. If you are looking for a pottery wheel google it. You'll end up spending a few hundred dollars though, so if it is priced at say less than $30 it isn't going to be a pottery wheel.",
    "I have a roll of this tape, and another roll of Scotch Shipping Packaging Tape. The latter is widely available at drug stores, food center, and so forth. The width of the two rolls is the same: two inches. The adhesive feels the same to me. Why bother to go looking for this \"book tape?\" Maybe the book tape is a bit more transparent. I don't think it is quite as strong as the ordinary tape.It is a fine product, like everything else that Scotch makes. I would not go out of my way to find it, because their ordinary tape is similar.",
    "I was searching for something like this for my boyfriend to hold his old concert tickets. It was perfect!",
    "I used these papers to wrap chocolate covered oreos to send as a gift! They looked great!",
    "These arrived quickly. The five of them come in the little plastic case--oiled and stuck together. This is fine, except that these suckers are crazy sharp and there is almost no way to get just one of them separated from the group without slicing yourself open! There's five of them, like the adverts say. Fit perfectly. I'm giving this product 5 stars because, well, that's what I want them to be-SHARP. Just be careful when you need to replace your old one ;)",
    "I purchased this glass and tile cutter for a bathroom project. After practicing curved and straight cuts I've decided to go a different route. I'm just planning to use it to cut tile pieces around the toilet, but I know that I will be breaking some in the process. It's a good thing that I purchased some extra tile pieces. If you're looking to any type of tile work I would not recommend this product, because it takes a lot of pressure and it has a poor grip. I haven't tried it on glass cutting, but I'm guessing it would work well for that.good: fast deliverybad: Not a very good tile cutter, horrible grip",
    "I have used Jack Dempseys products before, I have always found them to be of good quality and easy to work with.The price is about average for them also.",
    "This case arrived in good condition, but was deformed when manufactured. The bottom bowed downward in the center about 3/4 inch and rocked back and forth on the floor. My wife asked me to make a close-fitting base for her Brother model 1034D serger. I cut a piece of plywood and two 2x2x4 inch bumpers from 2x2 wood. I covered all with thick felt and fastened the base to the floor of the case with one bolt in the center. The internal base holds the serger in place and also flattens the floor of the case. IF YOU'RE NOT HANDY WITH FIXING DEFORMED PLASTIC PRODUCTS, I WOULD NOT RECOMMEND THIS CASE. I'M ALSO SORRY TO SAY THAT THIS CASE IS MADE IN THE US... QUALITY CONTROL ON THIS PRODUCT LEAVES MUCH TO BE DESIRED.",
    "This is a great set of markers, deep colors that last. Great for art class, there are better markers out there but dollar for dollar these make my daughter feel like her art work pops off the page",
    "This sewing machine is great to use. I know a little bit about sewing but have been afraid of buttonholes. This machine does it for you! I just followed the directions in the user guide and now I think I'm an expert. I haven't played with the embroidery stuff yet but I am planning some projects to accomplish in the near future. I like the one touch sewing (without the foot pedal) but I highly recommend using the foot pedal for your sewing. It is easy to accidently sew your fingers.",
    "My daughter shows a lot of sewing talent and desperately wanted her own sewing machine. (I'm not a seamstress, but my mom is.) I gave this to my daughter for Christmas, and she was thrilled!",
    "I am using the paper to diffuse/soften lighting for product photography. I have a couple small frames that I built and cover with this paper. It's inexpensive and works well, elimniating harsh shadows. I don't stress out if the paper rips, as it's quick and easy to replace.",
    "I purchased this as a gift for my niece who is interested in learning to do needlework. I'm hopeful she be happy with it.",
    "I'm a beginner with no real sewing experience and this sewing machine worked great! The instructions are clear-cut with illustrations and it was easy to get started. This machine has 25 stitches which is more than enough for a beginner sewer and it was really easy to thread. I took a class at JoAnns and to my amazement, I was able to make pajama pants! My next project is a pajama top. I look forward to many hours of sewing on this machine!",
    "This is a nice Thanksgiving set of stickers....but $8 is WAY TOO much to pay for it.",
    "Very plastic, and cheaply put together. I didn't really have high expectations for such an inexpensive sewing machine to begin with, but not one things about it impressed me. The needle seems woobly, bobbin is difficult. I returned mine.",
    "For the money this sewing machine has lots of capabilities. I have not done a lot of experimenting yet but so far I like this machine. It is light-weight and easy to set up and to move. It seems to sew evenly. I'm not fond of the plastic bobbins which seem pretty thin, but so far have not had a problem with them.",
    "I love the blades, they cut straight and clean. I reccommend that everyone should try them, they work great!",
    "Apparently unlike other reviewers, I am a professional photographer and i own at least 15 portfolios like this one -- not all the same size, but from this manufacturer and they are very durable and presentable. And unlike my fairly expensive leather portfolios, I can leave them with a client and not worry about damage or whether or not they are retuned in tip-top shape.",
    "After reading reviews and seeing this machine demoed on TV .I decided to buy it.Having never used a serger before I was somewhat afraid that I might of over stepped my bounds,but the manual and video's were so self explannatory that it ony took me acouple of minutes to figure everthing out.For the money this serger is a great value.",
    "This little kit has about everything you could need for a quick repair. The storage box that everything comes in is a bit cheesy, but you get what you pay for.",
    "The paper fulfils the purpose for which it was purchased. My wife is an artist and we use the paper to produce various size reproductions of her artwork, which she sells.We produce prints in 8 x 10 and 5 x 8 formats using an Epson Photo R1800 printer. We can print two 8 x 10 prints on one sheet or 4 - 5 x 8 prints. The paper due to its whiteness produces bright prints.I will buying this paper again many times.",
    "It cuts, it slices and it dices. Cardboard? Plastic? Paper?X-ACTO #2 Knife. It cuts.",
    "I always need a hole puncher. I can never find a dress pant belt that is the right size. This too helps me make it the right size.",
    "The new safety feature that requires an upward push on the striking lever before pushing inward causes a significant usability problem, three or more attempts are required to get a flame. The old design worked fine for 15 years.Unhappy.",
    "Clover fusible web makes stabilizing bias tape quilting designs a breeze. The fusible web is light weight and adds minimal bulk.",
    "I am new to sewing. I used this today and It was amazing. self healing seems to work I haven't seen any scratches yet. the blade is very sharp. not sure if over time it will scar but it was great for a beginner.",
    "Just what was needed, heavy kraft paper which we are using for Thanksgiving for Pilgrim outfits and in Social Studies to make sarcophagus.",
    "My 3 yr old loves these! They are a welcomed break from school. It really doesn't matter what I put in front of her, she fills the page every time! Very durable too. And doesn't stain!",
    "this item is great, the only thing that was a litte strenous was the directions, went to knittinghelp.com for help, the yarn is more than enough to make more than a scarfi've made belts, booties, and a bib.",
    "Excellent little machine. I have only used it for basic sewing of items such as curtains and throws and it performed very well indeed. The only quibble I have is the fiddlyness of the bobbin - winding on the thread doesn't always work properly and I devised my own method: and I found inserting the bobbin into the casing slightly awkward.However I got over these problems and as I said the machine did the basics I asked of it. I would recommend it to anyone wanting a no nonsense machine.",
    "After seeing a demonstration of needle tatting, I was intrigued by it and this book was recommended as a great teaching tool. Local stores no longer carry the needles, but they are included with this book. Each photo is clear and simple to follow, and I was able to create the butterfly and bookmark right away. The book teaches how to read a tatting pattern. Needle tatting seems less complicated than shuttle tatting yet the results look the same. I'm still a beginner, but want to keep practicing and learning more complicated patterns. This book is a great way to get started.",
    "I love the sewing machine. I purchase quite a bit for myself and my kids on Amazon.com and then I heard about warehousedeals.com. I was skeptical about purchasing from this site. It was in perfect condition. It was light weight. I never would have been able to afford this quality of a machine at this price anywhere. My theme song is \"Amazon is my friend.\" I can buy in four clicks. My husband is constantly letting me know that I have another package from Amazon.",
    "This machine is a great value. It does everything I need and more. The pack of extra feet and accessories is pretty complete.",
    "They are small enough to get into tight places, and tough enough to file away material quickly. A very good deal, considering one of these files could have cost the same as the whole set. As a set, it costs less than $1 per file.",
    "It's another Brother for my sewing room.....still learning what it can do......have figured out how to use the gather function and have used that for a Christmas gift....really came out well......will continue to work with manual and machine until I know it better......had no problem learning how to thread it, which I feared......Brother took care of that with their design....piece of cake.....even for an older person......",
    "can someone please enlighten me as to what colors exactly come in this 12 set? and why is prismacolor so shady as to what colors are in the set?! O_o",
    "Would recommend it to others. Great product. Ek Success EKHG01 Coloriser HeatTool. I use it on all of my greeting cards.",
    "This is a nice sturdy whole punch. It really gets the job done neatly.",
    "I bought the tempera cakes for my 2 years old son and he just loves these. The color is completely washable, does not smell, and it is very easy to paint on paper. I recommend this item for all the people that would like to introduce the art world to their children.",
    "I had no idea what I was buying when I bought this for my husbands birthday and he was so excited to get all the needed parts, paints and cleaners.",
    "I was a little leery buying a plastic sewing machine when my nice heavy old machine died out on me. I am so glad I did though. I haven't had any projects that it couldn't handle (granted I don't sew sails or anything heavy duty). I love the speed control for when I'm doing complicated appliqu&eacute;s and need more control. It's nice and light so it isn't so heavy to move around. Can't find anything to complain about.",
    "I have yet to use these for threading my serger, but just know they have to be the answer to a frustrating process of getting the threading done. They come highly recommended by my fellow serger's buddies.",
    "These are the best pencils I have ever used! Im making my own flash and nothing beats these! they are SUPER blendable, bright colors, very easy to work with! the leads are soft which is WHY they are so blendable. they are the perfect pencils if you are a SERIOUS artist! this is also the best deal your going to get on these pencils!! our shop usually buys from art supply stores... its about half off here! love the pencils and WILL buy again and again!",
    "I typically do large paintings, I am a portrait artist, and I wanted a projector so I could save some time.This little guy is absolutly perfect for what I needed. I don't usually trace the entire image, but I used to have to make sketches and find some way to enlarge them, like graphing or try to freehand proportions on huge scales, which meant a lot of editing and fixing in the painting stage... This little tracer has totally cut out that step for me, I can make a sketch and just throw it right up on the wall, then ofcourse the bigger I want it, the farther away I move it and visa versa.The only downside (if you want to call it that) is the size of the picture it projects. It only enlarges images up to 3.5''X3.5'' but from there you can pretty much get it as big as you want. I solved this by putting a cross through my sketch (or on a transperency over it) and then a cross on the canvas, then when I had to move the picture to get the other sections, I just had to make sure the crosses on the progection and canvas lined up.This is really great because you just slide the pic under there, turn it on, and there it is. You can even project color images.I would recomend using in a room where you have a lot of control over the light as well, it's not quite strong enough to see in the day time, so I just do my sketches at night.Great great great for the price!",
    "Redoing all my old sticky paged scrapbooks.These are great for also sliding old scrapbook pages on individual paper right into the sleeve!Can't wait to get going!",
    "its not something i'm jumping up and down over. after trying it out there are drawbacks. you are limited to how much area you can paint on at the ends. since you can't paint all of egg at once, what's the difference in just holding the egg and painting half. then when one half dries, paint the other half??",
    "This is really awesome for quilters I think I am going to have to buy one or two more of these for our quilting class we are having as I think they will enjoy these as well. It's neat to see the different ways to do the different types of patches that you can do on them and how to lay out the templates after they are cut onto the fabric. These are just too cool. Can't wait to get the rest I have ordered of this type. Awesome Ideas",
    "This pellon offers precisely the desired amount of body to the fabric for its intended purpose.",
    "The easel is the only good item in the whole lot. I'm not a painter but it doesnt take more than common sense to see that the brushes, paint, paint board and canvas are junk",
    "This tote accommodates my Viking Scandinavia 200 with space to spare. It is light weight, lightly padded, sturdy and well designed. There is no shoulder strap, but it's not needed. Gotta Have It! handled a Metra train ride with ease.",
    "I'm sure this product would be nice, as it was everything I was looking for. However, this company absolutely does not ship APO. It is not expensive nor are they shipping to a foreign country. APOs count as U.S. addresses. They seriously need to rethink this policy.",
    "This mat has been perfect for my use so far. I use it to roll out duct tape and cut the tape on the measured lines with either a blade or a rotary cutter. The mat really does heal up the way it promises, and there are no jagged edges left anywhere. At times it's hard to even find the old cutting lines.The mat is heavy and has a great solid feel to it. The light gray color isn't too jarring on the eyes and the lines on it are very easy to see. A feature I really like is the 45 degree angles I can line up my duct tape sheet with to cut perfectly angled flaps.The 18x24 mat is sized well for most of the projects I come up with. It fits well at the end of the kitchen island or on a card table.Overall, I love the mat and I'm glad I picked it over others I looked at.",
    "Awesome deal to have this paper delivered to your house (love Amazon Prime). We use this paper for wrapping paper, table clothes, craft paper and packing material. It is high quality thick paper. Just make sure you have room for the roll it's big!",
    "This is a great product to slip into a bag for those times when inspiration strikes. The paper is smooth and durable.It stands up to a heavy hand and heavy ink. If you looking for drawing paper and want it to be portable this is the product for you. Not good for a finished piece, best for sketches.",
    "Love this machine. I simply opened the box and started sewing. It is so easy. I would highly recommend this sewing machine.",
    "The signs are great, and look exactly as pictured above. They aren't very sturdy, so you have to make sure that you supervise the children who are playing with them if they are the \"rough type\". If you have a child that will just ride their tricycle around them, or run around them, then don't worry.",
    "This item (See-Through Book Repair Tape, 3\" Wide, 15 Yards Long, 3\" Core (MMM8453) was exactly what I needed for the job. I even used it to protect as yet undamaged books.Thanks!",
    "I'm generally a big fan of Canson products. I was so excited to get my hands of one of these elusive books only to end up disappointed at how the paper would buckle under the lightest of watercolor washes. The paper also seems to suck my markers dry. So what exactly constitutes \"All-Media\"?It also has an odd texture that I don't much care for.I will not be buying another.",
    "I bought this sewing machine just so I could sew up my Halloween Costumes. I'm a real Halloween nut, so I go all out every year. This year, I decided to make my own costumes... Only problem was, I didn't have a sewing machine. So, I found this one. It's cheap. It's practical. This machine is very basic, and very easy to use. I absolutely fell in love with it after the first usage, truthfully, I use it on a daily basis now. Great product! Definitely deserves the five stars!",
    "You can use other things to remove what you cut with your cricut - or even use your finger nails but it is so much easier with this handy little tool and it is a \"must\" for the little pieces. It is almost impossible to remove them with your finger nails and you could use a toothpick but it gouges you mat. This is irreplaceable.",
    "Very pleased with product; easy to apply to 4 x 6 photos. Needed to reorder and will be ordering again.",
    "I am not sure what all the hubbub is on here about Do-A-Dot markers being super-staining. While we have not actually dumped the ink out of these things to ensure they won't stain my carpet, my daughter is definitely not \"careful\" with them and we've never had a problem. They certainly come off a kitchen counter, a wood floor, an IKEA desk, windowsills, and a coffee table. They also come off her skin just fine. And so far I have not encountered stains on her clothing which tells me laundry detergent is at least getting it off her sleeves/cuffs.Not that I would recommend doing these on carpet, or giving them to a hyperactive child, but they are SO much fun, it's hard to not recommend them. My four year old, six year old, and even my seven year old enjoy them. They are very different from regular markers or paints--a great experience of their own. And I give this set in particular five stars because the regular Rainbow set is missing pink and purple, which most little girls really want. I'm not sure they \"shimmer\" in any true sense--they don't have glitter or sparkles in them--but the silver and yellow-gold colors are nice to have.Just FYI, the purple, yellow, and blue are NOT repeats from the Rainbow pack. They are different shades, so I appreciated that.",
    "I think this is overpriced. Since I ordered this, I have found other color wheels that probably do the same thing for a more reasonable price.",
    "This was a great product! I got exactly what I was looking for and a low price compared to other sites. Thanks!",
    "This paper produced a very vibrant color photo of excellent quality.I would recommend it to photo buffs that enjoy making their own.",
    "I am just learning the art of chenille quilting. This refill will be used when needed for the Olfa cutter. There was a delay in receiving the product.",
    "This is a great product. I had never made paper before and it was easy with this kit, not mention beautiful.",
    "Punched only three holes. On the attempt at a fourth hole, the piece locking the size selector in place bent, misaligning the hole punch with the base, making the tool useless.",
    "This rub and buff product in gold leaf color worked great. I needed to edge drawers on a dresser and a headboard and it went on easier than paint, more solidly gold, and when rubbed it gleamed like the original sprayed-on paint did in the 1960's. I later used it on a mirror frame and it looks expensive. I would recommend this product, it goes a long way, goes on easy and looks great.",
    "These shears have a very comfortable handle, and the blades cut well. I found them a bit difficult to use on heavy flannel until I loosened the screw holding them together to make them easier to use. I was having a struggle with their cutting on this heavy flannel, but they did a nice job afterwards.",
    "So wonderfully surprised by the accessory pack! I knew about the buttonhole foot, but this kit also included a Narrow Hemmer foot that was not advertised! Nice! This foot is great for lightweight scarves and rolled dress edges. The kit also has a button sewing foot, a zipper foot, a blind stitch foot and three bobbins and a needle pack. Great package for a fabulous price!!",
    "My wife was happy with item. The service was quick and easy. The Email followup was very good. It gave me a feeling that all will go well.",
    "This has got to be the best baby hat book I have seen! These hats are adorable and so easy to do! I am a new knitter and have only done scarves, felted purses and some easy rolled brim hats. But I can say that I will make every one of these! The directions are so easy to follow and the photographs are awesome! I hope Susan makes a Itty Bitty Hats II!",
    "I know this book is called \"Teen Knitting Club,\" but I think it's great for beginners of all ages. If you already know how to knit, this book probably isn't for you, but if you're just learning or even trying to teach yourself, this book is great. The directions and diagrams are very clear, and the patterns encourage creativity and substitutions. I've really only used the scarf patterns in the book though, and perhaps the hat pattern, as many of the sweaters didn't really appeal to me.",
    "I bought this based on the price and I have good success with Stanley products in the past. This gun is a piece of junk and the trigger mechanism broke during the first use. I ended up getting the Arrow at a hardware store and even though it does not have the best reviews on here the Arrow is a much sturdier construction and made in the USA",
    "These scissors have held up well to low impact cutting. They're excellent and remain sharp. I read about some breaking problems, but these may be caused by tasks that are a little beyond their intended use.",
    "Lovely texture to the paper. Picks up the pastels well. Great to find a larger size paper also. Recommend it.",
    "Two inch buckle, no problem. They cheaped out and put the webbing grip only on 1 side of the buckle so you either have to sew on the other side or purchase an additional part. Why not just make the webbing grip on both sides, duh!",
    "I was disappointed in that this case is just a plastic box with no way of locking a sewing machine into place so it doesn't shift around. The seller got it here quick as a wink so I have no complaints with the seller.",
    "I purchased 4 of the 6x6 Claybord deep cradles in early January 2012. I make shadow boxes to sell at local craft fairs and this was my first experience using this product. The 2x2 depth allows me to add lots of detail and, in addition, the boxes are sturdy and well constructed. I like this product very much but, in my opinion, there are pros and cons to using this product:1.The Claybord texture is relatively soft and I suggest a light sanding (and I do mean light!)to prepare the surface before use. A vigorous sanding will cause the Claybord texture to flake and crumble (for lack of a better word). Always use a damp, lint-free cloth to wipe away dust or particles.2. Because the texture is soft, be careful when using clamps or similar tools. I now have 2 small round circles on the outside of 1 of my boxes that I can't remove since the surface has already been stained and finished.3. I prefer to stain not paint the boxes. A good quality stain such as MinWax will highlight the texture and grain of the surface and create a very professional look. I have painted only 1 of my boxes and didn't like the way it turned out.I am currently working on my 3rd shadow box and recently ordered 2 of the 8x8 deep cradles.Be well,Jeanine",
    "Nice scissors. Works great. I prefer the angled scissors, but for the price offered, this is a great scissors, to have around!",
    "this is a great machine for the price. I have used it mainly for sewing halloween costumes, 3d material, glitter tulle, wired ribbon etc",
    "This software works well on my old computer with windows 98 but does not work with my lap top which has Windows Visa. I tried the patches and could not get them to work. I am suprised Brother is selling something so outdated.",
    "We bought this as a gift for our 3 year old daughter. She colored it and when we went to wash it 2 days later (the directions say to wash it within 48 hours)it didn't come clean as it said it would . It didn't even look like we washed it! I washed it again according to the instructions and it still wasn't clean. Finally after wash number 4 the colors are faded enough so she can color it again. It's a great idea, but unfortunately it doesn't work!",
    "I am venturing into Bargello quilting and wanted to make sure that my seams stayed straight, it is very important in this method. This product is the perfect tool to accomplish that. I would highly recommend it to any quilter, accomplished or amateur.",
    "I bought this machine over 8 months ago and have been continually suprised at all of its great features. After doing a lot of research on different brands and models I settled on this machine and haven't regretted my decision. There is definitely some learning involved in winding a bobbin. You have to make sure the thread sits in the middle of the bobbin before it starts winding. I also occassionaly have to use my finger to guide the thread to make sure it winds evenly. However, this is no big deal and I've read where many others have to do this on machines that cost a great deal more.The stitch quality is wonderful and with over 120 stitches to choose from I am able to always find one that suits my needs. The display offers a help menu with pictures if I need assistance.I mostly sew home dec items and clothing and this machine has handled it all.",
    "You get exactly what you pay for wifh this. The thread tension is a real problem. I couldn't stitch chiffon at all- it kept snagging and bunching up. The foot pedal is so poorly made, I was nervous pressing on it.I'd rather sew by hand than fight with this .... Do yourself a favor- don't be cheap, buy a real machine.",
    "These points work great to assemble pictures in frames and allow the easy removal and re-installation of the mat and picture as required without breaking off.",
    "This arrived sooner than expected and was beautiful! The photo on line does not do it justice. I have thoroughly enjoyed using it as a beginner, and look forward to adding to it's basics as I get better at ink brush technique.",
    "Excellent machine for the price. Read all the reviews and you too will be convinced it's a good buy and product.",
    "I needed something simple for simple jobs, and it is great.It took me 30 minutes to unpack it and get it going.I love this little machine.I was with Singer before, and i dont regret my new Brother :)",
    "As a book publisher (JamesRussellPublishing.com) we pack and ship a lot of books sealing our corrugated boxes with this 3M Hot Melt Applicator Gun. It does not drip and it has a nice stand to keep it upright, heats up quickly in about three minutes and is reliable. If you are looking for a nice glue gun for your production, get this model, you'll be glad you did. The 3M Glue Sticks brand also has low to no solvent odors so odors is not going to be a problem and it can be used in the home (I tried it in my home. A slight odor on initial first-time start up, but there was no odor after using it after this). You pay a bit more, but the quality, performance and longevity is well worth it. This glue gun performs as well as very expensive brands that costs hundreds of dollars. I was pleasantly surprised by this 3M product.",
    "Love these brushes! They fit in my hand perfectly, and have become an extension of my ideas. Distributes the paint perfectly.",
    "These buttons are great. They are so simple, but provide so much fun! My 1yo loves dropping them in the metal tin I got to hold them because they make a fun noise. She also takes one in each hand and bangs them together. As she grows I imagine we will use them to talk about colors, numbers, shapes as well as similarities/differences.I also saw someone take them and attach one to each finger tip of a glove. That makes a fun toy for using with smaller babies because you have the colors and also some noise.",
    "Excellent product, very easy to use. It includes precise and clear instructions which are very easy to follow. Made my model work look most professional.",
    "I love this paint. It not only is bright and colorful, but it is washable! The real kind of washable too! I've tried many different paints and this by far is the best. My toddler loves the choice of colors. The plastic bottles are perfect too. They have lasted a long while.",
    "I'm very particular about the pens that I use and I must confess that I enjoy this one the most. The pen is very classy and has the elegant look of Montblanc. Excellent Christmas gift for those with an upscale taste.",
    "I was very impressed with the quality of this product. First, the tubes were filled with glue, not half-full like many others I see, The colors were bright and the pens were easy to use, even for a preschooler. The glue is only a little glitter-y, but preschoolers don't care so much about that. The price can;t be beat!",
    "I definitely would not waste my time and money buying this variety of needle threaders. I have used these and they do work great, but they are SO easy to lose and bend. For just a few dollars more you can get a very sturdy Clover needle threader that works like a champ every time and includes a thread cutter!Here is a great overview and tutorial on how the Clover needle threader works.",
    "This storage system has its flaws such as the wing compartments swinging open if not carried with care and the thread spools fall right out of place when case is being opened or closed. The thread spool problem i temporarily resolved by placing rubber bands across each row in order to keep them from sliding out. The swinging of the wing compartments don't really bother me as i don't really take it anywhere and the plastic doors keep everything from falling out of it. What does bother me is that it squeaks so loudly when being opened or closed! I don't recommend this for someone that will be using it frequently, I've had it for about 3 years now and though its still in mint condition will be replacing very soon. Overall its a good buy due to having everything a beginner will need.",
    "I think this is a GREAT book! I have NEVER knit before, but I am 9 months pregnant and bored...so I picked up a new hobby. This book has wonderful instructions at the beginning for the \"total newbie\". I was able to knit my way to a cute hat in 2 days. I am not sure how I would feel about it if I were an \"experienced knitter\" but the hats are adorable no matter what!",
    "The pinking shears have bolts to keep the blades together. The bolts are too thick and prevent the blades from moving easily, even after oiling them.",
    "Holy Crap those are sharp!And you get SOOOO many. Like 100 or something ;)Best deal here, don't buy them in the 10 or 20 packs the price savings is huge w/ the 100s.",
    "I am in a hotel and just had to have a sewing fix. Ordered this one for less than $150, it was the only one with an adjustable pressure foot-for thick lofty fabric. It is a POS BUT...if you are an experienced sewer in need of a machine on the cheap you can deal with it's quirks i.e pulling the thread out long enough to not come unthreaded each time you stop and start. It sews a decent stitch, lightweight and comes with standard accs. I would not recommned for a novice because it is a PITA to thread properly and aforementioned stuff.I also ran down to the local shop and picked up some other stuff on the cheap but it's all doable, but again you have to know what you're doing. I think it's kind of like those old car keys that are worn and you have to get the right touch/jiggle to get it to work. For the price you won't cry if it breaks. Hey a disposable sewing machine!",
    "Works great - 4 pair of eyeglasses saved for $6.00!I bought this to clean up my scratched eyeglass lenses. They were covered in small scratches, and the last straw was getting some hydraulic oil on them, waiting overnight to clean them up. The fluid evidently got under the coating, lifting and bubbling some of it off, leaving the lenses cloudy. I have hi index, scratch resistant, anti glare lenses - coating on the inside and out.(always cost me about $450.00 to replace) I started by applying Armor Etch with a Q-tip to the outside of the lenses - giving it a minute or 2 to work before rinsing it completely off with cold water(be liberal with the water as this is acid and you are applying to an object that eventually sets next to your eyes!). The results were a little cloudy, like it had worked under some but not all of the coating. I repeated the procedure - each time lengthening the working time for the etching cream. I finally found that about 30 minutes was just right - more time did not yield any better results. I even tested leaving Armor Etch on a pair overnight with no ill effects. Armor Etch does NOT affect high index polycarbonate lenses. A Q-tip can also be used to lightly scrub off any stubborn spots of coating still sticking to the lenses. Since there are potentially coating on both inside and outside of your lenses, care should be taken to confine the cream to the side you want to clean. My lenses had 1 layer of coating on the outside (scratch coating I assume)and 2 layers on the inside. By the time I got all the coatings off, my lenses were like new again - crystal clear! I repeated this on 3 more pairs - reclaiming almost $2000.00 worth of eyeglasses for $6.00 in etching cream!Wear gloves! Follow directions - this is acid!",
    "I was a little skeptical when I first purchased this product. Why did I buy it? I want a light source; that will let me shoot pictures digitally, from old slides. I think this product will do a great job, the illumination is fantastic as I have tried it with slides that I have.So now I will create the cover to insert the slides in, and the experiment will begin. My thought is that it wil be much faster than trying to scan, simply insert slide and shoot, then use programs on my computer to enhance them etc.Thanks Kerry Summers",
    "I found this machine convenient and effective for about 3 weeks. It simply stopped working, no action at all when button is pushed, and I cannot determine the cause.",
    "I think this is a great machine and buy for the money. The problem I had was with the tension on the dog feeds or bobbin. The machine would drop stitches whenever I tried to use any stitch other than staight...even zig zag stitches did not look right. I called Brother several times and tried their suggestions. They advised me to return the machine. I even called the closest service center, which is 60 miles away, and they wanted to keep the machine a week if I brought it to them. BUT, I had to have a receipt with the serial number on it and Amazon does not put serial numbers on their invoices.",
    "The bucket works well at cleaning your bushes keeping your hands clean. My only complain is the lid is very hard to get off. There is no tab to open it you have to have a screw driver to open it.",
    "These Fiskars 8-Inch Non-Stick Bent Scissors have a very right handed design. Cutting with the left hand is uncomfortable. At present there is nowhere on the description that tells a prospective buyer about this. I thought that since there was no hand designation on the website, that they would work for both hands. Perhaps this information will be useful to other prospective buyers.",
    "This was my second spatula I've purchased for my cricut and in comparison, this one is better. It's neck is thicker so it's not quite as flimsy and it's angled slightly better for scooping up your cuts off of the sticky mat. Love it.",
    "I work with leather that wraps around vehicle steering wheels. Working around small openings and work space, the very short and sharp blades work wonders making precise cuts. Precise cutting is easily accomplished by virtue of the \"big ears\" shape (to me anyway) sissor handles with even size to grasp rather then having to turn the sissors around to place the thumb in the smaller handle of conventional sissors.",
    "I have sewn for years and I really have enjoyed this sewing box. It makes it easy to take with me when we go to the cabin.",
    "box arrived bent up and in poor shape kinda looked like it had just been sitting in someones attic for 5 years or so looked much older than i realized",
    "A little big for my needs, but that was my fault. It is a great purchase though. Shipping was fast, too!",
    "Can anyone tell me if this softee baby yellow is the old yellow or the new very pale yellow (which I don't like). Thanks.",
    "I got pink ones for my little boy. Not that I have a problem with that but it would have been awesome if we could have gotten a pair in blue since it's his current fave color.",
    "Easy to use. Works better on newer style sissors than it did on old (30 year +).",
    "This was a gift for my daughter, and she loved it! I loved it because the price was considerably less than I had seen in local stores.",
    "This stick was a good price and arrived as advertised. I am ver happy not only with the ink quality but the design. It has the look of a much more expensive sumi-e ink stick",
    "THIS WAS A GIFT AND VERY MUCH APPRECIATED BY HER. SHE IS AN ACCOMPLISHED ORIGAMI MAKER. WOULD BUY IT AGAIN.",
    "I really like these scissors. I have sewing scissors that if anyone touches for anything other than fabric, well, they are in trouble LOL. So its nice to have a DECENT pair or two (this is a 2 pack) of sharp scissors to keep in the kitchen or a family junk drawer. They cut open many bubble wrap bags (my Amazon purchases haha) and I also cut several of them in half, in half again then into pieces, so like 8 layers of bubble and paper-bag, and it cut right through with hardly any trouble at all, I didn't have to struggle and I have arthritis in my hands. I think most anyone could use these scissors to cut into a cardboard box or any kind of envelope, padded or not. I like that they have a comfy handle also.",
    "rolling pin doesn't roll like a real rolling pin.red tool is not useful.a real rolling pin and plastic knife from home would be better.",
    "I like the product and the weight of it. I made a scarf and a cowl already and I really enjoy how they look. But I've only used two of the sizes, and I can't really figure out what I'd need with the other two sizes, I'm sure there is a project for them somewhere.I wish the pegs were a bit closer for a tighter knit, but other than that I like the looms.",
    "Wonderful. OMG as the youth would say. I am 71 and new to sewing so had \"concerns\" about getting a serger. Most happy with this machine. It works wonderfully. Suggestion: Follow the tip to tie new thread to the old to \"thread\" the machine. I let the original thread run out twice and it was an emotional experience getting it threaded. But when I followed the simple directions, all was fine. Great machine, certainly a good value.",
    "I compared this to shrinky-dinks brand paper, side by side.Differences:~On shrinky-dinks you got to paint and draw backwardly-thinking. With Graphix Shrink Film, you draw it on as usual paper or canvus.~Unlike shrinky-dinks, it will not have a clear-look for areas not colored. It will be white, nearly a porcelain look.~This seems to flatten a lot better and easier than shrinky-dinks.~With Shinky-Dink brand, the best way to color it seems to be paint,whereas this paper seems to work best with colored pencil or markers.Overall, if you follow instructions, its an awesome product that I will be glad to use.",
    "This glitter glue seems to be the easiest I've seen to squirt out! My two year old lies doing projects and has used other glue sticks before that lasted weeks!! It seems to be too small of an amount of glue for the price! I'd recommend another brand!!!",
    "I also tried really hard to like this machine. I have trouble reading and I thought it would be easier to read on the computer screen rather than a smaller screen. I also am a home typist, so I thought I could maybe do my work and at the same time have a little enjoyment with my sewing. The concept is good if the machine would only work. I constantly get error messages saying that there is a 'hardware error' or that there is 'thread breakage.' I have ruined more than half of the items I've tried to monogram. I tried embroidering a small project today and broke three needles and tried 3 different types of thread. Can't figure out what the problem is. Other times when it works the work is beautiful. I've only had it for a month and right now am real close to returning it. The instructions are vague as well.",
    "We purchased this on another geek's recommendation. You see, my husband collects action figures. Specifically, 4.5\" Justice League action figures, half of which are designed with terribly skinny ankles, and a good many of the other half with heavy wings. Every one of them is top-heavy. Doll stands were too big, tray stands didn't work because a lot of them don't have holes in their feet. Just a tiny bit of putty, rolled in your fingers till it becomes sticky, is enough to keep them upright on the shelf. He's very happy, and that makes me very happy!",
    "Something &#34;heavy duty&#34; should not break so easily. I broke the eyes on two needles in five minutes sewing a lightweight item. Singer should be ashamed of itself.",
    "This is our second pair, one for the kitchen and one for the tackle box. Powerful cutting ability and easy to clean, as well as easy on the hand.",
    "I purchased the BowDabra to make bows for my Christmas Tree this past November, I cannot tell you how easy it is! It was so much fun, all of the bows came out perfect, the instructions were simple. I made bows for the tree, for gifts, for decorations. I cannot wait to use it again.",
    "I got this ink pad for the smell, my child loves the smelly stamp. Though smell is sweet and fun, I can barely smell it and didn't last long. I will not buy this product series again.",
    "I have a 3 year old who needs lots of paint...and this works out just perfect for the prize. We use it with the No-Spill Paint Cups & Brushes Assortment from Amazon.",
    "I bought this as a spare for my embroidery \"Q\" foot for my SE350, SE400, LB6800PRW and Singer XL400 but this foot does not fit them. The distance between the screw mount point and the bottom of the foot is about 1 inch, when it needs to be roughly 1/4\". Do not get this foot if you are going to use it with a SE350, SE400, LB6800PRW or Singer XL400. The quality looks good, and it looks like it would work better than the stock foot if it would fit, but it will not. I finally found the one for other brother machines. Part number XD0474151, and fits the SE400, the LB6800PRW and the PE-770.I recently got a ULT2001, and this foot works great on that machine for free motion and embroidery.",
    "I love these scissors. They're fantastic for wrapping gifts and such. They're lightweight, easy to handle and extremely sharp. They glide through wrapping paper without having to chop your way through like several old-style scissors I've used.I have very large hands and they still fit my hand well. I need to leave my pinky out of the handle, but they're still very controllable to use.One caveat: Given the lightness of the scissors, I don't think they'd stand up to harder use such as heavy cardboard or cloth. They're best suited for office duty and paper craft.I'll probably get a couple more of these to keep in the office.",
    "The result of this \"bubble gum pink\" was to produce an essentially off-white look with a very very soft shade of pink. This is not what I expected from a \"bubble gum pink\". I will only use the product now if I want to start with an off-white look for a base before adding other colors. As an aside, I am a real fan of Jacquard products so I view this color as an anomaly (it happens!).",
    "First of all, It looks fantastic. It's not cheaply made, its durable. You can sew it on or Iron on. It's worth the money for sure!",
    "Per package contains &lt;5% lead - but there's still lead which can cause birth defects. Also it's not good on light weight fabrics as the snaps are pretty robust."
]