[
    "I used this in the seventies and have been fooled before by cheap imitations. This is the real deal, and it still works beautifully as a blusher, contour powder, eyeshadow, and even a lip tint. Color is perfect for me. Love it!",
    "This is my worst purchase every. Feels like i sprayed water on me. No smell at all. Either its really old or it is just pure water.",
    "Well I was so happy when I receive my magic lipstick, but for no reason it broke and only was able to used with careful, because I did not wanted all over my fingers etc. :(",
    "Hair dryer works great.Mounting plate was a little bit tricky to install though / could have a better design.All-in-all, a satisfactory purchase.",
    "Great scent at a great price. Jovan Sex Appeal has been one of my Fall favorites for years, I've received many positive comments about this fragrance.Don't be fooled by the inexpensive price, this is a worthy purchase!",
    "My wife has used this product for years, very satisfied - The discounts are what satisfied me - very happy with transaction",
    "Very good for over the natural nail i use it all the time when i do my daughters nails very shiny as well just dont forget to remove the sticky residue",
    "Mustela Hydra-Bebe Body LotionSilky skin, gentle to baby, and the most scrumptuous scent ever: This lotion goes on quite greasy at first, but use only a small amount for less oiliness. It's a hydrating lotion quite popular in Europe and the Orient. Exceptional gift for those of discerning tastes.",
    "I have tried everything under the sun for gentle frangrance free cleansers, and this is the best so far. No drynes, no redness, no acne! FINALLY A PRODUCT I AM NOT ALLERGIC TO!!!! THANK YOU.",
    "Great mirror at a good price. Makes applying makeup so much easier. Love the side mirrors and it is great for traveling.",
    "Exactly as described and great communications (even know delay was on Canada side and had nothing to do with him). Outstanding service.",
    "I have used three of these. The first two each lasted a year before shorting out. I kept buying them because I liked the cordkeeper function. This last one, though, shorted out and started a fire. I have notified the company and will see what happens. But I doubt that I will purchase another. It's obvious that this product has an engineering or manufacturing flaw and should be pulled off the market.",
    "Gave flat iron to my grand-daughter for Christmas. She likes it very much and uses it daily so it was a good choice.",
    "This is an excellent product. Good vendor. This product arrived on time and is as advertised, and at a good price.",
    "This is the first time I've tried the Biolage color care product. I love it, my hair is so smooth and healthy feeling.",
    "This was my time switching to an organic deodorant; I was pleasantly surprised for about the 1st week ...but now I realize that clearly had more to do w/ nice weather than the deodorant. I'm nearing the end of the stick and have been disgusted by my own B.O. for a least a month. After I shower I apply once or twice a day; if I'm understand the sun the funk kicks in/if I'm reapplying, it kinda masks odor for about 30 minutes. I'm in LA, it gets hot; sometimes I bike, sometimes I'm just walkin to the corner store, either way I come home reeking. I am woman, my body doesn't perspire a lot, most of my sweat come out from my head. My pits end up smelling better when I don't use any deodorant at all (instead of Jason's)!",
    "I thought I was crazy when my skin had a reaction. Luckily I found these one-star reviews from other people. DO NOT USE IF YOU HAVE SENSITIVE SKIN!!!!!!!!!",
    "I bought this at Amazon because of the price. The toothpaste is the greatest. My gums are the best they have ever been and even my dentist says so.",
    "I love Penny Lane. Oh my I love it. I'm fair skinned and I put this on my apples and orgasm on my cheek bones (round face, so I have both). LOVE.",
    "I like that you can see through the bag, and it's nicer than the clear plastic bags you normally would find. I use it to keep medications organized and easy to locate within a large tote. It is attractive, and is of a nice, solid construction. Worth the price (~$8).",
    "This is a very gentle yet effective way to exfoliate skin with absolutely no damaging abrasiveness.The consistency of the product is grainy rather than heavy with hard granules. Some other exfoliators have been simply too harsh, so that when I rub for the stated amount of time it almost feels like I'm rubbing pebbles into my skin.Micro is the operative word here - it soothes and smooths at the same time",
    "I actually purchased this because I needed a soft towel to dry my 12 pound dog with after bathing him. This microfiber towel absorbs water very well. It i soft and thin and when I use it to dry my dog it absorbs water from his wet hair much faster than a regular towel. The towel also dries out well and doesnt have a weird smell that regular towels get after getting wet and drying. As far as using this towel as a hair towel and not for a dog, I think it would work well for the majority of hair lengths and thicknesses. It is smaller than a regular towel so Im not sure how well you could do the wrap, twist, and throw on top of your head towel thing with your hair, but if you need a towel to help assist in drying out your hair quickly, this will do a good job.",
    "This lotion is made in the USA and the texture and smell is completely different from the French version. It is thick and smells like sunscreen lotion.",
    "Got this for my mom. She'd been looking for one of these for a while and was very happy with the product.",
    "I have very thick dreadlocks and I can just manage to twist my hair up into a chignon with this clip. Totally worth the money, though if you can find it on sale, even better.",
    "I was getting this from a local store and loved it. I am allergic to so much and this never irritates my skin and the smell is so calming I love it.",
    "I found this perfume about 7 or 8 years ago. It smells very good. The price was very resonable. I've given this as a gift and each person that I've given it to loves it. I wish there was a body cream to match it. Wonderfule fragrance.",
    "Creamy, long lasting lipstick that feels great on. I am surprised by the quality. What is a plus about these is that they are not greasy or slippery. They have no bad taste which is very important to me and even after drinking from a can, my lips still feel very moisturized and my lipstick still looks good.I am very happy with these colors. I tried them out at Ulta. I wanted to like Cinnabar, but it just didn't do right with my skin tone and was just a tiny bit on the orange side on me, anyway (The screen colors are way off). Some spicy colors will do that, so it's best to try before you buy. Mauve Quartz is a toned down neutral pink on me. It is very natural looking and an everyday, casual color. It is a nice color to brighten my look on those days when I don't want to wear makeup. Moonlit Pearl is a little deeper pink brown, but doesn't go on bright. The brown tones it down and it would go better with a made up face. Another pretty color is Iced Topaz. I held off on buying it for now because it is a bit frosty and I have a similar color that is not quite as frosty from Revlon called Caramel Glace. Revlon and Maybelleine's baseline lipsticks are excellent and for less than five dollars at Walmart, there are some good alternatives. But, Pur Minerals has a very good lipstick at a decent price, and with shea butter as the second ingredient you really can't beat the quality at that good of a price.I recently purchased Black Amethyst after seeing it on a tutorial online. It looks very dark and deep. For some reason, it looks more like a cherry red on me leaning towards fuchsia. A little disappointed. I'm not sure if i can return it or not.",
    "This shampoo has a very nice and light perfume smell and works wonders for dry hair or color treated hair. I tried Cutler products at the Gansvoort Hotel in South Beach Florida while staying as a guest and after a couple of days I notice my hair was softer and less dry. It lathers just alittle, not like commercial shampoos that lathers way too much and drys out the hair. The conditioner is one of the best I have ever used, and I used many of the top brands that sell at the salons. I like the Cutler extra gentle shampoo and the intensive conditioner for my color treated hair the most relative to other salon products within the same price range. I do think it is pricey for 8oz's of shampoo but I also use less to clean my hair. Definitely, it is worth giving these Cutler shampoos and conditioner a try if you're looking for softer and clean feeling hair.",
    "I purchased it on amazon to save me a trip to the BE store and it also cost me less! Thanks!",
    "My first encounter with this fragrance was in the lotion form, given to me by my grandmother. At first, I thought it was too much for me. However, years later I caught a whiff of it and decided to try it out. I went into Sephora and spritzed some on. Later that evening, I asked my boyfriend to tell me what he thought. Needless to say, rave reviews! A few little sprays lasted the whole day. Since purchasing and wearing it daily, I get compliments from anyone who is within smelling distance (usually in a hug, and both men and women!). It makes me feel classy and sophisticated, without being overly musky. Lasts a long time and I rarely need touch ups (though I usually have a small bottle in my purse). It depends on your own body chemistry, so I recommend trying it on your skin first. I think this is definitely a long term scent for me, one that makes me feel more mature (as opposed to the fruitier scents I wore in my late teens/early 20's) and worth every cent! I found it at a local Burlington Coat Factory for about the same price here, for 1.7oz. Glad I can still find it cheaper than in some of the other stores!",
    "My ex used to wear this cologne all the time, and it was perfect on him. When he told me he wasn't able to find it at the dept. stores, I looked online and ordered some. It still suits him, but I do wonder if the formula has been changed somehow since Liz died; it didn't smell quite the way I remembered. It's not bad, just not quite as good.",
    "I live in a dorm and don't have a lot of time or room to get my hair looking great. My hair is brittle from ironing it everyday and people tell me to chop all of my hair off , but i refuse. I've tried a lot of things like sunsilk TLC, night serum by freida, ect.... I figured a dollar something wouldn't hurt so i bought this at my local walgreens. I put it on after shampooing and blow dried my hair all over the place. I was expecting it to get frizzy and puffy but it was straight and shiny. I'm never buying conditioner again.",
    "Been through several duty free shops in airports and while browsing through the ladies fragrances, this one is truly the strongest and most appealing. The scent even lasted quite long on the paper strip samples. Just to be clear, the Perfume version is very strong and powerful while the Eau De toilette version is lighter, go with the latter.",
    "I bought this as a replacement for my Jason 25000U Vit E cream, and was very pleasantly surprised. The smell can be strong at first, but it fades quickly and I find it very fresh, reminiscent of cucumbers. The cream is full bodied, but soaks into my skin well rather than staying on the surface as a greasy coating like so many other creams do. I've only been using it a few days, but my skin doesn't feel tight or dry anymore and my fine lines are starting to plump in again. Great product!",
    "So if you read the label, it says that it's scientifically proven to reduce 99.9% of bacteria in less than one minute. Well that's the trick. I've been using the Murad kit for about a year now and when I first started I didn't think it did much. I read somewhere that you should rub it into your skin for at least a minute so I tried that and wow, HUGE difference! I'm not kidding. If this hasn't worked for you, try rubbing it on your face focusing on the problem areas for at least a minute. You should feel a tingling sensation. That's when you know it's working. Give it about a week or two and you should see dramatic results. I'm not going to lie and say that I haven't had a pimple since using it, but it is so much more under control and I don't consistently have to wear make-up to hide it.Also another tip, if this kit made you break out even more then try skipping the exfoliating gel. My boyfriend tried this kit and the gel made him break out. Taking that out made a huge difference.",
    "The sponge is high quality. It is tightly packed and doesn't come undone after a couple of weeks like most body sponges. It is about the size of a grapefruit. But I will take quality over size any day.",
    "I was very pleased with the Revlon straightener. Being my first straightener, I was very skeptical. I wanted a good one, but I didn't want to spend a lot of money. I am very pleased with this product. I have very Thick Frizzy Curly Hair and this product worked great for me. I keep the temp. at around 15 and I use a product called Motions (hair lotion) to help keep my hair straight all day. I haven't had any problems with my hair becoming frizzy. This product is easy to use and is great for beginners.",
    "We bought this product, and kind of wish we hadn't. The light is not very helpful for my husband - we are going to install a light in the ceiling fan, and think it will be much better. Also, the battery that it came with didn't work....it just isn't a great product - I would rather pay more for something that works.",
    "It has a sweet and spicy scent to it. It took some getting use to, but I really don't wear it that much.",
    "I will say this, it definetly made my hair thicker and stronger. a lot less hair was coming out when i picked it",
    "I was told takes awhile help hair grow in .........been using it few months no change. Dont order number 3 it is for color treated hair it has pppermint fragrance to it and burns your eyes while in shower and still after rinsed off . .......burns my eyes",
    "So beautiful and delicate. These soaps smell fantastic. I'm buying some for everyone I know.",
    "I thought this might work, but was mistaken!!!! I did just as it said and I have no difference in the stretch marks on my thighs. Save your time and money and don't buy this stuff!!!! It would have 0 stars but Amazon doesn't allow that :>",
    "Great original product at a very competitive price. However in the shop it is labeled as Cineama by YSL and Donna Karan for some reason.It is the original Yves Saint Laurent product! Great DEAL!",
    "I'm a great believer in Olay products (my mother's been using them for over 30 years) so when I saw an extra dry skin lotion by this company, I bought it. I didn't realize that it would smell so strong.I'm afraid that most artificial scents give me headaches. I have to stay away from most perfumes, air fresheners, scented candles, potporri, etc, because it triggers migraine headaches. So if you're like me, you'll want to avoid this. Even my husband, who isn't bothered by most strong scents, couldn't stand the smell of this lotion. I now only use it on my very dry feet, and then I have to wash my hands right afterwards.Also, the lotion is quite sparkly, and I'm not a person who wears glitter. (Never did, and I'm a child of the 80s!) If I'd known that this product was so strong-smelling and glittery, I'd never have bought it.That being said, it is a very good moisturizer. If strong scents and glitter don't bother you, then you'll probably like this. Otherwise, I'd recommend \"Udder Cream\". It's very good from really dry skin and is unscented and unsparkly.",
    "I found that this product was great for my cuticles. I couldn't tell about my nails, because it was such a nuisance to get the product out of its miniscule tube that I couldn't readily use it as often as recommended, and I am convinced that one quarter of the stuff remains inaccessible deep in the tube, despite all my efforts to squeeze it out. I would like to see this product in a one or two ounce size; otherwise I fear it is quite overpriced, given how much of it I can't get to!",
    "I absolutely love the fresh fragrance of Lacoste! I'm very picky when it comes to perfume, but this is just the BEST!",
    "This has been my pefurme for at least 10 years. It's the only scent that I will wear. I receive compliments all the time from both women and men.When I find this being sold at a excellent price it will purchase at least three. I've bought it at low as $15 (online - Amazon) , and have paid as high as $60 (canal st. NYC -prior to online search engines) and seen it on Neiman Marcus website for well over $100.I know reviewers had problems with the nozzle and had to actually remove it in order to get the perfume out. Sometimes my nozzle sticks a bit but I'm still able to get some perfume out. Other days it works perfect.",
    "Updated--I completely changed my mind, this is the best leave-in conditioner I've ever used. I'm not sure why, but I gave this product another try and it worked wonders. I think maybe I just got a bad or expired bottle last time. It conditions my hair like no other and it doesn't flake or leave residue like other leave-ins.Old Review--I have curly/wavy/frizzy hair and I was looking for a conditioner that would work well with keeping my hair healthy. I used this product for about two months and I wasn't impressed. The scent didn't smell so good, but I didn't really care so much because the scent didn't last long after blow-drying and straightening.It did a good job of moisturizing my hair, however my main complaint about the product overall is that it would make my hair too oily and irritate my scalp the 2nd day. (I wash my hair every other day.) I've never had this problem with any other conditioners I used in the past, so I didn't really know how to deal with it. I tried using less of the conditioner and just concentrating on my ends, but this didn't seem to help at all. I finally gave up and stopped using the product altogether. One positive thing about the conditioner is that it didn't make my hair hard at all like most other conditioners do to curly hair.",
    "These are just the right size for the smaller toes. I am using them all the time for my Mortons Neuroma. I am very appreciative that I got them. They were not the way I expected them to be, but they are very helpful.",
    "This was my all time favorite for a number of years. I just loved it. Unfortunately, my mother in law also loved it and bought her own recently. Seeing as I definitely DO NOT want to be smelling like my MOL, I am seraching for a new fragrance. That's ok, it was time to change it so I'm up for that. Does anyone suggest a modern version of this?",
    "This is by far one of my favorite perfumes! Such a great price too! I was always jealous because a co-worker of mine would always wear this and finally i broke down a bought some! I never regretted it too! It just a wonderful smell that draws you in!",
    "A little goes a long way.These drops add a dramatic amotunt of shine without making my hair greasy.Please continue to make them.",
    "This hot roller set is dual voltage. It is good for traveling outside the US. The issue is that it is only 85 watts so it takes very very long time to get ready for the job. (Conair has two or three other roller sets with 580 watts or more--the one with 580 watts heat up and ready for use in two minutes!! And it is only $9 more). This set does warm up with 90 seconds as advertised but it is not hot enough. I waited for about 30-40 minutes before I used it. The clips that come with this unit do not work so I bought jumbo clips separately. If you don't need a dual voltage, buy a stronger watts unit for faster heat.BTW, 12 rolls are not enough for thick hair. The rolls size are a bit too small for big curl results. I spent about an hour to set my hair with this unit. But, the process would be cut by half, if I had have used a strong watts unit. I need a dual voltage set so I don't have many choices.Update.....a month later...Now I use it in Thailand. I am very surprised to learn that this unit heat up within 10 minutes!!!! With more experience, I can do my hair to look professional in less than 30 minutes. Everyone said, the curl looks natural and look like I walk out from the salon. I would recommend this product to all travelers.PS: I am not sure whether this product damages my hair. But I guess all products with high heat will eventually damage hair.",
    "I thought it had been definitely discontinued! I used to wear it too and it's fantastic. Well, I suppose it's better this way but WHY NOT THE WHOLE YEAR?",
    "What I ordered and what I received were two different products. I ordered Biosilk Finishing Spray Firm Hold - Hair Spray and received CHI Flex Hold Firm Hold Hair Spray. I chose not to return the product received because I thought I might as well try it, the price paid ended up a great sale for the amount of hair spray in the can. The CHI Flex Hold Hair Spray does not hold the hair style for as long a period of time as the Biosilk Firm Hold. I should have made contact with the seller to see why the product was switched or if the other product was no longer being manufactured. I will still make future purchases from Amazon.com and possibly this seller.",
    "I bought this eyebrow shaper almost 10 years ago and I'm still using it regularly without any problems. I can do a nice job of shaping my eyebrows with it and not have to endure the pain of plucking. The only drawback with it is that you have do more frequent maintenance than you would with plucking but it only takes a few minutes so it's not a big deal.",
    "Also great as a sexy lube. Not so good for your day to day cleansing needs as it may leave your face oily, but for removing make up its the best.",
    "This is a great shampoo/conditioner in one if that's what you need. However, I don't normally use conditioner every time I shampoo. It makes my hair too flat. On the days that I do want to use conditioner, though, it's much easier to use this one product instead of two. It has a pleasant smell and good lather.",
    "I tried this to remove badly dried and caloused skin on my toes and the bottom and back side of my feet. I worked perfectly every time. Uses sanding discs that wear very well and can be replaced. It uses 4 AA batteries instead of 2 and runs at a high speed unless you are foolish enough to force it hard against your skin. Also used it on some tough spots on my fingers, excellent result. Also does nails very easily. Seems to be well made and not cheaply made. Very glad I decided to try it.",
    "would have ginen 5 stars but I think it should have come with a pump. I had to buy one separate.",
    "Bodman Blue MuskI had a woman call me \"the good smelling man\" yesterday. I had this on and theBod Man Fresh Blue Musk 4 oz Deodorant Spraywhich matches it. If you want women to think of you as \"the good smelling man\" maybe you should use it, too, but not too many of you, and then I wouldn't be exceptional anymore,I highly recommend it and use it myself.Gunner August, 2012Update:January, 2013I've had three different women stop and ask me what I waswearing \"It sure smells good!Maybe they were hitting on me , but , even if they were the Bodman gave them the excuse to do so, I'm sold, I even have the matching aeresolBod Man Fresh Blue Musk 4 oz Deodorant SprayTry it, you'll like it.",
    "Happy New Year ! Ringing In 2013 Wouldn't Have Been Complete Without Virgin Hair Fertilizer As A Part Of My Hair Care Regimen . It Has Been 7 Months Since I Started Using Virgin Hair Fertilizer From The First And Same Tube . One Year Ago I Had Restarted My Dreadlocks ( 2 Inches Of Hair ) By Removing 3 Inches Of Chemically Treated Ends . Although My Natural Hair Was Growing Virgin Hair Fertilizer Was The Missing Ingredient Needed To Enhance More Rapid Hair Growth . Seven Months Later ( From June 2012 ) My Dreadlocks Are Now Shoulder Length . Since I Sleep In A Silk Scarf It Is A Relief To Be Able To Pull My Dreadlocks Up Off Of My Neck Of Which They Itched . I Definitely Love The Tingling Sensation That I Feel When I Message Virgin Hair Fertilizer Into My Scalp And Hair . Since I Am Somewhat Of A Health Nut I Consider My Food Intake And My Diet As A Very Important Asset To A Healthy Scalp And Hair . I Would Give Virgin Hair Fertilizer 6 Stars If I Could . I Highly Recommend This Awesome Product !",
    "I have terriable cystic acne. I have tried everything on the market...then I found this toner. WOW...it really works! It has a very strong nail polish remover smell..but it goes away.",
    "I have looked for these things everywhere. I used to buy them from my barber but he quit carrying them. An excellent value.",
    "Skin feels nice and clean after use. I also wash my hair with it and it's great! It's great for cleansing acne prone skin fyi...",
    "I've been using this product for years as a night cream, and it's wonderful. I'm glad it's still available, wouldn't be without it. LT",
    "hard to find item also cheap considering how good it is have not seen this item in awhile lasts forever",
    "This is a great product. Equivalent products sell for 3x as much yet have less potency. It feels great and it SMELLS great. There are like a dozen different oils in it. You essentially rub the salt with the condensed oils on your hands and the end result is extremely soft hands. Awesome ! Finish by rinsing and use lamb cream - and it has given me very good results. Great product. Will be buying it for a long timePierre Kerbage",
    "I love this product. The pricing was fair, and also the product arrived in a timely manner. I will for sure return to Amazon to purchase in the future.",
    "This has been one of my favorite soap brands for a long time but I have never used any shower creams from Roger & Gallet in the past. This was truly worth the splurge since the rich milk is soft and soothing on the skin as very little is needed, it has lasted me twice as long as the matching body lotion and it makes my morning and night bathroom routine a very pleasant experience.This lathers up nicely, not necessarily foaming bubbles but cleansing the skin with softness and care and a scent to rave about. The scent of vanilla sap is more creamy and almost like a sweet version of sandalwood than the usual vanilla bean fragrances everyone is used to. I adore using this since it feels so luxurious and lasts for a long time, making my bathroom cabinet look pretty and my skin silky soft. I highly recommend using it with the Roger & Gallet Vanilla Sap Restructuring Body Lotion for a complete experience.- Kasia S.",
    "My favorite cologne at a really great price. Received it in just a few days. Great vendor and great product.",
    "I've been shaving my head for about 20 years and decided to give this a shot, since I saw it on the store shelf, and had seen a documentary on the company.I'll give them this -- it is fun to use, and for me, it worked surprisingly well. I can't say that its any faster overall than using my trusty Mach 3 or Fusion, but, its nice to use -- just to try something different every once in a while. I still use one of my old workhorses to get around my ears. But going over the top and down the back, it did a good job and was probably does take a little less time in those areas.So all in all, I think its pretty good tool, and a novel invention.",
    "I was disappointed with the product: I was anticipating to buy liquid soap that I could use in my standard soap dispenser. Presumably because it is so thin (much thinner consistency than that of regular liquid soap), it squarts everywhere when you try to pump.",
    "I believe this was a fake perfume. I tried to return but had foolishly thrown away the box. Otherwise I could have.Whose fault I don't know. At least it smells pleasant enough. The vendor was very responsive in trying to resolvethis problem. I just won't use them again. I have enjoyed this fragance for years and do know what it should smell like.",
    "perfect for taking any blonde color out of my white hair. its gentle enough too that you can leave it on for awhile to really let it work.",
    "Eau Du Soir BY Sisley For Women - 3.4 oz EDP SprayI am very concerned that the product I purchased is a fake! I smell too much alcohol in the product and it gives me a headache. The product was wrapped in bubble wrap and did not come in a box as I thought it should. I will not know for sure until I can get to a store that I know carries Eau du Soir and do a comparison. I wanted to wait until I compared my product to one at a department store that carries it but I do not know how soon I can get to the mall so I am submitting my review.If indeed when I sample the product at a retail store and still believe it is not a legitimate product, I will report it.",
    "I bought KMS because I was looking for something to hold and at the same time nurture my hair. It contains olive oil and I read a couple of rave reviews of it, so it is the one I chose. Would I buy it again? Probably not. It doesn't hold the hair as well as sculpting paste does (although that paste does not contain olive oil) and it is easy to apply too much, which is a disaster (makes the hair look weeks' unwashed and then is rather hard to wash out, as well). The reviewer I read was also really favorably impressed by the scent of KMS. Of course our senses are about as subjective as you can get, but I am not so favorably impressed by its scent.I really like the fact that KMS contains olive oil, and I will continue to look for products that nurture hair while doing whatever it is one bought them for.",
    "I have been using this soap and will continue to do so as long as it is available to me. It may seem expensive, but it lasts a long time and it is just wonderful soap on the skin. The fragrances are just right too.",
    "On a recent trip, my carry-on size lotion had spoiled or something gross and my host had this lotion to offer. After a week of use, my skin was less dry and much smoother/softer, so I bought it as soon as I got home. As other reviewers have noted on the larger size, the lotion itself isn't super thick like a body butter would be, but it does not spread as easily as you might expect a lotion of this consistency to spread. However, it does absorb pretty quickly and I find that if I towel off the excess that didn't soak in I get good coverage and a clean feel (plus I've been told you should always towel off excess face and body lotion and I live in the south and its real humid here). Unlike most other lotions I've tried, this lotion keeps my skin moisturized for probably 36-48 hours.This lotion exfoliates!! The alpha hydroxy in this lotion really really really works [for me] for removing that layer of dead cells that makes skin feel rougher and duller. I've noticed my skin feels and looks smoother. Another testament to this power is the apparent popularity of this lotion within the follicular keratosis community. And though I'm a bit shy about it, its helped alleviate some folliculitis on my backside. So if you have problems with ingrown hairs or have folliculitis from excess dead skin cells (for me manual exfoliation just has never seemed to cut it), this lotion is a really good option. The bottle notes that its a good lotion for dry skin associated with diabetes, but I can't speak to that.Also, it doesn't have much of a scent at all.If you were concerned, this is the same as the larger item (http://www.amazon.com/Eucerin-Lotion-Intensive-16-9-Ounce-Bottles/dp/B001FB5IRS/ref=pd_sim_sbs_bt_1). Both sizes have recently changed their packaging, but the lotion is the same.TLDR: long-lasting, unscented, really really helps exfoliate skin, prevents folliculitis and ingrown hairs",
    "Some may be confused by my rating for this product, but let me explain... After reading all the reviews for this product, I was so excited that I finally found something that would get my 3 year old son to stop sucking his finger. As suggested, we started with a small application on just the thumb area. I didn't want to experience any extreme adverse reactions (i.e vomiting). He stated that it wasn't \"tasty\" and pretty much kept it out of his mouth the entire time for that day. Later that evening when it was time for bed, he went to sleep with his thumb in his mouth as usual. The next day, we applied more but this time on a larger surface area of his thumb. He proceeded to wash it off but we kept him from doing so. Apparently, my son's taste buds wasn't too altered from this product because he sucked his thumb anyway inspite of a heavier application.Here is the reason for my 5-star rating: the taste is horrific! It is the worst, most bitter thing I have ever tasted. It's almost like a combination of crushed aspirin and bitter leaves or herbs. Additionally it leaves a horrible lingering taste on your tongue and lips that goes away on its time no matter how much you try and flush it with water. As one of the reviewers stated, it contaminates everything you plan to eat if you by chance use that finger to touch food. It doesn't take much at all...one slight touch and your food is ruined. Not to be gross, I even tested out the product by tasting my son's finger to see what he was experiencing (and yes, even his saliva)and it was AWFUL! I couldn't believe that it didn't phase him. I guess his thumb means that much to him. I believe this product would work if my son way younger - maybe. He's that individual who is not phased by the bitterness. I was hoping to have a different outcome to post. But I have to speak up for this product; I believe it could work if your child has a very sensitive palette. Unfortunately, this wasn't the case for my child, but I am hopeful that something will work...even if it's just time itself.",
    "Have had curly hair all my life (loose curls) and would see ladies on tv with nice flowing smooth hair and think why didnt God bless me with that kind of hair, used a straightener before and my hair was like straw. Thought will try this one time on sides and back that way if falls out will have some on top, seriously. This was so quick(but very messy) so have some plastic for under your chair. I love the way it came out nice and straight, for the first time in my life I love my hair, hear you can buy this at Walmart but got it cheaper here. Laid down, slept on it and got up it looked the same. I read the review where the one person said chunks fell out but I process my hair, do the roots once a month so I would just say don't leave in overtime. And I have nothing to do with these sellers.",
    "I started using this gel as soon as I came home from the hospital from giving birth to our second baby. I am now 5 weeks postpartum and my skin is almost back to normal! Definitely recommend it. With my first pregnancy it took about 3 months for the skin to go back to tight but this time around I used this gel and it does just what its says it will!!!",
    "I was skeptical of buying this for my daughter but since it arrived, I only had to use it one time on her and she has never sucked her thumb or even her fingers since. (That was back in Nov. and its Dec. now.) Unfortunately now Im stuck with a full bottle of it but the best thing, I dont have to worry about her continuing with such a nasty habit.I HIGHLY recommend this product!!!!",
    "After years of perms on my hair I wanted it to be straight again. I have thin hair but to style my hair isn't easy(especially if there's humidity). Since I'm on a budget,I read some reviews and bought this one at a good price. I like the swivel cord, it's long too, I like the lock it has to close it when not using it, and it heats up pretty fast. I am impatient when it comes to my hair but using this makes it easy for me. After blowdrying my hair I put a little bit of Redken outshine 01, spray a little TreSemme heat tamer, and start sectioning my hair to straighten it. I rated it four stars because my friend had a 1\" flat iron from HAI that I loved but couldn't afford it so this one is close enough!",
    "These headbands, labeled \"no headache\" have to be the most uncomfortable headbands I've ever worn! Between the tight sides, and the tiger teeth around the curve, your head will be pounding within a half hour. Wouldn't recommend even for my worst enemy!! Maybe if one has real thick hair the \"tiger teeth\" wouldn't be so \"biting\" but I can't see how anyone wouldn't get a headache for the tight sides, as I have a small head so if anything, this would be looser on me than the average female.",
    "I bought this for the wife who didn't want me to spend the money. Once she used it she was glad I did and she really likes it. It is incredibly quiet on the low setting. You can have a normal conversation it is so quiet. Easy to use and dries your hair reasonably quick. I also noticed the statement about the warranty being voided if not purchased from a hair salon. I hope I don't have to find out but I would think that is not legal to do. If they sell it to Amazon to resell then they should be required to honor the standard warranty. Whatever it is a great dryer that is quieter and should help prevent hearing loss. Definitely much cheaper than a high tech hearing aid. I am planning on buying two more for birthday presents for the daughters.",
    "If you're a fan of any of the Kai products, you will need to add this to your morning ritual. It feels so silky smooth on the skin and the fragrance is fabulous. A must have.",
    "I have not used this product, as yet, but it seems to be \"as advertised\" and will effectively protect ties during travel.",
    "I recieved this as a gift when my son was born..It was his first cologne...I would spray it on my hands and rub on his clothes. As he got older he wouldn't leave the house without a spritz of his cologne, like Daddy :} I now have a Grandson and purchased it for him...he always smells sooo sweet! Lots of compliments...",
    "As we all know, washing our favorite canine friend can be a challenge at times as they don't always cooperate. For years I have been using products that I could find at my local pet shop and they have all been liquid shampoo allegedly formulated for a \"dog's sensitive skin\". The problem is that it takes a lot of shampoo and associated effort to get all the parts properly cleansed. On the one hand, my dog, a mini schnauzer, keeps moving so the shampoo I have just squeezed out onto my palm and am desperately trying to distribute to his chest or rear leg is dripping and even when I get it where it needs to be it never seems to be enough. I find myself using a lot of liquid shampoo to do the job and the constant need to pick up the bottle or pump more onto my hand gives my pooch an opportunity to try to get away from me further complicating the task. In the end, I use a lot of shampoo to get this relative small, long haired dog clean. Another issue for me is the smell of dog shampoo as most of them are overly scented and artificial smelling.I had often wished that I could find a bar of soap specially formulated for a canine that is not overly scented and leaves their coat nice and shiny. Well, this soap does it and does it well. When using a bar of soap there is no need to keep going back to the bottle to get more as you have all you need right in your hand. Washing the dog with this product takes a lot less time and it rinses out completely with ease. I can get my dog washed in just a few minutes and as I always have one hand on the dog, he is easier to control and more cooperative.I first wet him down completely avoiding his head but getting every part of his body nice and wet. Then I take the bar of soap in my hand and get every part nicely lathered up which is easier with the source of soap firmly in your hand. I then rinse his entire body and then wet his head as that is the part he really doesn't like. I then soap up his beard/muzzle, neck and head avoiding his eyes and quickly rinse him off with a hand held sprayer protecting his nose from direct contact with the water. After one final rinse of his body he is wrapped in a large towel and happily rubs his face and body into it drying himself off. The smell of the soap is wonderful and mild with a hint of cinnamon and sage and it leaves his fur nice and shiny. Fortunately, it does not irritate his skin or cause flaking or itching so all in all, we are both happy with the product.So why only four stars? It is a rather small bar (only 3 oz) for the price and doesn't last too long, so you should buy a few at a time. Once you have tried it you will never go back to liquid shampoo again.",
    "I love this product, it really work. I have had 4 knee surgery. It really helps with the swelling. Can you tell me why store have stop carrying this product. I have to order it by internet and I'm being told that this pruduct will no longer be carried.",
    "I do like this smell alot but when i sprayed it i noticed how very strong it was so i sprayed myself before i went to sleep and it lasted the whole next day! but its a very sweet marshmallow/sugar smell but alot stronger than i expected",
    "Best moisterizer I've found so far. I've tried several brands for my dry aging skin but this hydrating cream really makes my skin feel better.",
    "Prevage seems to have erased some of the finer lines that I had, and has softened some of the deeper ones. I'm pretty happy with it so far, have not had any side effects.",
    "This is a terrific night cream.The container is wide mouth and allows for easy application. The smell is simply lovely. Texture is non-greasy & smooth. But most importantly-it works well. Apply this, and within 5-10 minutes, it is fully absorbed. I am so tired of using night creams and having to lie on my back till they absorb. As a side sleeper/reader, I get awfully tired of spending money on cream just to slick up the pillow-case. With this marvelous cream, it absorbs readily into your face, not onto your pillow.I noticed a significant improvement almost immediately in my skin with this night cream. It is gentle, hypoallergenic, and just simply great overall.Well done, Olay! The price is much better than others and performs better, too. This is the cream that won the coveted #1 spot against LaPrairie, etc., etc......",
    "Best hair mask yet! I'm an Asian with naturally thin, super straight hair. After years of both coloring and perming, my hair is now extremely dry, tangled and brittle with nasty split ends. Every time I use this, immediately that day I get compliments on my hair and how soft and beautiful it looks, but if I don't use it, let's just say my hair doesn't look healthy. I'm tempted to start using this mask every day except that I'm concerned it would weigh my hair down too much!",
    "My daughter and I both have long hair. During the rush of the morning, this towel does help to cut the drying time. It wraps easy and stays on your head leaving you to do other things.",
    "I have very dry hands, feet, elbows...well, let's just say, I have very dry skin, and I am always on the search for creams that do the job, are not greasy, and smell great. This one is all three. My ONLY complaint is that it is hard to find! If you see it, grab 3 or 4 tubes!",
    "I am going on my 4th bottle of Nourishing Lavender Milk. I use it everyday on my arms. I have dry skin that is very sensitive. This lotion feels good, smells good, and I like the glass container. I just wish it was a bit more affordable. I would use it on my legs, too, if it was priced more competitively with other lotions.",
    "I like this cleanser as I use a lot of products with glycolic acid. I use it as a body cleanser. Don't be scared to use this. It's very mild for those that are used to products containing glycolic acid. For those that are new to this, alternate it with your usual body cleanser to get used to it.After using this regularly along with my glycolic lotion and vit E lotion, I'm left with smooth and more even toned skin. My only wish is that it had a higher percentage of glycolic acid. Even though it's not made for the face I have used it on my face at the most two times a week as I didn't want to irritate my skin. Overall, this is a great product for those that want clear and smooth skin.",
    "I always used a quality conditioner on my long curly hair but this one is the best of all !It untangles without weighing down my hair and it is very soft and full of health ! (No need to put a lot)I love it and I recommend it !Also, delivery was very fast and earlier than planned.",
    "The mirror looked fine but the light switch wouldn't even turn on.Very disappointed as this was sent as a birthday gift and had to be returned. I would not try this brand again - it didn't even rate 1 star. The only good part of the whole deal was Amazon's painless return policy and process.",
    "I love these hair towels! I've used Aquis for years and really like this waffle design. This one seems a bit larger than I've purchased in the past and I have a lot of hair so appreciate that!",
    "I love Dove Conditioner. It leaves my hair feeling smooth and soft, but not weighed down. The Cucumber & Tea scent is very pleasant, and does not have a strong perfume smell. There is no \"Cool\" sensation, for anyone who is wondering. If you like Dove conditioner and like the softer scent of cucumber, you'll love this conditioner!",
    "IF it's real, then this perfume is wonderful. But at such a cheap price, I doubt the quality of the product. Either fake or expired, you gotta be careful.",
    "I have not only become a believer in the Algemarin Dry Shampoo I tell EVERYONE about it. I have now convinced a majority of my friends and family that this product is a MUST HAVE.It is perfect for those mornings where time is something you don't have & 5 minutes is all that separates you on your way out the door. A quick few sprays of the Dry Shampoo, a quick comb through the hair & Poof.....Magic!My hair sometimes looks better the day I use the Algemarin Dry Shampoo vs. the day it is freshly washed! Do yourself a favor & buy this product. I seriously cannot rave enough about it. I should consider buying stock in their company...that's how much I LOVE it.",
    "i love this product but good luck finding it. it has been discontinued, i believe because Cholorox bought out Burts and this was one of the casualties. either way i enjoy it.",
    "Absolutely horrible product! Messy can't even begin to describe what you'll have. Product does take longer to warm than on instructions and the paddle is useless. Eyebrow guides aren't worth the paper they're on, and upon attempting to use, this went right into the trash. Don't waste your money!",
    "My dad has been using this cologne for as long as I can remember apparently he really likes it because he religiously gets a refill. I decided to buy this for him for father's day and the shipping was so fast it was awesome!",
    "I put this stuff on my Panther Tattoo, made it look like a Salamander. What's Yer Problem? Whatever.",
    "The form of presentation of theproduct is not shown in the pictureThe fragrance it is exquisite and it is smells very masculine.The package of delivery it is ideal size.My rating is four stars is:1-Product Quality2-Shipping costs.3-Time Delivery.Thanks.",
    "I could not find this in the stores and I really love the fragrance !!! THANKS",
    "Duck tape projects. They are perfect for her to create whatever designs she wants. I had fun doing it with her.",
    "This is wonderful massage oil or just for every day use on especially dry winter skin. My skin soaks it right in and it does not ever feel greasy.",
    "Having used Olay Regenerist Regenerating Lotion with UV Protection before, I was looking for a source less expensive than local drug stores. This fluid helps smooth fine wrinkles and moisturizes my skin, especially after prolonged exposure to the elements or to the dryness of indoor environments during the winter. The UV protection is an added bonus, for it helps protect my Celtic complexion from sun damage which has, in the past, led to actinic keratoses on my face and arms. The fluid is well absorbed without being sticky and has no strong after-scent of perfume. Cost on Amazon was considerably less than I paid for it in the past at a chain pharmacy known for low prices. Ordering was simple and well co-ordinated. The purchase was shipped promptly and received within the designated time frame--fully intact and ready to use.",
    "It does the job. The product quality is great but the lids do not stay screwed on tightly as others. Its compact and great for traveling or carrying it for everyday. The bad thing is that for the largest case, i placed my power foundation and its a bit too small for that. i use the lid to spread the foundation and the powder gets stuck in between the screw lines and causes the container to become loose. One of the lids with a clear top, the clear part came off. now there's the use of the lid.",
    "This oil is the miracle hair growth. IMO, it doesn't smell as bad as some reviews state. I saw growth in less than 2 weeks. This is a staple and I'm a customer for life!!!!!!!!! Please do not discontinue",
    "The mascara seemed to be somewhat dry and hard to apply...did not coat the eyelashes as expected. I have to say I was disappointed in this product.",
    "Very effective to clear up dry scalp. I use every couple of days and that seems to do the trick.",
    "So far this has been the best straightener that I have ever used. It heats up fast and you only have to run it through your har one time. I can now straighten my hair in just minutes. It gets extra hot. You have a power on button and a turbo power on button and with that it gets turbo hot! The removeable comb in awesome!! I love to use it because it saves time without being annoying like some products with extra features. It is easy to remove by sliding out but stays in place when put back on, it is also easy to put back on. This has been the hottest straightener that I have ever used. I love Conair styling products. I have no bad things to say about this wonderful product. The only thing that can be a small con is that sometimes I have to hit the power on button 2-3 times to get it to turn on, which is easy to tell because the light comes right on. Other then that, this item is simple to use and works very well and heats up wonderfully which saves time. The Amazon price is about $5 bucks less then Walmart's price where I got mine and this straightener was money well spent. It cost a little less then straighteners that do not work as well. Conair products are known to work great and last a long time!! With the removeable comb and all the features this deserves 5 STARS! Usually you will get a straightener that does not have the removeable comb or turbo on putton and there are also 25 heat settings, it is simple to use and works great!",
    "My hair is very thick, Curly &amp; Frizzy. When I use this curling brush on my hair it makes my hair smooth, soft and light. It is the only curling iron I have ever used that made my hair feel like that. After using it my hair is straight with body. It does a great job. The only one downside I can think of is that if your hair is extreamly thick it may take a little time to &quot;dry&quot; it totally. Over all I highly recommend this product to anyone...",
    "This is an exceptional tool and very easy to use. My first curling iron was in use for more than 15 years. This is my second purchase and I am very happy with the curling iron.",
    "I have been a hairstylist for over 25 years, and this is, BY FAR, the best curling iron I have ever owned!! It delivers long lasting results. It has adjustable heat settings and is wonderful. I use it frequently in the salon to get the great soft curls that everyone loves. It heats up super fast and the heat is distributed throughout the iron pretty evenly. I call it my secret weapon. My clients love to come in for special occasions just so I can give them the soft pretty curls that are so in style right now. Do not hesitate to by this one. It is a winner for sure!!!",
    "As a person with very sensitive skin I thought I couldn't wear make-up until I found Bare Escentuals. I wear this absolutely every day and love that they have diversified their shades a bit. This is a perfect match for my slightly pale and rosey skin tone.",
    "This oil is very lightly scented and does a great job at softening skin. I have bought a few oils lately and this one has the advantage of a bit larger container. I like the value of getting more for my money. Thanks amazon!",
    "I started using Denorex Therapeutic when I could no longer get X-SebT. I've been using Denorex several years now. It controls my itching and dandruff very well. Its smell is little intense, but if that is enough to prevent you from using it, then I'm guessing you don't need it. I'd use if it even smelled a LOT worse. Besides, the smell is gone after you rinse your hair.",
    "Unfortunately, this product did nothing to make it easier to brush my daughter's hair. It was supposed to make it softer, but it actually made it harder to brush. I really wanted this to work because as my daughter's hair grows, it gets more difficult to brush. Wish the result would have been different. :(",
    "this is an excellent hair product. I have curly hair so it tends do dry a lot, but since I found this product it's been very moisturized and without frizz.",
    "I bought this one for my dad. The color looks real black and natural. You may notice that the color is changing to dark brown side a little bit after two months. But, unless you use it more frequently, it won't be a problem.",
    "..the hunt is over. This is without a doubt, hands down, my all time favorite fragrance. Literally gives me a burst of sheer JOY when I spray it on myself. Its light, summery, crisp, clean, and reminds me of being on top of a windswept Italian Villa....breathing in fresh air. It's very versatile: I love that I can wear it out for a night on the town, or just spray it on in the morning to hang with my kids, go shopping, or even walk the dog! I have the perfume, the cologne, the lotions, the gel.....its lemony-soft and light and I can't recommend it enough. SIX stars!!",
    "Smells delicious! I love it! I was surprised to see that the lotion was brown, but I guess that makes sense because it has Chai in it. But when you rub it in it's clear. I have sensitive skin and this doesn't make me itch like some other lotions.",
    "I have used Ahava moisturizer for 15 years. My skin is soft, smooth and younger-looking. It is meant for facial treatment, but feels great on any dry spot, hands, knees, elbows, feet, etc. Ahava has a clean, fresh smell, and, as advertised, leaves no greasy residue. I have not found a moisturer I like as well, including the expensive-selling and/or well-advertised brands.",
    "I recieved this product before the estimated delevery date and they were right one with the discription. I also recieved some \"Ribbon\" (such as breast cancer/autisim, cervical cancer ribbons) stickers which I love! I will buy again from this seller.Thank you!",
    "I am a big fan of peppermint and I almost fainted when my boyfriend gave this gift pack to me for our seven month aniversary. It is the most pleasant, yet effective way to wake up in the morning and stay cool in the central valley of California. Everyone should try it.",
    "I tried the mascara and it made my eyes burn, so I had to take it off as soon as I put it on. I tried it again a few days later and had the same problem. I really don't have very much of a report to make on the product. Some products seem to do this to me for some reason.",
    "I purchased a set of brushes as a backup for when I clean the first set I got (handi buki, flawless face and full coverage face). These brushes were not the same as the ones I purchased from the Bare Escentuals section at Ulta the week before. The handi buki is smaller, hard and the bristles do shed like made. The other two brushes are also harder and shed a lot in comparison to the brushed purchased in store. None of them apply the product as well as the good ones. It did not apply the foundation nearly as well as the original. It is horrible. I will go to Ulta and purchase a new proper set so I wasted my money here.The name printed on the side of these brushes is id Bare Escentuals. The GOOD brushes bought in store do not have the \"id\" on them. This makes me wonder if these brushes are not genuine?FYI the real BE brushes available at Ulta are fantastic.",
    "I love my flat iron. I have used this product before but the one I had was dropped and the plate broke. So I ordered another one and it arrived faster than I expected and it works great. My co workers will be ordering theirs from you as well.",
    "This is my favorite perfume and I could not find it in stores! I thought it was a lost cause but found it here. Thought it a little expensive until I got the bottle it is HUGE!",
    "Cool Water By Zino Davidoff For Women. Eau De Toilette Spray 3.4 Oz.I love this perfume. It is not to strong and smells fabulous. I have been using this perfume for years and I like that I can purchase this through Amazon. Great pricing, shipping, and delivery.",
    "My nails are slow-growing and brittle. They responded to this product within a week and soon I'll be getting a french manicure to show off my new nails!",
    "This product lives up to its claims. I am 58 years old with normal/oily skin. I have no blemishes or discoloration. My oily t-zone no longer has breakouts. I tend to have enlarged pores that easily get clogged and cause pimples. My pores are visibly smaller giving my skin a firmer look and I don't get pimples anymore. My drier cheek area feels nicely moisturized. One of my favorite things about this product is I feel like I'm getting the same results as many of the expensive department store lines, but at a much better price. I wash my face with Olay Cleanser and during these very cold winter months I also dab on a little Olay Lotion for an extra layer of protection against the elements. That is the total regimen. Simple, easy, good results. The icing on the cake is that I ordered this Auto-Delivery. When the price of the product dropped in the stores Amazon dropped my Auto-Delivery price. If you've ever ordered Auto-Delivery you know that most places will always charge the same price as the initial order, so that was a pleasant surprise.",
    "My family no longer uses another product ever since we discovered Cetaphil. After our toddler was diagnosed with Eczema, we found that Aquaphor was either not doing much good or was really being downright harmful. During one of the desperate night-time itching episodes, I slathered on some Cetaphil Cream instead of Aquaphor. The itching immediately went down. Surprised, I started investigating and found some not so great information about Aquaphor.At least in our case, Cetaphil cream (NOT the lotion - thats too weak)in combination with a heavy moisturizer, worked wonders for our toddlers eczema. The national eczema association also rates it well but not as highly simply because of the presence of almond oil, a potential allergen (Not a problem with our toddler).We first apply Cetaphil cream, wait for it to be absorbed and then apply a film of Theraplex emollient (the one that is thick and waxy and comes in a tub). This was worked miracles for our child. To learn more, you can try looking up my review of Theraplex emollient.",
    "These are great bottles! We have a couple of them now. Nice and sturdy, compact, and the spray is adjustable from \"mist\" to \"squirt\", depending on your need. I use one on our cat: \"mist\" when I'm within 5 feet, or \"squirt\" if I'm further than 10 feet away.For what it's worth: the kids like playing with these, and they make pretty good squirt guns. If you're going to have cleaning chemicals in some, make sure the kids know the rules re: which color bottles get used on stains, and which colors get used on friends.",
    "This is now my favorite Curling Brush. I will order another but maybe smaller than the 1\" if available.",
    "I found this product to be non forgiving. After applying and going outside the product looked like makeup on my legs. I wanted something sutle and natural looking. This product looked like makeujp.",
    "The fragrance is not worth the extra money difference from their other shampoo/bath products. It does not last. All of their scents seem to last just while you are using them.",
    "I am giving this product 4 stars- the product itself deserves 5, but there is a discrepancy with the color that I have seen- with my hair and just looking at \"samples\" on different websites. So tho I whole-heartedly recommend Jerome Russell research that color! Ok, on to the review....I have dyed my hair many times with many of these brands and I know what I am doing- those little things you pick up from a lot trial and error. Jerome Russell is the best product I have ever used. I had no stained pillowcases, great lasting color, and hair that felt great, not like straw, and fingernails that did not look like the dye if you scratched your scalp. That said, I wanted PURPLE hair, and the only remotely purplish color was this, violet. I bleached first of course, tho my hair is light brown, and my hair turned black. And if you looked in the light, you could see a bluish purple sheen. Mostly bluish tho. This is disappointing to me, but at the same time it really complimented my looks, my complexion etc. After some weeks and there was very slight fade, the bluish purple was more pronounced. That is another thing, with cool water and shampoo/conditioner for color treated hair, it looks even more vibrant than the day I colored it. I am already putting an order in for 3 more colors from Jerome Russell.",
    "I'm a white girl with medium-bodied curly hair (3B) and as a recent convert to the Curly Girl method, I was tasked to find natural products without silicones that held my problematic curls in July in Kentucky. Yeah right. I ordered the hair butter along withCarol's Daughter Mimosa Hair Honey, 8 oz.and I just want to sing from the rooftops how pleased I am. I used about a quarter-sized dollop, as well as a tiny bit of the hair honey, after wringing my hair out post-shower and I let my hair air dry as normal. Holy cow, my hair is awesome!! It's soft, shiny (neither of which happen often) and the curls are tighter and lighter than I've ever known. This product is probably not best for those with fine or straight hair, and the scent is strong and could be off-putting to some (though I love earthy scents and I loved the smell of this). Next time I'll probably use a little less of both only because they're a bit expensive for my college student budget. You really don't need much of this product at all--my hair is at my bra strap and is thick and full and I hardly had to use any. Can't wait until myGiovanni Hair Care - Styling L.A. Natural Gel, 8.5 fl oz gelarrives so I can have beautiful, natural curls on lock all summer long!",
    "I have an autoimmune disorder that makes the skin on my palms very , dry, and they peel and sometimes bleed. I've used L'Occitane Organic Shea, mixed with Aquafor, after perscription ointments and creams didn't help. I've had good success with my existing routine. But the L'Occitane is $39 a can, which is quite pricey, for me. So, when I found this, I was excited to use it. Especially after reading the description. The price is fantastic which is why it got 1 star from me.As for my issues: 1) It stained my gloves, and I got a tiny piece on my nightgown which is stained too. 2) The smell is hideous. It reminds me of terrible baby vomit. 3) After going through all of this, it didn't moisturize my skin nearly as well as the L'Occitane Organic Shea Butter, mixed with Aquafor. I did mix this product with my Aquafor as well.I should say too ,this product is very hard. So you'll need a makeup or other little spatula to use it.",
    "I keep this on my bed table. I like to get in bed at night and put this on my hands and feet.",
    "Overall, I was fairly happy with this product. The foam piece on the bottom part of the curler made it very gentle. I was thrilled that a replacement foam piece was included in the package. This curler didn't curl my lashes as well as others that I've used in the past, but I assume that it's because it was designed to be gentler on the lashes. I'd recommend this product to others.",
    "One of my favorite signature scents. Fresh and clean , but, distinctly original 'marine' scent.Love it..., but...., the only problem is..., it doesn't last long at all. Shame.",
    "I have 9 tattoos, and only used this stuff for one of them. Of my 9 tattoos, the one I used tattoo goo on sucks. Which I admit, was probably the fault of the tattoo artist, but he's also the one who recommended this crap. Plus, it's very messy and got ink all over everything. It sits on the surface of the skin, and turned the color of the tattoo, which got all over everything else. Since that fiasco, I've only used my tattoo artist recommended Lubriderm, it's so much less hassle. Any tattoo artist I've seen and respected, recommends Lubriderm lotion. Go that route.",
    "Wonderful product, leaves hair soft, shiney and all with no additional conditiner.. on color treated hair! I now have a new hair product.",
    "Best product for my needs. It always works to control dandruff. It is hard to get at drug stores. Glad it is online.",
    "Grandson was happy to find this in his stocking on Christmas Eve. He says the girls love it. The price was good and it came really quickly.",
    "Very greasy and I don't fee like using it. I felt aveno was better than this. I felt it would be better if it was less greasy.",
    "I purchased this a little over 2 weeks ago, and so far it seems to be an excellent product. The only problem is I didn't actually purchase it from Amazon but through one of their suggestions, and I had to sign for it and missed the mailman the first time he brought it. Next time I will make sure I purchase it from Amazon, but I am a new customer and wasn't aware of what I was doing.",
    "It's a great product. My hair stylist recommended it and told me I could get it for half of what she was selling it for retail on the internet.",
    "I loooove this sponge! i have been using it everyday for 3 weeks now and its amazing! it doesn't absorb the makeup! the makeup goes onto the skin well and helps in blending the makeup evenly too! it washes well and it holds up pretty strong. i wish i knew about this a long time ago. i will forever buy and buy this sponge. i swear by it.",
    "I have long black Asian hair and it has been very dry for a long period of time due to bleach that got into my hair back when I went swimming every week for several years. I have tried many drugstore shampoos and a few nondrugstore shampoos and none have worked. I bought this product along with the conditioner at whole foods market and I started to see the improvement in my hair after several uses. I apply more conditioner than shampoo so that it would help moisturize my hair better. After using the shampoo and conditioner, I would dry it with a towel wrapped around my head, take it off after 10 mins, and wait for it to dry halfway. Then, I would apply 3-4 drops of jojoba oil and this routine has really helped my hair!",
    "I love the Meyer's Clean Day Geranium products. I use the dish soap and soy candles too. Thanks Amazon (and seller) for offering this as a Subscribe and Save product--made it cheap and convenient enough to use in all the bathrooms and kitchen.",
    "This cream is the most amazing cream for any woman in or past menopause! I have tried everything to keep my skin from flaking and looking dehydrated. When a doctor recommended that I use a hormone cream I remembered that I had this cream in my closet. In just 2 days, my flaking and pealing deminished. I am a makeup artist and get sent many creams and makeup to try and this one has worked amazing for me! Love it!",
    "I've been using this for the last three days now, and so far no noticeable changes in the way people react to me. It does seem to give me a slight confidence boost just from wearing it though- probably just psychological though. Very, very small bottle.UPDATE&lt; Shake the bottle before using.I have noticed a big difference in my treatment from the ladies after shaking the bottle before use. The smell also becomes a lot more noticeable so use sparingly. I over did it and it seemed to have negative effect.",
    "Ever since I moved to Arizona, I have been plagued with horribly dry & itchy skin, and even more so now that winter is coming. This lotion is the first I have found that actually helps. It really does last 24 hours, and the cooling menthol is great. This stuff works!!",
    "This tool is wonderful! It is easy to use, has a swivel cord and does a great job with my hair which if very full.",
    "It's good color, and I'll use it again, but next time I'm gonna buy it at walgreens, it's about $1 cheaper (Same brand, same color,) and I won't have to wait on shipping.",
    "Was exactly what I wanted.Large bottle of Lucky You perfume and the price is the lowest I've seen anywhere.Great shipping price and so fast!Def recommend it!",
    "I can't comment on the topnotes etc., but I do love this scent. My only grip is that it does take quite a bit to get decent lasting power with this cologne. Whenever the scent fades, you are left with a very powdery smell very similar to baby powder. That's my only true grip- I hate smelling like baby powder if I can't reapply!",
    "I use this for my 20 mon baby. It's great. very gentle, no irritation on skin or eyes. I can use it for her everyday without a dry skin problem. She loves it too. She always says \"my baby soap, love it\" when I put it on her.",
    "I was reading the label on this lotion the other day. I have been using this off and on for about a month or so. I never noticed before that it has a warning label on the back of the bottle. It says that this contains dimethicone and should after 7 days of use, you should see your doctor.I looked up dimethicone online. I saw that various websites have warnings that vary widely. They say anything from discontinue use after 7 days because it causes skin irritation to avoid completely, because it causes cancer. Maybe it does and maybe it does not. I am not willing to take that chance. I am throwing mine out and not buying it again.",
    "This makes my skin silky smooth. I'm 34. I've given this as a gift to my sister and to my mother. My mother is 58, and a multi-pack per day smoker(so you can imagine the shape of her skin). She was simply amazed at how soft this makes her skin feel. In addition to this product, I would highly recommend the microderm abrasion by Olay Regenerist. The two products together will make you feel as if you've spent a day at the spa, at pennies on the dollar!",
    "The item was just as decribed and it arrived on time. Very useful purchase. The item is very expensive otherwise.",
    "I have used a fuller hair brush for nearly 40 years.My old brush has been used on four continets and has survived 3 wars but like me it has lost a lot of its hair and it is time, also like me, that it be retired. I bought this brush in the hopes of getting the same kind of satisfaction that my original gave and I have not been disappointed. It looks like two fuller brushes will last me a lifetime. Quality satisfies and lasts forever.Thanks Fullerbrush",
    "I have bought every kind of acne cleanser imaginable. From clean and clear sacylic acid based products to Proactiv. I have had acne for over 11 years. I finally decided that I'm going to try the store BP since its so much cheaper than these expensive brands (Proactiv)I have extremely oily skin. So a scrub is great. This scrub in the morning with the weekly Clear Pore Daily Mask/Cleanser worked wonders. In the evening, I use Maximum Oxy Clean 10% BP...If you can get to a dermatologist, I suggest getting Clindamycin Phosphate Lotion and Retin A .01%All of this combined....my face is perfectly clear.In the morning I use this scrub, following the clindamycin phosphate lotion. Then afterwards I use the neutrogena visibly smooth sunscreen with vitamin e.In the evening I use Oxy face wash followed by the Retin A.I promise you, this is the best regimen. Even alone, this scrub can do wonders on your face. I absolutely love this product. It got rid of all my acne. If you buy this, definitely buy their sun screen with vitamin e and the mask version of it.",
    "Though I loved the samples in the magazines, when the actual perfume arrived, I thought it smelled a bit too masculine for me. But the seller was great!",
    "Australian Gold protects my sensitive, blond skin to the max. Made my holiday in Hawaii very enjoyable as I did not have to worry about sunburn all the time.",
    "These are the best hot rollers I have ever had. They heat up fast and smooth out the waves and frizzies. I like how they're so big, they don't make my hair too curly, just smoooooth.",
    "I am 42 and have tried all of the various creams, neutrogena, bliss fat girl slim etc. for the most part they have given me softer skin, but no real effect on the cellulite. I am now using the patches & the gel and after one week, things seem a little better back there! I dont think it has any real lasting effect, but helps the appearance and that is good enough for me this summer.",
    "I was excited when i found out i could order my favorite perfume from amazon and save time and gas by not having to drive and get it. My problem is that when it arrived and i went to use it i found out that it doesn't spray properly. It sprays like its almost empty and sucking air. its upsetting to know i spent so much money for something that doesn't work properly.",
    "I LOVE My bareMinerals!! I love this price even more! Great product- great seller! This makeup is great for those of us who don't want to look like you're wearing makeup. If you need extra coverage apply more. Makeup that breaths. Awesome! I order some for my mom!",
    "This is a fresh smelling cologne not over powering or too fruity but I would suggest this one for daytime use because of the lightness of its scent. It is fairly cheap so don't worry. It is not however a signature cologne that sharply stands out from the rest but due to its clean scent it will do. Step up your game without breaking your bank.",
    "It works good so far and i have not had any problems with it. my hair does not stay straight so i have to press my hair a lot so it worth it.",
    "The first Spa Sister Cotton Terry Bath Pillow I purchased sprang a leak within two weeks. The retailer replaced it without charge. The replacement sprang another leak within one month. I've purchased two other brand bath pillows. Both lasted for years. I cannot recommend this item.",
    "This was first introduced to me by a paediatrician in South Africa and it is fantastic - my 9 year old has used it morning and night for 7 years. It is light and easy for a child to apply - not sticky and it soaks in very quickly. Pleasant light smell and we would not be without it. She uses it on the insides of her elbows, back of knees, chest and face and anywhere where the skin is dry and sore. NO other cream has worked for us and we have tried everything. The thing to do is attack the excema vigorously for a week with specific PRESCRIBED steroidal cream... then use this MORNING and NIGHT and after bath or swimming, to keep the excema at bay. When we stop using it, the excema comes back... so we keep on using it, until hopefully she might grow out of the excema.",
    "I have poor eyesight without my glasses and have owned this type of mirror before for putting on makeup. The mirror is very large and the unit is sturdy and well made. Easy to install. I consider this one the best for the money of any I've owned.",
    "I was looking forward to a more \"natural\" product to replace my mascara (my favorite is Bobby Brown's Everyday mascara). This mascara goes on extremely light, probably partly due to the type of applicator (the bristles are thin with large spaces in between). It's great if you want to look like you are not wearing anything, with just a little accent of the lashes, but it really just subtly highlights your lashes. I should say that I do not like heavy mascara; I'm very careful to put Bobby's on lightly. I always prefer my make-up to look as natural as possible, but this mascara seems a little pointless except for very casual wear. But, if you are looking for just a little highlight, this may be the way to go. The tube has a small mirror on the side and the smell of the mascara is pleasant enough.",
    "thanks for the perm rods i used them to give myself a permanent also good prices for them came in very handy",
    "It arrived on time and as always my mother was pleased with the product. Since she can't get out much due to illness she was happy to receive it at her door with a lower price then she would have paid for Opium by Yves Saint Laurent at a department store.",
    "This product is simply waste of money. It does not work on my son's hair. Will not remmend this to anyone.",
    "I highly recommend this sunblock.I have a pasty white complexion, have severe allergies, and very sensitive skin; people always comment about my lack of pigmentation and say that I have a \"china doll complexion.\" Because of this, I have tried several of the high-end cosmetic companies sunblock. The reason I have tried so many is because they have all disappointed me - until this one.I live in Las Vegas, where even in the winter, I am exposed to the sun and need sun protection, and this sunblock does the trick. Because there were so few good choices, I stuck with Prescriptives 40SPF, as that is my prefer ed brand of facial make-up and tried to stay out of the sun. It worked for me - until I took a trip to Disney World in August. I knew that I would need something strong and effective for my trip to be enjoyable for me and my friends. This sunblock was amazing. I was able to go the entire trip without even a trace of a sunburn - and we stayed in the sun from sun up to sun down.In Florida, I reapplied it every 3-4 hours but in between these times it weathered the humidity, rain, and sun like a champion. My skin is naturally dry, so I did not notice it to be greasy as other reviews have mentioned. I did not think that it left any color on my face or body.If you need a heavy-duty sunblock, and you have facial sensitivities, then this sunblock will work perfectly for you!",
    "This product was exactly what I was expecting to get. It works well for dry skin and for stretch marks (for those of you that are pregnant). It's great for the price and I'm definitely going to buy it again.",
    "This stuff works as it really does fix your brows in place without movement for as long as you keep it on. However. if you touch your brow it will flake and turn white. Also it appears wet even after it dries so don't ge it on the surrounding skin.",
    "I heard about Wildroot Cream Oil on a vintage radio program. It was popular in the 50s (I'll bet my dad used it!) and advertised for the whole family. Something about the barbershop quartet singing, \"Try Wildroot Cream Oil --- CHAR-lie!\" over and over again apparently got into my brain, because when I cut my hair very short recently I was really curious to try it. Very glad to see Amazon had it, and very pleased with the soft styling that just a tiny amount will achieve. No more stiff mousse or gel for me. The bottle arrived quickly and will last me a long time.",
    "This one introduced me to the writer and has been a book that has helped me through some of the toughest times in my life.",
    "I did quite a lot of research before buying this hairdryer. I was debating between this and another product that was around $90...I've always used \"cheapie\" dryers from the drugstore, and when mine stopped working, I decided I needed an upgrade. The reviews seemed good and the price was right - so decision made.First, let me say: Other reviewers have commented that this is unreasonably heavy. It is on the heavier side, but it's not at all uncomfortable and it actually helps me to gauge where I'm aiming it.Secondly, I don't think this hairdryer gets very hot. This is a huge plus for me, because I have thin hair and I don't think I could singe or burn my hair with this dryer. However, for someone with super thick hair, it might not do the job as well.With my old dryer, it took me 20-30 minutes to dry my medium length hair. With this dryer, I'm dry and ready to go in 10 minutes or less, so that is a huge plus.Overall, I'm very happy with my purchase and would buy this item again.",
    "Like many women, I was looking for a product that would naturally increase the size of my bust. This product does not work. Like they say, \"If it's too good to be true, it is.\"",
    "My hairdresser has been using this stuff for years and every time I would ask her what it is, but then not buy it. I'm so glad I finally did. I live in Florida so I'm constantly battling humidity. My hair is prone to frizz anyway, so it makes my fly-aways that much worse. I use it for a sleek ponytail look in the summer, and any time I want to look a little more polished when I style my hair. I was concerned about the price and how fast I would go through it, but a little goes a long way and I'm sure this will last me a LONG time. It also smells amazing.",
    "I've been growing out my soul patch for some time and decided I wanted to draw it into a point. I purchased an assortment of waxes which included Clubman. I quickly noticed a couple of problems with the product.1. Even in small amounts, the \"neutral\" color never seems to blend properly into my light brown facial hair. There are always small bits that are visible no matter how much I blend or comb with the included tool.2. It smells like shoe polish. It's not floral to me - it smells of harsh chemicals and is not pleasant to have on my face.On a high note, the shipping was lightning fast and the product was exactly what they are showing. If this product works for you, the price is good and it'll get to you quickly.",
    "Ok, this stuff is a bit like putting grease in your hair, but you use no more than a rice-sized amount and it will add shine and make your hair feel more healthy (and it may actually be!). I find the more I use it, the better my hair seems. It does have a slight odor similar to coffee beans, but I like that smell so it doesn't bother me. If your hair is dry or over-processed this stuff is for you - but if your hair is just very fine and limp, I don't think this product would be for you.",
    "This sleep mask is light weight, fits snugly and is comfortable to wear. I don't know how long it will last. You might want to order two at a time, especially if you plan to keep them clean by washing. The sleep mask keeps the forehand warm and may provoke sweating.",
    "my hair is very fine and soft. This product gives it really the volume. It makes my hair a bit stiff if used in abundance but for a hold it's perfect for my hair.",
    "I decided to order this product after spending way too much money on professional chemical peels. The product is exactly what I wanted. I have had some very light peeling and i feel like my skin has improved after a couple weeks of use. Hopefully, it will continue to as time goes on. my only issue with this product is the unclear directions. There are multiple places where the information on application frequency varies.",
    "I wanted a bare color and this was the perfect one for me. The color in the picture looks a bit dark but once its on your finger nails its light. Just slightly not drastic. The seller was quick to get on my order. I ordered this product on Tuesday and by Friday I had my OPI BAREFOOT IN BARCELONA! Very happy customer.",
    "I just received my cocoa butter..... How ever it was not pure cocoa butter but with jojoba oil as welll. That's why it did not get 5 stars but I love it",
    "Domeboro Astringent Solution does the job better than any other product out there.If your baby or yourself for that matter has a raw bottom, this is the product. Better than creams or anything else I've ever tried.",
    "i bought this product assuming it was all natural, since it contained some organic ingredients. then i saw on the product ingredients containing FIVE paraben preservatives and some other chemicals.but what troubles me the most is the over-powering scent, which is mostly from fragrance/parfum. for the average consumer this would not be a problem. but for someone like me, who has been using all natural products and eating all vegan, i'm extremely sensitive to smells, especially synthetic ones.other than these two irritations, it works great as a detangler, makes brushing my hair after the shower so much easier. but i don't think i can use this product because of the smell. i had difficulty going to sleep last night because my nose felt so congested.i really wish the company would reconsider and making it preservatives free, and chemical free. i'd definitely reconsider.",
    "This dryer is average. It doesn't dry much better than other dryers. It weighs a TON. If you have long hair like I do, your arm will be ready to fall off after 10 minutes. If I try to dry my hair AND my daughter's in the same night it is nearly impossible. Do yourself a favor, and buy a lighter dryer!",
    "As a licensed esthetician, I am cringing reading the reviews of some of the users of this product.\"Applying and leaving on\" \"Applying 3 times a week\" \"Using as a daily exfoliator\"If your not going to seek the advice of your dermatologist or esthetician, please buy a book on Chemical Peels to understand how they work.Applying more that once every 10 days will thin out your skin and will cause problems down the line. The whole point of \"Peeling\" is to clear away the old dead skin cells and allow new ones to surface. It takes your skin (depending on age) 20-42 days for brand-new skin cells to work their way up to the surface of the epidermis, if your constantly stripping your damaging your new skin cells. Patience is needed with peels and generally a series of 4-6 are needed depending on your expectations. Always apply spf of 30 or more afterward and before starting with this 50% lactic prime your skin a week before by using 2-5% glycolic wash. And PLEASE seek the advice of your friendly neighborhood dermatologist and/or esthetician before even attempting to peel.Good luck to you all.**Oh and regardless of what the manufacturer claims it does not change the \"size\" of your pores, they may appear smaller because the chemical de-congests the follicle but if you naturally have big pores; this will not shrink them.",
    "I love Glo Minerals Pressed powder better than all the mineral powders I have tried. Received my order in a timely matter. Very satisfied with the price because other companies over charge.",
    "I ordered the cream for my wife, and the product was delivered fast, when she tried it, she was very happy that the creat was as good as extected. Very good price, and a high quality product. Great seller, thanks.",
    "I've had problems with both oily and dry facial skin since my high school years, and finding the right products to deal with them hasn't always been easy, particularly for the dry skin issue.I've tried many products, ranging from cocoa butter to Curel or generic moisturizers; they've helped some, but I hate the cold goopy feeling of the moisturizers -- especially in cool weather -- and I sometimes forget to apply them. Moreover, I still have to wash my face at least twice a day; if I use regular soap for a long stretch of time I'll get these terrible dry skin patches. Worse, if my skin is red and blotchy from stress, the soap will burn.Thankfully, Nivea For Men's Double Action Face Wash has proven to be an effective solution to most of my problems. It is gentle on my sensitive skin and cleans off dirt and oil (I still get oily skin when I'm stressed, too) without irritating or burning, and if used dilligently and in conjunction with Nivea For Men's other products (Exfoliating Scrub, After Shave Balm), the Double Action Face Wash soothes and moisturizes the dreaded red-and-dry patches of skin. In time, those ugly patches start diminishing in size and will eventually vanish. Even better, its scent is pleasant yet masculine, with none of that heavy soapy smell that lingers for hours.",
    "I don't know what took me so long to buy this! I used to get the cheapo's from WalMart. NEVER AGAIN! There is such a difference! My hair actually feels soft and silky after straightening it. I have fine, thin hair with a bit of a wave and without this flat iron, it just looks terrible. The CHI heats up instantly and is very easy to use. It is definitely worth it!",
    "This is my second one I have had over the years. I am very pleased with it. I originally got it because I had trouble lifting my arms over my head.",
    "I always buy this soap when I travel in France. When I found it on Amazon, I was elated! It is so moisturizing that I never need to use any body creams or lotions. With its simple and pure properties of Olive Oil, Vegetable Oil and Mediterranean Sea Salted water; \"Savon de Marseille\" is the ultimate soap to use for dry skin. The large 1000gm. blocks are a great value, and they can be cut easily into four individual 250gm. bars. Great for ones' own personal use. For gift giving the 300gm. bars are perfect! If you want to walk out of the shower and not immediately feel compelled to put on hand cream or body cream, use this Masterpiece Soap!",
    "Been using this product for years.I like the ash shadebecause it doesn\"t turn my hair too brassy/red looking.Italso lasts between applications.",
    "Love the color! But face it, who wants to wear something on their lips that tastes & smells pretty bad? I have to put a strawberry clear gloss over it just to cover that up. But like I said, it is a very nice color though.. and looks different from the bottle color when it's on.",
    "Feels and smells just like the more expensive ck one i have bought in malls. After reading some reviews from online customers who believe they have gotten imposter fragrances, i was nervous about plunking down so much money for an online fragrance purchase. But it's all good!",
    "I don't know about any of you who likes new nail polish to come with a neat brush. but when i opened the nail polish, OMG bot, was i disappointed. all of the bristles has fly away hairs, and i had no choice to cut some of them, in order for it for the bristles on the nail polish brushOPI That's Berry Daring Nlb36 - Nail Polish / Lacquer / Enamelto be neat. omg, now i have nail polish on my scissor, and a messed up nail polish brush. NEVER AGAIN THIS COMPANY!!!!",
    "Hair dryer works good. Thant said, the design of the handle could use some improvement. It has a narrow handle. Periodically, I accidentally turn off the hair dryer because my finger accidentally squeezes the small toggle on-off switch on the handle. It is a little annoying, but tolerable",
    "This is a great product by L'Oreal but too bad it is no longer available in Forest green. It glides on smoothly and stays all day and is also easily washed off at night. Highly recommended.",
    "Exuviance Moisture Balance Toner is good for oily skin. I have acne problem. The Exuviance Anti Bacterial Cleanser and Moisture Balance Toner is solved my skin problem. I suggest these products.",
    "I've had seborrheic dermatitis since I was a child. Sometimes it would affect most of my head but sometimes just the right or the left side of it. With this thing being hidden by my hair and by barely having itching, I never really took an action to cleanup the mess above my brain.I'm 25 now and I decided I'd do something about it and try getting rid of it once for all.First thing I did was coming to god AMAZON and looking for something that would help me accomplish that. This product came into my attention mainly because of its positive reviews. Even though most of the people say they are using it to successfully treat psoriasis, I decided to give it a shot.Before using it for the first time, I had the seborrhea and some dandruff only on the right side of my head and I was also having some itching mostly in the afternoons. Eventually I'd notice flakes on my office table and on my shoulders. I wash my hair in the morning and at night (around 1 hour before going to bed) and started using this product on the affected area right after my morning shower.In the third day of usage, the itching ran away completely and my head was a little bit red colored in the area where I applied the product.One week after I started using it (once a day), my head was completely clean and free from itching. Since then, I started using the product around 3 times a week at maximum and it had kept my head clean as new.No itching. No Flakes. No dandruff. Nothing! This product is simply amazing!! Thank you so much for doing it guys!I wish it was more popular so other people would know about it...",
    "Lovely Fragrance that I always get compliments on. Be prepared for a pump that gives very little with each pump so you need 15-20 pumps for a shower.",
    "I'm really wondering what the hype is about this perfume. It really stinks! It's way too strong. If you use more than one spray you'll need a gas mask. Yeah. I'm definitely returning it.",
    "This seems like a very well made mirror, it is a nice size, and the magnification strength is great. It is easy to install, and the nickel finish is very classy. The one thing, though, particularly after reading another reviewer's comment, is that I make a habit of tightening the screws on either side of the mirror from time to time ... just seems to make sense, considering that the mirror gets rotated back and forth quite a bit.",
    "What first catches your eye is the bottle - it's a stunner. Wide and then tapered it is topped by an imaginative ruby tone shape - a pout, a kiss, a heart? All of these signify romance, which is most definitely appropriate for this subtly sensuous fragrance.Princess Marcella Borghese launched this scent in 1993 and like all classics it has withstood the test of time. Its floral fragrance is as fresh today as it was when introduced. A very feminine scent it has additional notes of fruit - plum, peach, plus musk and cedarwood.I never tire of Il Bacio - summer, winter, springtime or fall.- Gail Cooke",
    "Ive been using this perfume for years! I ran out about 8 months ago and have been using Calvin Klein Euphoria (which is also freaking amaze!). I kept wanting Escada back in my life so I bit the bullet and bought another bottle hoping what I was buying was the real deal... It took exactly a week to arrive but it arrived and smells just fabulous! Thanks for the legit purchase!!",
    "Smells just like the perfume and lasts surprisingly long for a deodorant spray. My only problems are that it evaporates from the bottle very quickly and that the bottle itself is a cheap plastic material. Almost make me question its legitimacy.",
    "I used paul mitchell shampoo (original and tea tea), conditioner(original and tea tea), gel(original and tea tea), wax, and hair spray products. After 7 months of use, my hair start to thin out at the age of 24. I stopped it for 6 months and my hair has returned to normal. I would not recommend any paul mitchell product.",
    "First of all, let's talk about the noise level on this thing. YIKES! That should be against some kind of consumer protection law. The blowdryer part is ok, but didn't like the brushes at all. I'll go back to my Conair stying brush and my straightener.Live and learn.",
    "I bought 3 radios, for me and to give as presents.The white plastic ovals around the buttons, in the 3 radios, where unstucked, and one of the radios only works in FM, I can't change to AM. The radio has 7 buttons (not 8 as in the picture of the radio). The radio is just as the one in the pictures with the woman.",
    "I was so happy to find this product on Amazon because I purchased it for the first time at a spa and I paid 3x's the money. When I ran out I waited for a long time to purchase because of not wanting to spend that kind of money. My face quickly began to go back to the horrible break out and I got desperate. I found the Obagi Clenziderm and ordered it through Amazon by a vendor: 101 Medical Spa. For a great price and got it quickly in the mail. Thank you, my face is looking great and I will never allow myself to run out of my Clenziderm ever again.This is a Top Notch product, worth the money. You will love it. I am wanting to purchase the Obagi Nuderm next for fading brown spots and for acne as well. That kit is even more expensive. Waiting to see if Amazon will carry the kit for a decent price.",
    "I get break out here and there but nothing more than I was breaking out before I was using it. My face probably getting used to it since i've been using it only for almost 3 weeks. Good price, easy to use, and cleanse dirt and excess oil. Would recommend it.",
    "I can't believe it. I have worn this colonge for years now and believe me the wife knows the smell. I dont know where Amazon...yes Amazon got this bottle but I was suspicious when the PRADA on the bottle was huge when compared to my existing empties. The smell is not even close. I'm truly shocked. Called Amazon and they refunded didn' t want it back and told me to just post feedback when I said I wanted to talk to someone about this since selling fakes is a crime. Nice eh?",
    "You get what you pay for. This cologne was very cheap compared to others I've purchased. The bottle is plastic and is not one I would leave on my dresser. To be honest I kindof hide it in my medicine cabinet. The scent is nice though, very light and clean. I've been told it smells like I just stepped out of the shower, even hours after I put it on. I'd recommend this for younger people, ages 12-25. My little brother would probably like it. For reference, I'm 26 and would not buy this again for myself. I gave it 4 stars because it was so cheap and smells decent.",
    "i havent noticed anything good, but it hasnt hurt my hair, either. neutral smell, doesnt seem to over clean or add too much moisture, but i bought this to help hair growth and havnet noticed anything in that direction.",
    "I buy a bottle of this for my lady every year. She loves it and so do I.Not an overpowering scent. Nice and subtle. My lady can't handle over powering smellsbut she says this one is the best and makes her feel like a woman.I would recommend to any lady needing a great perfume or a gift.",
    "I found this perfume completely by accident and fell in love with it, as did my boyfriend. It's a little pricier than many other perfumes but well worth it. I only wear it for special occasions and wearing the perfume makes it even more special. Even my kids noticed it when I wore it!",
    "I recieved this product in 3 business days. Shipped very fast from company although I paid only for regular shipping.The product has a mild smell that you'll get used to. It is a grease, but it is very soft. Will make even the toughest hair managable. For that alone I will continue to use it. I don't however looking at the ingredients think it will do much to stimulate hair growth. It may grow hair as a result of keeping it healthy, but will not encourage faster hair growth. I've noticed softer hair since using it, it has a pleasant smell that I can live with and is now a staple in my hair care regimine.",
    "This perfume is good for the low price. And very very fast shipping. I got it only two days after ordering, even before the items that I ordered the same day with prime 2-day shipping.Comes in a super convenient small bottle with rolling applicator, perfect for bringing with you and freshening up on the go. The jasmine scent isn't that strong but still smells good, with a hint of vanilla actually. Very summery. Worth buying but if you really want a strong jasmine scent I would recommend looking for a more pure jasmine essential oil. Sun's Eye Herbal Essentials offers a fantastic jasmine rose option at an extremely reasonable price.",
    "It took some practice to use this curling iron, but after I figured it out I LOVE IT!",
    "I have been using this product for over 2 weeks. I do not see any change in my skin as far as less wrinkled or more moisture.I have not tried it on my hair.",
    "Ok so let me first give you all a brief description of my hair.I have very thick long wavy hair (naturally), but I do occationally straighten it with a flat iron. When I leave it natural (wavy), I let it air dry then put a little gel in it to keep it from frizzing up (which it soooo will if I dont put anything in it). It tends to look very dry even though I have nice waves. When I straighten it with a flat iron my ends look fried, but for the most part the rest of my hair will have an ok shine to it (nothing too amazing). After a couple of years of coloring my hair (base color + full highlights), it's ruined the texture I used to have. I can't blow dry it to save my life cause I have entirely too much hair, and I have yet to master the curling iron to create lose curls. Until NOW...Ok soo, it says to apply a dimes worth. Since i have so much hair I made a part down the middle and applied about a nickles worth to each side (from root to tip). I decided to see if it would help me defeat the blow dryer and curling iron.Mission #1: the blow dryer- Still suck at it lol. Mission #2: the curling iron- and it came out gorgeous!!!I can't even begin to explain how many times I've tried to do my hair with a curling iron, and it looked horrible every single time. This Hot Sauce gave sooo much life to my hair. It felt silky, soft, smooth, and absolutely no fried looking ends. I DIDN'T use hair spray or any other hair products (only Hot Sauce). Each curl came out perfectly and held in place. Im convinced its because of this product. All I can say is...does it only come in ONE SIZE! Ugh the downfall is. I have so much hair, and the bottle is tiny. This stuff is amazing and everyone needs to try it. I've tried so many hair products. This is now my favorite of all time. Keep in mind that all hair is different. What works for me might not work for you, and what works for you might not work for me. But its so worth trying. This is the cheapest I've found it, and it came very quickly.BUY BUY BUY BUY BUYNOTE TO SELLER: You should start selling them in packs as well.",
    "I once stuck to this lipstick when 'long lasting lip color' was just beginning and it does stay on the lips.It is nice not to run to the powder room so often to reapply lipstick.It does feel a bit heavy on the lips and doesn't make lips feel moisturized ,thus I gave it 4 stars.",
    "I am a salon owner. I bought a CHI Iron after seeing it at an industry show, while I was still in school. That was 10 years ago. My first CHI lasted 7 years and it took some serious use/abuse believe me!!!! I've taken it on location for working in the theatre, demonstrations,fashion shows, etc. It has been dropped(not by me), left on over night(again not by me,LOL)and banged around in my gear bag. My last one lasted for 3 years, however, another stylist borrowed it and it came back not working... I've decided this is the last time anyone uses my CHI, it's now under lock and key.I can't say enough about this product other than it is the best! The original (and buy the original 1\",the other functions on newer models detract from the performance) by Farouk has been voted the number one stylist's tool and number one straightening iron by The Stylist's Choice Awards for several years.Last but not least, average retail is $199, I was skeptical about buying one for less than my cost, but so far so good. I was amazed at the price and had a replacement for the one that was broken within three days.Make sure to try Farouk Silk Infusion or BioSilk Therapy when blow drying and run a drop over your hair when straightening...it will protect your hair, smooth away any fly aways and increase the shine!B.B. from Studio Be",
    "I really like this product. I have been usingit everyday for the last month and let me tell you, I see a big diffeence on my fanny. I recommend it to anyone who has the discipline to use this every day RELIGIOUSLY. It does work!",
    "I am 31 years old and was having some breakouts along my jawline and lower cheeks. I take very good care of my skin and see a facialist regularly, but the breakouts kept occurring. A coworker of mine suggested that I try this cleanser because she had success with it in the past.The product is great! My skin began to clear within 2 days of using this cleanser (in addition to Dermadoctor Emergency Spot Relief Treatment). I alternate between this cleanser and a non-acne one, as all acne cleansers tend to be drying (even though this one is extremely gentle). The cleanser does not sting or burn at all, and my skin is not left feeling tight and dried out after rinsing. A little product goes a long way with this cleanser. I think the 4 ounce bottle will last me for a couple of months.The only reason I gave it less stars was because it is pricey. But the results are worth it, so I guess you get what you pay for!",
    "I have thick coarse long hair and while it works well enough, even after buying the conair professional clips, I still have trouble keeping the rollers in place.",
    "I had this same HAI Classic for a good 4-5 years and it was awesome. I had purchased it at a salon for around $130 back in 2005/2006-ish. I loved it, dropped it at least 10 times, to the point that even one of the plates popped out and it snapped back in and worked like a charm for a few more months. When it finally died, I bought it again but this time off of Amazon and through discountsjungle. I believe it was still the authentic HAI, it looked identical to my old one but something changed in their manufacturing. I bought the 2nd one 8/26/10 and used it just as much as my old one that I'd had for 4-5 years except this time around it worked great until the blue ceramic coating started wearing off of the plates earlier this summer (2012). The ceramic never wore off my first HAI. Of course it was no longer under warranty so after much research I purchased a Babyliss Pro Nano Titanium off Amazon last week. It's fantastic and my hair is thanking me for it! If you see the blue ceramic wearing off your plates and it is during the warranty period, be sure to contact HAI for a replacement as the metal under the coating will fry your hair. Loved my HAI until this happened and sorry - not going to risk it happening again so I went with a product that carries a 4 year warranty. I'm not even certain that HAI would honor the warranty on this sold through discountjungle, ask them directly to be sure. They don't even list the HAI converible on their website anymore, it's a totally different looking ceramic flat iron with black plates so I think this is old inventory as well.",
    "I was turned off by the parabens listed in almost all cosmetic products and wanted to shift towards more natural products. I started using this product in December 2008. I would say I have oily/combination skin and found that most products for oily skin made my skin tight and made my oil glands more active. I have had no such issues with this cleanser, my face loves it. My skin is soft and I am having much less battles with acne. I used it throughout winter with no flaking and now that warmer months are here I am still using it, except now I am using a salicylic lotion each night to keep my pores in check.To use I simple apply it as normal on damp face massage and then rinse. Once a week I apply it like a mask. I squeeze a little on DRY finger tips and then sprend on my DRY face in a circular motion avoiding the eye area. I then proceed to shower as usual and then by the end of my shower (anywhere up to 10 min), the steam adds enough water to my face so I just massage thoroughly, then rinse. Voila beautiful, clean soft skin. If you do try to use it as a mask please remember to apply cleanser with dry hands to dry face. If you wet your hands and face then step in the shower, the face wash will get runny and drip into your eyes. That stings.To exfoliate, once a week a add a bit of baking soda to this face wash and massage in a circular motion. This is enough to keep my face soft and clear, for a cheap price, and without parabens and other chemicals. My skin hasn't looked this good in years.To summerize: I use the African Black soap as a regualer face wash twice a day, once a week I apply it like a mask, and once a week I use it with baking soda to exfoliate. I am truly happy with this face wash, and my skin care regime is so simply but the results are great.",
    "I found the product grainy and not the consistancy of the type I got through the hair salon. There were white balls in it and not in the salon product, maybe it was old.",
    "I was expecting more from this product. As advertised I thought I did not need to use any other dryer to finish the hair and make it straight. It does not work like that. The product does not make the hair straight as advertised. I did follow every step described in the instructions, but even did not work as expected.",
    "Not sold in stores anymore. So sad, why is it always my makeup that seems to be discontinued with no items available that I like as much. At least I found it on amazon so I can use a bit longer, but it will run out eventually!",
    "Works well, gets the job done. So far, no static. Seems to be very well made. Very happy with this purchase.",
    "I have always used a glimmer kind of dust to polish my makeup. I keep finding them and then they are discontinued. I love this minerals glo dust! It is exactly what I needed and wanted. I hope to find it in gold as well since I purchased the silver.",
    "I've used this product for appox. a year and love it for eye care. For those over 40, it really does help eliminate droppy upper eye area. Haven't found any other product that does as well. I was first introduced to this product at a \"Chanel\" cosmetic counter in a department store. When I searched Amazon to see if any one had it cheaper I was extremely happy to find it and have purchased through Amazon ever since.",
    "My dad was first given this product by nurses who were caring for my mother, who is stricken with Alzheimer's. The cream is known to repair skin tissue. One day, while visiting, I had a pimple on my face and my dad smeared a dab on it. I could not believe the results, because the next day the pimple was almost completely gone. Since then, I used this cream on areas that are resistant to my usual remedies. Now I go to this product for everything. It's amazing.",
    "The Milk and Honey lotion is wonderful! It is very moisturizing, even for dry, winter skin. It also smells great and the scent lasts for all day.",
    "I didnt feel like risking loosing my clarisonic on a recent trip out of the country, so I brought this brush that I was gifted by a friend and I have to say it was great, not harsh but still effective. I wouldnt switch from using my clarisonic full time for this but I would definitely bring it again on a trip again and use this instead for a short period. It is very high quality and I love that it is natural bristles.",
    "some one told me this shampoo was a miracle for their ever tangly hair. I have tangles too.I tried it and just got itchy.. (I am hyper sensitive) and it was not an improvement for my hair.HOWEVERbut it might be a miracle for someone else... and I hope it is!Its cheap and worth trying if you havent found your perfect shampooit came leaking in its package... so some improvement could be made for shipping.",
    "I've tried several scented \"natural\" deodorants and all of them left a red rash under my arm. Plus, the scent would often fade away during the day and the stink would return, meaning I'd have to reapply. I was skeptical when I read about this product, but with all the good reviews I figured what could I lose beyond $8? Besides, several people noted how the product lasted a year, so if it lasted, I figured, I'd be an even bigger winner. Well, it's been at least three weeks since I've had this product ... and I have not smelled stinky ONCE since using it, even after working out. Yes, I still sweat when working out, I do not have any foul odors at all. And I apply only once a day after my shower. I'm amazed. Also, I can't tell that the stick has gone down any since using it, so it's certainly lasting much longer than any other product I've ever owned. For me, this has been a great purchase and I would highly recommend it. The most you have to lose is $8 or so ... but the potential gain is so much greater.",
    "These are great barber shears. They are extremely sharp and cut well. The handles are comfortable and the shears are easy to use. I've had other brands over the years and these are the best I've found. (I am not a professional--I use them at home)>",
    "I first purchased one of these in America whilst on holiday after the one I took with me stopped working I found it excellent and attempted to purchase another one in the UK as a back up after about 5 years without success. I found I was able to order on Amazon so ordered two. They are excellent, great value and control my hair a treat. Highly recommended also the delivery service although expensive was first class arriving after 6 days.",
    "Definitely bleaches your hair but didn't get all of the color out. May need a second treatment but I'm not going to try it. Light brown hair here and thought it would be a snap to get the summer blonde look with no problem Even after 90 min my hair came out with big-time reddish tints. Looked terrible. Not freaking out since I'm a guy and I can always cut my hair shorter or wear a ball cap.Ladies, think really long and hard before doing this. Spend the money and get it done right the first time.Happy for anyone who got a good result with this stuff but I'm going to need to dye it back to my natural color or darker to get the yellow/orange out.",
    "I had never worn cologne, and a lady friend recommended this to me. I get compliments on it. Two sprays is usually enough. One day I did three and someone asked \"What are you wearing?\" (in a good way)Do yourself a favor and buy from \"Amazon.com\" and not one of the other resellers, that way you'll get the real deal.",
    "I first learned about this product in my college psychology class and decided to look it up. I read some of the negative reviews and wondered if I should get the cologne. After 1 week of use I was glad I got it. I am 22 y/o and have been getting many positive comments about the aroma. My girlfriend loves how I smell which is a plus. It is worth trying this product since it doesn't cost that much. The best thing about it is that it lasts almost all day.",
    "This face wash has an intriguing, herbaceous scent, and I am now totally addicted! A tiny drop creates a handful of suds and my face is left feeling as clean and fresh as it has ever been.",
    "I bought this perfume once at TJ Maxx just because the box was very pretty, but really loved this fresh and subtle smell. So when I ran out of it I decided to get a new one form Amazon. Where else can you get a large bottle of a brand perfume for just $26? I'm very happy with my purchase!",
    "Excellent delivery Mirror surface works just fine. Overall, product is good, but the arm & wall fixture are not of the highest quality.",
    "Pros: Able to see while wearing it, feels great, vibrations don't hurt, and very affordable.Cons: Doesn't stay on long enough, it will shut off after a minute or so.",
    "My husband has been using Paul Sebastian for years. We are thankful to be able to buy it on Amazon",
    "Very nice dryer. I have arthritis in by wrist and I was hoping that this dryer wouldn't be so heavy. It dries my hair in a very short period of time.",
    "This is a lovely scent. It is light and sensual at the same time. I have allergic sensitivities to many perfumes but I really enjoy wearing this one!",
    "If you are looking for a great product that will seem to cure skin problems on your hands, search no more. SIMPLY THE BEST.",
    "IT was my 1st time cutting my husband hair with this product. I thought I couldnt do it. He asked me to try the 1/4\" 1st. It was so easy to use. He then wanted his hair to be shorter, so I used the 1/8\". I didnt hurt his skin or anything at all. I am so confident on myself now. I buy an extra one for my mom to cut my papa's hair.",
    "This is the best set of rollers I have ever purchased. I have been rolling my hair for years and usually the items constantly break or don't hold any curl to my hair. I have been using these for more than 6 months and bought my sister a set for her birthday. They are wonderful. My hair is looking healthier and my ends are no longer breaking off.",
    "Cost is way too high, but something I use all the time and don't want to change. Superior product and like it. Shopped around to find it but discontinued so had to buy on line. Back on the market now.",
    "My husband and I have used this brand of brush for several years and we were very upset to find that our local beauty supply store didn't carry it anymore, so we were delighted find it on Amazon. Thank you Amazon one more time for coming through for us, we are very pleased with the brush and it arrived quickly, What more could you ask for. (we like this size for my husband and the smaller size for me)",
    "If you are looking for a product that promotes healthy hair and faster growing hair, this it it. I was excited to try this product because its rare and special. I started putting it on my scalp about a week ago, my hair is shiny, healthy, and growing once again faster than normal!!! Some people dont know how im growing it out so fast, this is my tiny little secret. You will love this stuff, and you will treat it like the delacy it truly is.",
    "I've tried many eye makeup removers and all came up short. They either left makeup residue, stung my eyes, left my skin oily or tight feeling or I'd have to use half a bottle to get the makeup off! This product worked so well that it caught me off guard! The makeup came right off without pulling or tugging, it left my lashes soft and oil free, my skin was clean and smooth, no eyes burning, and I didn't have to use much at all. It is my favorite eye makeup remover and now one of my 'must haves' in my makeup bag.",
    "I bought this Cologne last year and I loved it enough to grief when my spouse snatched it from me. I tried to talk her out of it because it was for men but she wouldn't buy my explanation. She told me that it was overpowering what I had bought her. It is a year ago but I still feel how it made one feel like you were out camping in a virgin forest with lots of flowery and should I say woody kind of scent. It was great! I called her before I gave this review in the evening and that call I made is going to put me back over 200$ back because she is asking me to buy her another one.My advise for men is that more than likely your spouse or girlfriend, your sister, mum does not want to just feel you under that blanket of Himalaya when you are around, they want it too and the label 'for men' is not going to stop them demanding for it.",
    "OMG This is the best fragrance ever ! The service wast perfect ! I'm laid up because of hip surgery and can't get out so the delivery was in great timing ! Pricing was fine too since I'm not working !",
    "I GREATLY ENJOY THIS FRAGRANCE, SHIPPED QUICKLY AND I FIRST USED THIS PERFUME IN THE LATE 80'S.BEAUTIFUL AND LOVELY SCENT.",
    "Very good product. I've been using it for a long time and it works great. No white marks. Safe for sensitive skin. I will suggest to improve the package. It may works better with a twist to push up and down.",
    "Since the first time I bought this for my wife, I have never had to keep on guessing what I should get her for her birthday - and she just loves it. The fragrance is subtle and long-lasting.",
    "The blow dryer did shorten my drying time and left my hair very silky but also very very flat - no body/bounce. Also had lots of fly aways. For the price, it's not worth it. Had better dryers much more affordable/better results.",
    "natural cocoa butter. smells great. great for lips and other body parts that needs some extra attention!!!!!! great for the price.",
    "Good for the skin, & the new bottle makes it easier to use. Would buy again....mildly uplifting & firming, good for aging skin.",
    "I bought these about a month ago. Okay, first, if you have long curly hair (middle of back or longer and almost all one length) you will need two sets (can't anyone make a large set 14-16 curlers) and extra pens (which they never include). Second, the actual curler needs to be a little longer. Third,I know the curlers are big, but still could be bigger, much bigger. These are \"supposedly\" made for women with LONG hair....if so they missed the mark. Maybe shoulder length. I have been curling my hair on and off since the 80's so I know how to use hot rollers, yet all these years later, I still feel like I have my old high school set.....sheesh!They do get hot, they do curl. BUT I had to use my 1.5\" curling iron, once I ran out of curlers with my hair hanging off the sides of the curlers, to finish my hair. I will be purchasing some really large velcro curlers. Save my hair from the heat, plus I let me hair air dry anyway.P.S. And WHAT is the deal with the pens...are they really that expensive to make that the company/maker can't included lots of extras?? I mean really!!",
    "This is the best dandruff shampoo out there. With any other shampoo, I'm scratching my head in 2 days, which means I'll need to use more. With Nizoral it takes about a good 6 - 7 days before I have an itch, with hair washing.",
    "This stuff sucks. It didn't help me with anything. It caused my skin to be very oily and break out.",
    "Small items but it works as a stocking stuffer for my Finnish sauna pals. I'm sure it will be talk of next summers saunas.",
    "I really like the Zia Moisturizer for dry/sensitive skin. I have severe asthma and most moisturizers contain fragrances that are a health problem for me, but I'm able to use this product with no problems --Yippee!!! It glides on smoothly and absorbs quickly into my skin without any greasy feeling. In just a few days of use my skin started feeling smoother and softer. I am hooked on this product and recommend it highly.",
    "This conditioner isn't super moisturizing, but I did notice a big difference in the tone of my hair color. Before, my dark brunette hair would fade to a reddish hue within a few washes, but this conditioner and the adjoining shampoo helped prevent this.",
    "I like Aveda products and had tried this one at a hotel before I purchased and thought I would like to try again. I like the smell and it conditions okay...but I feel like I have to use a lot to get the tangles out like you expect a conditioner to do. I downgraded this to use for shaving my legs with after awhile because I can get a better conditioning product from some other (and cheaper) products. On the up-side, this bottle is huge and if you like it, then it should last you a long time.",
    "great iron, itworks allover world..comes w converter plug..i recommend it...since traveling a lot, normally i use chi, but i have burnt many , since i tried to use it w expensive converters...finally i found one which s good for travelling.",
    "Unfortunately this product was opened before I received it and as a result I am unhappy. I don't recall seeing this detail in the selling ad.",
    "These are the original find for me, changed my earring-wearing life, really! But found lately delivery way slow, product too expensive compared to Lobe Wonder. I even bought online once and never recv'd; they never followed up or even registered a a sale for them. Waited for 4 weeks w/o product. Not good, Gummy when you remove them, compared to other. Switching...",
    "Portable and convenient mister. I sent it to a relative overseas in the military and was told it has worked well.",
    "my husband has wanted this colonge for a while, and i have had a hard time finding it. Amazon had it in stock, ordered it, and it came about 4 days early. My husband loves it.",
    "I don't know what I would do without toppik. It makes my thinning hair look full again. It is amazing. I have light blonde hair and I use the light brown color. I can no longer see my scalp. Great Stuff!!",
    "Just as the other reviews say, this mirror works wonderfully and is comparable in quality to similar mirrors in hotels like The Four Seasons. (I looked up the price of the brand at one hotel and it was 3 times as much as this mirror).I can finally put on my makeup without my glasses on and see what I'm doing!",
    "I have sensitive skin and wanted a moisturizer that was as natural as possible, oil free, SPF protection and had antioxidants. I found all of those in this moisturizer. It has worked great for me and smells wonderful.",
    "Not sure what the previous reviewers meant by the so-called \"bad smell\", but my towel smelled like, well, a towel! It absorbs way more than my old t-shirt that I was using and although these towels aren't large perse, it does do the job of at least absorbing a lot of water. Being a curly girl, this towel is just what I needed. So okay, yeah you can get a \"sham-wow\" towel for about the same price at your local Wal-Mart or CVS, but why? Why use something that's not meant for your hair? I'm just a bit biased. I like the towel and for me it has reduced my diffuser time down. I say, try for yourslf and see!",
    "This product definitely works, a little too well. I do suggest purchasing this product, however, I'd like to give a little warning to anyone who's interested. The company was nice enough to send a trial size version of their salicylic acid product along with this peel. They suggest using it a few days before doing the lactic acid peel, so that the l. peel works better. Well, my experience was not pretty...I did the s. peel about 4 days before the l. peel. I loved the outcome I got from the s. peel but once I did the l. peel I looked like I had burned my face off for about 3 days. I couldn't laugh, smile, make any facial expression whatsoever without pain. I'm not sure why I had such drastic results b/c according to the instructions that's exactly how they suggest using it. I only left the l. peel on for about 25 secs. This stuff is really strong so I would advise you not to use the s. peel first. Do one or the other and see how you react to it first. Then wait a lengthier amount of time in between both (definitely more than a week). All in all I was pleased with the results- it does do what it says it will but you have to be careful and check your skin sensitivity first. I hope this helps you avoid a few days worth of hiding in your house so no one sees the red, peeling remnants of your face ;)",
    "This is another must have product. It helps a lot when you want the \"celebrities' look\".",
    "I can't tell you how excited I was to learn about this product. And after reading all the fabulous reviews, I was even more convinced. However, I am very sad to say that Zeno did not work for me. It didn't alleviate the pain of blemishes, it didn't speed recovery -- nothing.At first I used it religiously and studiously according to the instructions: use at the first sign of a blemish, 2-3 treatments for each, spread out over 12-24 hours. When, after many attempts, that didn't work, I tried using it all different ways -- frequent zapping versus single attempt; two zaps in a row; after cooling my skin with water, after heating it with steam, et cetera. Nada.In the owner's manual it says that Zeno worked for 90% of the people in their clinical trial. I guess I'm in the other 10%. Here are my skin stats, to help others make a best guess about whether Zeno will work for them: I'm in my late 20s and have combination skin and mild to moderate acne. My blemishes generally don't have \"heads\"; rather, they are painful areas below the surface of the skin.Best of luck to those who try it!",
    "This heats up nice and fast and I like the adjustable heat settings. Nice big barrel to give my hair some volume.",
    "I ordered the soaps thinking the soaps would be a bit larger... they smell nice, but a bit strong. Oh, and recieved 2 bars instead of 3.",
    "I had a paraffin bath before and it literally took 8 hours to melt the wax. This one takes about 90 minutes which is much better and you can't beat it for the price. I garden a lot and this makes my hands soft and it feels good on my joints. I would recommend it to anybody. Can't really go wrong here. good for your feet also.",
    "I have fine hair and tried this the other day for more volume. Wow! My hair full of body. I'm hooked.",
    "Don't like the fact that cause I live in Alaska I have to pay so much shipping. Sent this product to a consolidation address to have it reshipped for a lesser price. Silly!",
    "This is fine for hand soap but don't believe the people who say it works as a shampoo. Maybe if you don't care at all what your hair looks like it's okay. For the rest of us who want to avoid hair that feels like straw and smells disgusting, avoid at all costs!",
    "The Dermalogica Exfoliating Body Scrub is one of the best scrubs I have ever used. It leaves your skin looking illuminated and feeling smooth. It is best to be used with the Conditioning Body Wash, but this scrub is one of my favorites!",
    "Totally satisfied with the product, excellent quality, just what I was looking for a totally original fragrance, very good seller, timely delivery, good packaging, recommended for future purchases, worthy of five stars",
    "I used this product until the bottle was gone, hoping my skin would learn to tolerate it. Unfortunately, my skin never learned to, it burned and irritated my skin every time I used it. I have used another similar serum from NOW that worked great and didn't burn. I didn't notice that this serum was beneficial to my skin, but it may be that my skin is just to sensitive to tolerate it. I have somewhat dry, extremely sensitive skin and I only use natural or organic skin care products because I have less bad reactions to them. I would advise anyone with sensitive skin that they might want to avoid this product.",
    "I was searching for a good gold color and so far I'm pretty pleased with it. For me, it lasts for quite a few hours. I don't think you'll be disappointed with it, I'm not. :-)",
    "I just like it!!!!!!!!!!!!!Must agree it, can't be worn at bedtime. Why? Because you won't fall asleep. IT'S SUGAR",
    "I have used this cologne for many years, but have trouble finding it in my local stores. It is delightful to use and especially during the summer it refreshes you and is not heavy or cloying.The say it can be for men or women and it truly is--it is similar but slightly different for each person.I would recommend for any one.",
    "The product I got was Leyjie brand! I've never tried the Salux brand but this one is a little rough for my preference.",
    "I have used this product for several years and this is not a knock off it is the real Mccoy, I would advise anyone to try it",
    "I use the mask to sleep during the day when I work the night shift. It's very comfortable, even though I'm not used to wearing a mask. I love it, and the price was right!",
    "This is a great hair reconstructor! Works better than any of those solon \"miracle\" conditioners. After several uses my hair was smooth, shiny, silky, healthy looking, and much less frizzy. Unlike the dry, poofy, dull cotton ball I had before. Comparably much less expensive too! Would recommend purchasing this product at a local health food store or online.",
    "As you can see I ordered the Armani for WOMAN. I received the Armani for MEN. It turned out that my son enjoyed the fragrence so I gave it to him. It did mean that I had to reorder the product and have it sent directly to my daughter, as this was a Christmas Present, and hope the RIGHT product arrived.They like the scent, I just didn't plan to order two of them.",
    "Initially I was so impressed with this product I bought a second one within a week, so I could have one at home and one at the gym. After 4 months, however, the first one refused to shut off. About 2 weeks after that, the other one burned out. I'm not willing to throw away money every few months on any product, so I won't be buying this, or anything else under the sassoon label again.",
    "Waste of money, will not buy again. Not enough &#34;scrub&#34;, and its supposed to be odorless but has an odd lingering smell.",
    "I have been using this for years at night. (In the morning I use Dermalogica Daily Microfoliant.) The combination of these two seem to work for me and I have fewer blemishes now than ever. Other products that I have tried have been too irritating or drying. When I was younger I needed a cleanser that would reduce the oil but now I have skin that is getting dry, and yet I still have occasional blemishes. Finding a product that would not break out my skin but not strip it either was a challenge. The Purpose Cleanser is the closest I have come to meeting both objectives. I also like the fact that there is no scent.",
    "I live in San Diego, California. I love to body board and I was having trouble finding sunscreen that would not run into my eyes and burn while I was in the water. This stuff is fantastic! It goes on easy and clear. It fells light and it never runs into and burns my eyes like most other sunscreens. I am excited that I found this, Ocean Potion ROCKS!",
    "Great customer service. Product arrived with very protected package. smells good and feels good. I used the sekkisei lotion a couple years ago and now has to go back to it after tried several other brand skin care products. It makes my skin brighter, softer, and much moister than others. Will definitely buy from this seller again.",
    "This was a complete waste of money! I bought this product after reading reviews as I have red spots(just like goosebumps) on my arms and thighs. I used it regularly for 2 months. The skin seemed softer but the spots didn't disappear at all. Infact the skin seems to have become one shade darker which makes it look like spots are gone. But in reality the bumps are still there and the skin is rough. The cream is very thick and doesnt get absorbed into skin. I wouldn't recommend this product to anyone.",
    "I am very happy. the product arrived on time and was as advertised.I would recommend this shipper to anyone.",
    "First off, let me say that this is THE best flat iron. If you're reading this review because you're thinking of buying a CHI, then drop what you're doing and GO BUY ONE NOW! :) I just received my CHI today and couldn't wait to use it. It completely surpassed my expectations, and let me tell you, I had very high expectations because of all the great reviews I read. It heats up in a matter of seconds and my hair is silky soft and pin straight (which I have NEVER been able to achieve before with other flat irons). It doesn't pull strands out and it glides like glass over my hair. Also, with other flat irons I would have to go over the same section of hair at least 3-4 times to get it straight. Not so with the CHI - one quick pass over a section of hair and it's perfect. I can now straighten my whole head of hair (and I have a ton of hair) in less than 15 minutes. It used to take me 45 minutes with my old irons. This is the 5th flat iron I've owned in the past 8 years; some costing more than the CHI, but none gave salon-quality results like this one does! I truly did not believe that all of these raving reviews could be true, but they are. 100% true.",
    "I love this product it works so much better then a towel It is well made no problum with the button I even bought One for my daughter, sister and 2 nieces All with very long hair and thay said that the drying time on their hair was cut in half",
    "This tool does a good job of removing thick callus, but I did manage to cut myself (my fault--it's a razor!). I was upset at cutting myself, and although I am not diabetic, I do worry about foot wounds. I doubt I'll use the razor part again, but the rasp is good. Just FYI, I have used and like the Ped Egg. It's difficult to cut yourself with it, and it does shave off dead skin.The Tweezerman Callus Shaver comes with no instructions except how to change the blade which is printed in a very tiny font on the back.",
    "I think this perfume is fake. It doesn't have a lasting smell. Don't buy it.",
    "I am happy withthis purchase, for a [$] blow dryer it works very well, it is powerful and light in weight. The buttons are a little difficult to get used to, but it blowed dryed my bleached out hair well. The unique design concentrates the air on the area you need. If you are not a proffesional and just need a good low dryer, this is a perfect and GOOD LOOKING choice.",
    "This is a new perfume that has just come on to the market recently. It is only sold at a few locations around the US but soon it will be sold at most major retailers. It has a subtle smell that is alluring and strong enough to be noticeable but not be a turnoff. It mixes a bamboo scent with a watery mix of apples and sandalwood. It is a perfect statement for any free-thinking man or women because Soul has a variety of products. The bottle is also one of its stronger points. Soul's bottle is extremely stylish and many people find this to be their favorite part about the perfume.[...]",
    "This straightener works really great on long hair and it helps the whole straightening process go much faster. The only down side is it's too big to get the little odds n ends and to really make your bangs look naturally straight. But other than that, it's great :)",
    "This lotion is good, moisturizes really well and my tan was great! I wasn't crazy about the fragrance, cherry.",
    "I was a bit skeptical when I saw how inexpensive this mirror was compared to many others. However, it is a great product! The installation was very easy and included everything needed and it looks great in our recently remodeled bath - works great too!",
    "will be buying more. I knew the polish was great and so it thisWorks best if you remember to put it on dailyreally helps my dry nails",
    "This has got to be the best product for its stated use. Relieves itch and any other syndrom right from the first wash, and you will notice significant improvments in your condition within a week. I used it daily for a week and my scalp's never felt better.Also, for best result, go through shampooing of your scalp twice, as instructed. You will realise that in the second wash, with all the scalp grease gone, the shampoo lathers much better. Leave it on for several mins and you're good to go.",
    "I have been buying this cleanser for years. It has a gel consistency. I squeeze about a quarter inch onto my fingers then wet with water, rub onto my face and rinse off. It cleans without drying and I love the fresh orance scent. I have been using this product for about 5 years. My skin stays soft and breakouts have become a thing of the past. I would not hesitate to recommend it to anyone.",
    "The Chi is one of the best products I have ever purchased. It is wonderful and controls my hair without leaving it too flat.",
    "I purchased this for my wife. She has very curly hair - she loves this product. She has tried Aveda, Nexxus, as well as many others but nothing works as well as the Matrix products for her.",
    "I love the sex bomb ballistic!!! It turned my bath water a hot pink color and smelled yummy. The name sex bomb is somewhat deceiving though, because I didn't think the smell was necessarily \"sexy\". It was more of a sweet, yummy smell. It has a rose that floats around..the idea of which is neat but the rose felt totally disguisting and smooched all up when I touched it. BUT the water color and smell where enough for me! I will definately buy this product again.",
    "I have been slowing switching all of my families cleaning products over to Method products. They clean well, have nice, fresh scents instead of choke worthy chemical scents in most \"toxic\" cleaners, and come in very mod, clean line, eco friendly packaging. Method has made it easy being green.I gave sweet water a 4 instead of 5 because it was a little too \"flowerey\" for me, but you may like it. Please remember to either recycle or reuse the bottle. Like the other reviewer, I've reused the foaming bottle by putting about 1/8 to 1/4 of method dish soap and the rest of the bottle with water (fill slowly so you won't make it foam out of the bottle.)4 stars!",
    "This is a very remarkable product. I first got wind of it on acne.org. A member of the website explaiined that she had been using it for for her acne scar & said it seemed to work great for her existing acne as well. So I decided to give it a try. Needless to say, this product didn't really dissapoint. This product doesn't overdry & after you use it, it leaves your face feeling fresh and clean!",
    "I really like this procuct the only thing I have a complaint against is that it doesnt stay on long enough and you have to spread it evenly with your finger tip after application with the roller ball. To make it work the best, is to put it on even it out with finger and than put on a light clear gloss on top!, that makes it stay on much longer!",
    "This is a great product that gets positive results. To avoid introduction of bacteria, I would suggest packaging it in a tube rather than in a tub.",
    "I have used this product few times now. First time by a professional, at that time was great, second time I did it myself.. well was good enough, few weeks later I dyed my hair and no falling or anything. But do not abouse the use of it.. If you comb through too much and dont do it properly, you will loose your own curly texture, as it re-grows.",
    "Huge bottle for cheap and smells really good for the price...been one of my favs since I was in middle school!!",
    "I used this product and while I found it to be a good sudser, the scent was a little too over-powering. I liked using the liquid as opposed to bar soap though. I'd consider using it again, maybe just watering it down a bit.",
    "I dont have much gray hair, but even then this doesnot work to coverup gray. There was no change in the color for hair even after keeping it for 1 hr as instructed. But All my skin got really dark, and it is really looking bad ( like a scar now) I hope it will get back to normal with 2-3 shampoos. Dont buy this product at all. It is useless.",
    "I just love this brush!! It was always a struggle to brush my daughter's hair. She complained it hurt too much. Ever since I got this brush she is brushing her hair all the time. She looks put together now. This brush is a lifesaver!",
    "Like many women, I am very picky about my hair. (I have baby fine highlighted and lowlighted hair, but a lot of it.) I tried the Pureology Hydrate after it was recommended by my colorist who promised it would help my hair retain that fresh from the salon color.Of all of the pureology lines, the hydrate has the least offending scent. I tried samples of all of the pureology lines, before purchasing the hydrate line and many of the pureology products actually smell terrible, which made it hard to use on a daily basis. However, the hydrate line's conditioner has a minty smell (think aveda's rosemary mint fragrance). I have used this product for the last three months on a daily basis.After daily use for two weeks, I felt that my hair had a film, a residue. My hair felt like it had an enormous amount of product in it, when I hadn't. I would then have to use a clarifying shampoo such as Bumble and Bumble Sunday Shampoo. When I asked my colorist about the film, she stated it is because the pureology hydrate line is geared for people with seriously damaged hair and is fabulous for healing such damage. She admitted that if your hair is very healthy, then it can be a bit much for daily use.I gave this conditioner three stars for the following reasons: (1) the residue, and (2) this conditioner is expensive for the what you actually get. If you're willing to pay this, then pay an extra $5 and get the kerastase bain satin.On the positive side, (1) this product is 100% natural and (2) my color did look fabulous.Currently, I am using the Redken Color Extend and feel this product works just as well for my color, smells better, and is more reasonably priced.",
    "I love the parafin bath. It is every bit as soothing as I had expected. It helps me to endure the issues in the joints in my hands. I recommend this item to anyone with aging joints.",
    "Clinique is the best when it comes to grooming and makeup...it is hypoallergic and can be used by most anyone. This particular eye shadow duo is a smart choice since the color is subtle and not stark. My grandaughter who is starting to use make up will be so please with this product.",
    "I bought this as a valentine's day gift for my husband and he loved it! Speedy delivery and no problems with product will order again in the near future.",
    "I purchased the Ion steam hairsetter after reading all the reviews. Love the product! My hair is curly in a few short minutes. I only have one complaint - the foam on the rollers tend to wear out quickly. I wish they sold foam replacements!",
    "Not sure what the vaseline part is about - but lever 2000 is good stuff. It is soap. Smells nice and is gentle enough for me. Works great.",
    "It cleanse even the most stubborn make up on my face though it does sting my eyes. I would recommend neutrogena eye makeup remover for those of us looking for a gentle yet effective way to remove water proof mascara.",
    "I love evrything about it except that the light is not bright at all. Other than that its perfect for my needs.",
    "Nice iron. Heats up fast and doesn't fry your hair like other ones do. Love the temperature settings.",
    "I have extremely dry, sensitive skin as a result of a bone marrow transplant. This product has been wonderful for me. I can put it in my bath and soak for deep moisturizing or I can rub it in like lotion after a shower. It does not make me break out, itch or have other problems.If you have sensitive skin, this is a great product for you.",
    "Seller did what they said they were going to do with no hidden or surprize charges. Doesn't get any better than that.",
    "I use this after I clean my face with Sebamed Face and Body Wash & this product is the perfect follow-up. It's super light & non-greasy, yet it completely hydrates my skin & makes my face feel super soft. I really cannot say enough about Sebamed's products; they have completely changed the look & feel of my skin!",
    "I am trying to live more naturally, but I love dying my hair jet black, so this time, I tried Naturtint.I didn't experience any allergic reaction or burning and the color appears to have turned out very dark.That said, the product smells unpleasant, it took multiple washes with my Aveda shampoo to get it to go away. It also is terribly hard to wash out. You'd think a natural product would be easier in this aspect. It took about 15 minutes (maybe 8 or so lathers) of vigorous washing with shampoo before the water began to run even semi clear. After all of this, there is still some left in my hair. How do I know? It's on my pillows and when I put my hands through my hair my fingernails come back dark brown and little brown flakes of product come tumbling from my hair. Attractive.On top of all of that, my hair is super coarse and had no shine to it until I applied lots of my usual shine product.As much as I wanted this product to work, and as superior it is to some other natural dyes, it still doesn't measure up to the big name box dyes. And hey, it may be more natural but it's still made with tons of chemicals. Might as well go with a brand you're familiar with that won't degrade the quality of your hair and stain your stuff.",
    "I have worn Provocative perfume for several years and was sorry that I can no longer find it in the stores. I did order some from Amazon last year with no problem. What I received this year was NOT Provocative. Same bottle, same box, different content. The Provoative I have been using is clear...This is amber. This fragrance is mild, though not offensive...but it is not Provocative. Who knows what I really received. I would send it back but it is too much trouble. I am disappointed!",
    "I have been wearing sleep masks for over ten years. This one tops them all, quality and PRICE! I usually pay about $100 for mine in the past. THis one is much softer, with the velvet cushion framing the entire mask. Very comfortable. I will only order this one from now on. Just love it!",
    "If there were no stars I would giv it that. They nail clippers are very dull & does not work at all. I will NEVER again purchase anything from that brand again. This product belongs in a dollar store with the price of .75 cents U.S. currency. Never buy anything from Pakistan. Product is pure garbage..",
    "I love that I can stretch out the scent by lathering on the lotion. Feel beautiful, elegant, sexy and royal!",
    "This is a wonderful compact hair volumizer! I take it everywhere! Heats up very fast. I wish it had metal clips, but still very good.",
    "Works great, leaves skin soft, I love the little jojoba beads! You don't need to use very much either, seems like the bottle will last.",
    ". . . it feels so greasy, like I have a layer of baby oil on me. Some people like baby oil, but I want to be able to touch my clothes and bedsheets without worry. My friend gave this last Christmas and I wanted to like it because it has a great reputation. Now, it just sits in my medicine cabinet waiting for me to toss it out. For hand repair, I recommendUpper Canada Soap And Candle Naturally Whipped Hand Repair, Sweet Vanilla Fig, 4-Ounce Tubes (Pack of 2).",
    "Been using this for years, it is a wonderful perfume.At 31$, Amazon's price is highly competitive.",
    "Great product, I would recommend it to any one suffering complete hair loss. It's not the easiest thing to use, but once you get the hang of it, it's a snap. I have Alopecia, and I apply it to the welts of hair, to cover the top of my head, can be a little irritating to the scalp sometimes, but if you use a skin protectant, you will be fine. I search the web all the time, to find another product. Recently I found another adhesive, but I have never tried it. I believe it's by walker. I might give it a try in the future, but for now the no tape works very well for me. But I am open If there's someone who can recommend somethinf better I am open for it.",
    "Gave this to my God daughters for Christmas and they rave on the compliments they receive and when I'm around them and they have it on, it smells different on each of them, still smells wonderful",
    "the perfume smells great and so sexy, She loves it! I think I am going to buy it again.the best cologne ever.",
    "This product is nothing short of a miracle. Who knew that achieving perfect skin could be so simple? Not to mention...cheap! All my life I have had perfect, even, radiant skin. When I hit 18 my body started going through hormonal changes. I woke up one morning with cystic acne and have been battling it ever since. It has been an emotional journey to say the least...I was so desperate to salvage the beautiful skin that I once had, I bought just about every drug store cleanser, moisturizer, toner and serum on the market. Of course I also had the clinique 3 step system, a shrine of not so \"natural\" origin products, and I even gave proactive a shot. Not only was I spending an unimagineable amount of money in hopes of finding my miracle product, I was stripping my skin of it's natural oils and applying hundreds and hundreds of toxic chemical ingredients DAILY that only made my condition far worse than it really was. I had gotten so deep inside of my head that the acne was all I thought about. I started extracting my blemishes and eventually it became a compulsive behavior, I was constantly picking at my skin. It wasn't until months after that I realized what I was doing to my skin and the emotional and phsyical damaged I had caused myself. That was the last straw for me. After doing some research and hearing other peoples success stories, I decided on going the natural path. I threw all my products away, every last one of them and started a clean, simple regimen. It was a huge step for me. After almost a year of experimenting with natural remedies for my skin, I couldn't be happier with the results. I have mother nature to thank for this. I use this cleansing bar morning and night. I just wet my face, rub the bar between my hands for 2 or 3 seconds and I have enough product to create a rich, creamy lather. A little goes a long way and this bar will definitely last you. Tea tree tends to be a bit drying so be sure to follow up with a moisturizer. I use raw african shea butter and it has greatly attributed to healing my acne and scarring. Let me tell you, it's one helluva comination. I haven't had a breakout since using this cleansing bar and the hyperpigmentation from my compulsive skin picking habit has faded completely. This is a true life saver. I can safely say I have found my miracle product. Please don't ever discontinue this!",
    "This product is definitely not worth the money or effort to try. My hair is already red and it didn't change my hair's color unlike other reviewers, but it didn't really do anything. My hair is no shinier as the package promised. It didn't do any visible damage to my hair, but I'd rather have spent the money on a better product. Try something different if you want smoother and shinier hair - this one's a dud.",
    "I didn't really care for it because it seemed to overcondition my hair, making it feel like it needed to be washed soon after I washed it. I wash my hair daily and don't condition it daily, so it's not suitable for me. However, if you do use a conditioner daily, it may do the job for you. The scent is nice and it lathers well.",
    "I absolutely love my Spin Spa !You will run out of hot water, before you will want to put this down.That's it in a nutshell.",
    "If you are looking for a small one that is quietish and does the job, I doubt you are going to find a quieter one for its size. I like mine very much. Please note: The picture shows a grey one, you are going to recieve a dark red one in mail, amazon really should be aware of this.",
    "Scented soaps, just like perfumes and colognes, are a subjective matter and as such; I cannot actually criticize or say this is a bad soap, because in and of itself- it is a quality soap-just too strongly scented.If you like Patchouli or know others who do and would like to consider this as a something for your personal use or a gift, keep in mind that this soap bar is heavily scented.I bought it and the response from those who used it, was that the scent was too overpowering for their taste(it actually permeated one floor of the home after someone used it in a shower).Now- if you like this scent and you like it on the strong side- this could be a good thing.If you like it more subtle, than this bar of soap is going to smell overpowering to you.All in all- if you consider buying this, think of the Patchouli scent and how strong you enjoy its essence, because this brand is definitely not subtle.",
    "I have very fine hair and find I need to use a little hair spray or it can look very flat. I like this hairspray because it does hold my style well, but does not feel heavy or sticky.",
    "I bought this perfume in the Bahamas 3 years ago......simply because my name is .....Lolita. It took me a few days to get used to the woodsy scent and the first time I actually had to wash it off. Now, I have three bottles of it. I recently bought Lempicka's newest perfume \"L de Lolita\" and absolutely love it. It has a caramel-vanilla scent to it while Lolita has more of a whimsical smell. \"L de Lolita\" is actually my favorite but I alternate both perfumes so that whenever someone asks me what I am wearing....I say Lolita. People find it amusing as neither fragrance is sold in the city that I live in. I also love the bottles of both fragrances. There is also \"Lolita Midnight\" though I have yet to try that one.",
    "I really loved this soap! It smelled great and left my skin feeling good. It was great quality and if you are looking for a natural soap I would recommend this soap and brand.",
    "I used the rogaine foam for 6 months, didnt really notice a difference unless it was psychological. Im just starting to bald in back (at the crown). So it was hard to actually get the foam on my scalp rather than hair.This liquid seems better because it's easier to make contact with the scalp and you dont have to get it on your hands. Just started using it so dont know yet how well it'll work for me. Also the liquid seems to run down the crown of my head to the back of the scalp i can feel it. Luckily, I still have hair back there to catch this liquid that is running down.Also makes your a hair a little oily and can make your head itch a little.",
    "As an experienced professional \"wax-ee\" I figured I had watched my waxer give me bikini and Brazilians enough times to do it myself. So I ordered what I found to be the closest to what I get done, which is a hard wax. The products are great. It took my crappy microwave much longer to heat the wax than the directions suggested, but the wax smelled nice, kind of \"woody\". The pre/post waxing oil was great and whatever is in the wax that numbs your skin is AMAZING. Despite my fear of totally annihilating myself with pain, it hurt LESS than when I get it done professionally?! I don't know how, but I think it is the wax.I have coarse hair in my bikini area and the hard wax worked wonderfully, it literally got all the hairs. I was a tiny bit messy, but the wax hardens so quickly any little drips on the bathroom tile could easily be pulled off and put back to be re-melted. I think it was just lack of experience, because I am a very neat person!Over all, very happy camper here. Be sure to read ALL THE DIRECTIONS if you are not an experienced waxer or an experienced \"observer\" of waxing. If you put too thin a layer on, heat your wax too hot, try to pull it off too soon... you'll have some real problems.. ouch.",
    "My thumb-sucking daughter \"tasted\" this product only about 3 or 4 times before deciding it wasn't worth \"tasting\" again. She immediately stopped sucking her thumb while awake, and has severely reduced the amount of thumb-sucking she does in her sleep, too. Of course, it does need to be reapplied to maintain its usefulness, but with a pretty pink underneath it, she doesn't mind at all.",
    "I have had one of these for yrs. I love it. I need to get another.It is easy to use!!!",
    "I was surprised I could buy double the content for the same price as the 1.7 oz on Amazon.com It is a great Eau de Parfym for the price.",
    "I would say this is one of the best colognes I have ever used. Its subtle aroma is a perfect choice for men.",
    "This product was recommended to me while I was getting a facial. A tiny bit goes a long way, so although this is supposed to be a 30-day supply, it should last me a lot longer than that. It smells great and goes on really smooth. It's easy to put exactly where I want and it absorbs quickly. I have oily/combo skin and this doesn't make it worse or dry anything out. After the first use, the redness in my cheeks was drastically reduced. And over time, i don't feel the need to wear foundation everyday. It has evened my skin tone to the point where I just use a little powder as my base. They have a customer for life.",
    "I have bought so many of these irons and never had any luck. My step-daughter came to visit and I tried hers and loved it. So when I saw this one for sale I bought it. It works great! My hair will stay straight for several days . I have also noticed that when I do wash my hair and dry it, it drys straighter too. I would recommend this iron to every one!!",
    "The mirror is great and sturdy. However, I accidentally bumped the mirror (not hard) and the light stopped working. I replaced the bulb and it still doesn't work. I've owned it for less than a week!",
    "This item is great for travel and has the same heating results as my regular size hot rollers. Great product!",
    "When I first opened the container and saw how small these pads were I was like uhhh this is not going to work for me!...But these little pads pack a punch!..lol..They easily remove mascara and even false lashes slide off with ease! This may not work for some people but it works for me!..The pads are super gentle and does not irriate my eyes like some other products have in the past!..I have super dry skin and I love how my face looks after I use these pads..I'll remove my make up with the Almay Moisturizing Pads then I rinse my face with luke warm water and my skin glows!...Love Love this product!!!",
    "I bought my first package on a lark and they immediately became a necessity. I've used them in hot dry and hot humid places. I use one every time I board an airplane, first cleaning my hands and then the armrests and table. Then I leave the towel in the seat pocket as a tiny air freshener. I give them to friends and strangers. I gave one to a woman in Japan and she became a dear friend. They are well worth the price to avoid the drying of alcohol. I've tried every scent but this is my favorite.",
    "This hair coloring brand is the best I've ever used and I've been coloring my own hair for 23 years. I am very grey and have long hair. My hair feels softer than it has since my teens. Love this, and it lasts.",
    "Was hard to find this and feel confident about the purchase based on the reviews. It's odd but that seems the same case with all the perfumes and colones. This smells great, just like the Wife knows and loves - and so do I :)",
    "Great product, easy pleasant transaction! Highly Recommend!! Great value for the money! Not a greasy feeling lotion, soaks right into your skin! Great stuff!!",
    "This oil helps my back pain and shoulder pain . I love the smell and it works very well for me.",
    "I have had problems with blackheads on my nose. I have used alot products for it and they never seem to work. But Clearasil Daily Blackhead control pads work. I got it yesterday and I used it that night. I used it in this morning and tonight. I could see that the blackheads on my nose were gone. I was so shocked. This product really works. It's worth the money.",
    "They say you get what you pay for and I agree totally. I have always just thought a blow dryer was a blow dryer and then I bought this one...boy what a difference!!! Even though I have a short hair cut I still need my hair to dry as straight as possible and the heat settings on this is fantastic!! Great investment!",
    "THIS CREAM IS WONDERFUL, ALONG WITH THE REGENERATING SERUM FEELS LIKE NO NIGHT CREAM I'VE EVER USED. I JUST LOVE IT.",
    "I try everything new, hoping to find something that will show me some results right away and give me back the glow in my skin that seems to wither away as time passes (and I'm only 36!) --Anyway, when I read about rice bran, I thought why not - this brand contains a lot of rice bran - it's like the 2nd ingredient in everything after water, and there is nothing else in it I couldn't pronounce. The stuff smells great, and goes on non-greasy, especially the face cream it's like my face is so thirsty for it that it just sucks it all in. The TrueRenu store gives you cute little pahmplets with details on all the ingredients, and insturctions (the packages are written in Japanese so you need to read their instructions) - and I even got a free gift of green tea - yum!",
    "I've tried it 3 times - first 20 minutes, nothing. Did it again for 30 minutes. Nothing.Next day I did it for 45 minutes - absolutely nothing.No gray was covered.This product is USELESS. Don't waste your money. I'm bringing it back to Rite Aid.",
    "I am a regular user of Obsession For Men so I tried this but it doesn't work for me. It's hard to pinpoint the exact smell but it's a musky/woodsy/insect repellent smell and it's not getting any compliments from the ladies. Oh well.",
    "A nude color with a touch of blush - I always gets compliments from other women when I wear this. Looks very pretty, professional and well dressed.",
    "I love this straightener! I have just below shoulder length hair, so it doesn't take too long to do. It works great on my wavy/curly hair. It takes about the same time to dry as a blow dryer. I've also had less split ends since I started to use it because the heat isn't as damaging.",
    "I was tired of dying the gray in my hair which usually meant I colored my whole head. Finding this product seems to be a miracle for my hair. Already I see where my hair is turning back dark brown. What is this method and why haven't I heard of it before? I'm impressed and very satisfied, even down to what seems to be more thickness of hair.",
    "I use this comb every single day. It detangles my long hair without creating any damage or breakage because it's so smooth. It is a tool I never want to be without!",
    "I absolutely love this thing! It actually works as a nail cleaner, the file is great, cuticle pusher is great too....and a pen?!?! It is so small you can fit it anywhere, and has come in handy soooo many times. I bought the regular pen size by mistake last time I stocked up and the only difference is the size of the pen. I prefer the keychain bec you can fit it in smaller places, but that's the only reason. I just take the keyring off. I add these to so many gifts and also use as stocking stuffers. I will be using these as shower favors as well. every woman needs one!",
    "After many years, I have finally retired my old hot rollers and am very glad I did! The velvet flocking on the rollers seems to be much gentler and I love the quick heat-up time. My hair is medium length and the bouncy curls I get from using these rollers is great. I occasionally use my flat iron and/or Instyler instead (when I have more time to fuss over my hair!) but these are definitely my everyday go-to choice.",
    "I used to get these in costco in 4/5 packs, and it took me FOREVER to finish them. I'm glad i find this same brand here and i can buy them individually with the same value.",
    "First let me say I like both products very much. But to compare the two - both smell really good but I like the smell of sun self better! It smells like cherry while the other smells like coconut.. Application- I think fake bake is easier to apply, but I think you have to use more of the fake bake product to get the same deep dark color as sun self. Sun self you definitely don't have to use as much so that means you have to buy it less often! Both of the color results are beautiful, but sun self is sooo deep and so natural looking so as far as color goes they are almost even but sun self just looks so much deeper. It takes longer for me to get sun self on though, I don't like that. Sun self takes me about 25 min to get it all rubbed in and even. Fake bake takes maybe 10 min. Either way you can't go wrong - just be careful with the sun self, could easily be streaky, while fake bake is goof proof ( so easy it's unbelievable )",
    "Christmas gift for my son. I know he love's it, this is his favorite. It had a great price at the time I purchased it.",
    "I love this cleanser! It removes my makeup and feels great on my skin. It is really the only cleanser I've found that kept my T-zone acne under control.",
    "i could write 10 reviews on how beautiful all their stuff is. i have many eyeliner shades and use their mascara. best out there!",
    "it works well, the doctor recamended it for my daughter for here skin disorder. she loikes it it seemes to be working",
    "I bought this as a gift for someone at Christmas,they loved it! I know it is actually the brand of the scent,not the seller,that makes it a bit expensive,hence the 4 stars.It got delivered quickly.didnt have to go out in the cold to the store and wait in line to get it either =)",
    "I tried other skin care products andnoticed my results were not good.Back to Dr. Hauschka products and lifeis rosey again !! Not to sound likea commerical, Dr. Hauschka makes a hugedifference for me. Suggest the wash,toner, then moisturizing day cream.",
    "Although I am a women, I actually found a product that works for me! I have tried other ones such as Nioxin and Elsierra and those did not work for me at all. My hair actually got thicker using this product. I have used it for a year and a half. The only mistake that I made was that I had slacked off in using it for a period and my hair thinned out again. So I had to start over and my hair is growing back out again. It is amazing stuff for me.When putting on the product, I do find that it is a bit greasy and kind of smelly (though the smell is tolerable). I just put it on right before bed and wash it off in the morning. No problem.For me this is a great product. I'm sure there are products that work for some but not others. I have heard personally of other success stories using this product even for those who had propecia.Hope this helps!",
    "Many hair products give me headaches with the fragrances added. Unscented does not always mean that as masking fragrances are added to cover alcohol smell....but this is truly fragrance free and also works great to hold styles!! Highly recommend this to anyone with allergies to scents!!!!!",
    "This perfume has a strong, clean, very fresh, & delicious apple scent, & who wouldn't like such a cute & unusual bottle, but somehow, the scent just doesn't last for than more than a min. or 2 on both myself & my clothes.... (I've read about this particular kind of problem in some other review sites, also....) Even inexpensive Calgon body mists lasts for hrs. & hrs. on me, but this expensive scent just doesn't seem to.... (As a matter of fact, this fragrance seems to have 1 of the most fast disappearing scent that I've ever encountered in my 30+ yrs. in life....) What a shame....",
    "I bought because it was supposed to be soft and comfortable.It is made of carton, it is tough and REALLY uncomfortable. Even worse if you plan on using them with glasses, since they stick out and don't let you put them on.But even if you don't wear glasses, they are horribly hard and cheaply made. I would have gained the same quality from cutting a piece of cardboard box and uniting it with rubber bands.Botton line, don't buy it.",
    "You can get bumble and bumble thickening shampoo cheaper,on the bumble and bumble site,why pay more here?It's only 25 dollars for a 8oz bottle",
    "Looking for a really good cream? This is it! The texture and feel are wonderful. It is not sticky or greasy. I use it on my face, hands, feet. After spending 4 times more for other creams, a friend gave me a jar of Fruit of the Earth Aloe Vera - I was amazed - good results - no breakouts! Even better - I got it on Amazon and never had to leave home. Try it - you will love it.",
    "I looked into this shampoo because it was chemical free. I was growing out my hair from chin length, and now, 4+ years later it is at the middle of my butt cheeks and my hair is full and thick (I've kept it trimmed every 3 months, now every month it's trimmed), and my hair is in the most excellent condition AND it's longer thanks to this shampoo. You can get the optimal half inch of growth per month with this shampoo (avoid putting conditioners on your scalp, or styling products). Coconut oil, petroleum jelly, or raw liquid egg white can help tame frizzies or hold hair without hairspray, gel, mouse. My scalp has healed from dandruff and consequently, hair loss has dramatically decreased (adding Tea Tree oil to your shampoo helps it froth up more as well as heal scalp issues). I refuse to use another shampoo, as my scalp knows that I have given it chemicals and detergents that irritate it immediately. If you want to grow your hair long, increase new hair production in balding areas, or help your dandruff, THIS IS THE ONLY SHAMPOO you will ever want or need. Baby shampoo will still cause hair loss and irritation. Try this shampoo with any essential oils added to the bottle (I also loved adding cinnamon bark EO), and look into essential oils that increase hair growth production!",
    "I have dry skin and bought this product to help. Good when put on after a shower. However, wears off within a couple of hours. Makes shower VERY slippery. Smells good. Wont purchase again.",
    "I am sorry to have to write this as I have used this product successfully for years now, but Amazon just wont listen and fix this issue with the bad batch. I am now sending back my 3rd bad bottle of this stuff. It must be from a storage/environmental containment issue. The product is foul and smells of plastic. I have gone through many batches and know when something is wrong. Amazon, I will continue to send this product back until you send me a good one.Buyers, if your product does not smell right, send it back! Do not take chances on hurting yourself or your skin. I know this product and it should have a very light and minimal smell, not a strong chemical or plastic odor.When Amazon fixes this issue, I will revise my review. Until then, unless you want to deal with sending it back over and over, I recommend you look somewhere else for this product.**UPDATE** 06/15/2011Finally, a good delivery! I figured I would give it another shot with a new vendor to see if they can store and ship the conditioner properly and they did. I ordered from Salon Products NY and not only did it come super fast, but it is fresh and perfect. As many of you know from my comments and other reviews that this product appears to have stability issues with distribution. I am hoping that Salon Products NY sticks with it because I plan to order from them when this batch runs out.**",
    "Clarins has always been one of my choices for men's skin care. I slightly started to get crows feet and since I began using this product they appear to be less visible and my face gets a fresh look. I am not a morning person and I look horrible when I get out of bed. Clarins men wrinkle control tightens my skin, rejuvenates it and, most of all, makes me feel good! Highly recommended for ages 30 thru 40.",
    "This is an incredible product. If I could afford to, I'd use it as a body cream as well.",
    "I have a HUGE forehead and I although it was naturally large to begin with, it started receding little by little due to stress (but I'm only 26). I started using this 3 years ago and it has done an amazing job bringing back my baby hairs on my forehead and now it's growing more and more. I love it. My sister notices the HUGE difference because I only put up my bangs at home. But she ordered some of this too (not because she has a large forehead but to prevent from future hairloss) and it worked even better for her. This is really amazing. :)",
    "So I went over to a friends house to do the bleaching (My first time and I didn't want to do it myself just in case I messed up) I have this light brownish color and I left the product in my hair for about 30-45 min and My hair came out the perfect color. It has high lights and has different shades of blonde. IT WASN'T BRASSY, so I didn't need a toner. I put Punky colour in my bangs and it turned out really bright and pretty :) over all I love this bleach and I am going to use this again. I recommend it.",
    "Very light, won't damage hair, and will give you beautiful hair with a healthy shine. Great for curls, giving them bold, soft texture",
    "I have it by luck. check out e-bay....while supply last. I don't have much left only but 18 of it.",
    "If I could give this 0 stars I would. I have thin blond hair and when I first started using this I had good results and told my sister she had to buy a bottle too. Half way through the bottle I started to have MAJOR breakage. My hair became so brittle I had flyaways all over the place from the breaking. The exact same thing happened to my sister's hair and she's not happy with me as you can imagine. If you want to risk your hair go for it but I wish someone had let me know about the damage this shampoo causes before I bought it. I started using Avalon Biotin thickening shampoo after I tossed this product out. Not only is it less expensive but my hair is finally starting to get healthy again and growing back. Save yourself from damaging your hair and go with the natural Biotin.",
    "I have tried many hair sprays and all of them caused my scalp to break out until now. This is the best hair spray on the market that I've tried. Very happy about this too as I have spent a fortune trying different hair sprays over the years. Free and Clear is the only spray that does not stink and does not cause my scalp to break out. I have sensitive skin so it is very critical that I have something that works for me. I highly recommend it to anyone with sensitive skin allergies like mine! My only complaint is that it is not sold in stores locally so it has to be ordered online. Great product! Try it and see for yourself! Enjoy!",
    "Pro's: works amazing, lasts longer than other deodarants/antiperspirants, versatile (can be spayed on clothes or other parts of your body) leaves no residue, feels very light, like nothing is on your skin, all natural. The bottle doesn't say, but I feel that 2-3 sprays on the underarm and rubbed in, works better and easily over 24 hours. Only 1 spray seems to not work as well for me.Con's more expensive than other deodarant but also lasts longer so I feel this is a wash, Cap is hard to get on and off, not in stores in USA but I got it quick from dr. mist web site (drmistusa.com)and shipping was cheap! Works better if your armpits aren't clogged with aluminum from residue from antipersperants. When you order, switch to just deodarant without the aluminum while you're waiting for it to come in the mail. It can soak in your skin better if the skin isn't clogged with residue from the previous antipersperant. dr mist doesn't clog pores but needs to soak in skin. Just exfoliate with a washcloth to get the old residue off for a few days and it will work better.2/12 I still think Dr. Mist is great but I made my own deodarent since using Dr. Mist that works even better. It's coconut oil (virgin) mixed with baking soda. Much more coconut oil than baking soda. You only need a little or you can just rub in the oil and then put a thin layer of baking soda which will stick to the oil. Not too much baking soda or it will dry out your skin. It works amazing. Leave me a comment if you try it. You can't get any more natural since you could eat both of these ingredients.",
    "Thank you. this helped when I had migraine pains in the left side of my brain. It took most of the pain away to cover eye.",
    "I started using Regenerist when I was 40. My skin has always looked older than I am, and I received a couple of free samples. You use such a tiny bit that the samples lasted me about 10 days.My skin looked and felt so nice after 10 days that I went ahead and bought some. I thought it was too expensive at the time, but that little tiny bottle lasted a long time!I've been using it for six years now and I can certainly tell when I run out. This helps with the little tiny patchwork of lines that show up on my eye lids, and really makes my skin soft and somehow more alive looking.",
    "I use this oil on my hands during the cold weather. As long as I'm faithful to use it at least twice a day I don't have the skin cracking and bleeding that I typically had all winter. What a relief. I even keep some at work.",
    "My husband has really dry feet. I call them \"hobbit feet\" but the AmLactinlotion helps a lot. It is kind of expensive which is why I gave it 4 starsinstead of five. It is a good product and my husband's feet really hurtwhen he doesn't use it.",
    "I purchased this to prevent my son from sucking his thumb. We also purchased the thumb guard. We only used the Mavala once so I am not sur eof its long term effectiveness. The one time I did use it it worked fine.",
    "The product dries pretty similarly to a gel. At the price and quantity, I wouldn't say its anything special. I'm still going to shop around for a better hair product that sets better.",
    "If you shave your head regularly, there is absolutely no reason why you shouldn't have this in your bathroom. It's such a novel concept, but something so intuitive, you wonder why you didn't come up with it yourself. Anyone that has trouble with it is probably putting way too much effort into learning it. It really should not be that hard. I just imagine myself rubbing gel through my slicked-back hair. lol. It allows me to feel with my other hand where I've been and where I need to go. And that's essential for the back of the head where you can't see. The wheels may seem to have only been added just for the sake of design but they do serve a purpose. I believe they're the most important part of the HeadBlade. Gently resting them on your head allows you glide without much pressure. Too much pressure causes bumps, cuts, and razor burn. I hardly get those now. And the razorblade HeadBlade provides is outstanding. I'm well into my 2nd month using the same razor and my head is just as clean-shaven as the first day. I highly recommend this.",
    "It's true! This fragrance is different from others because it's subtle, but distinct and wonderful. This fragrance is breezy, clean, and cuddly. Love it and highly recommend the ebubbles seller!",
    "Before buying this product, I used to wash my hair everyday. If I didn't, my scalp would get extremely itchy. Now I wash my hair every 2-3 days and no itch! It helps a little with the dandruff, only because I'm not scratching my scalp every 5 seconds. But by day 3 I'll see flakes in my hair. I have dark hair though so it's more obvious.",
    "I have color-treated hair. This conditioner is the best I've ever used! My styling brushes glide through my hair, while blowdryer. No tangles, tugging or pulling! I like the like scent of it -- not too overpowering. Just enough to complement my other scent layers of Philosophy's grace series. I highly recommend!",
    "A great deep conditioner. It also smells nice and has a tingle due to the peppermint. The only thing I don't like is the irregularity in color. Sometimes it is a bright light pink and other times it is a muted orangish/pink color. I believe the product works just as well no matter what the color. But where's the quality control? For any price, but especially for this price I expect the exact same product every time.",
    "I had researched this product and it had a surplus of great reviews. Here is another! Thanks Amazon!",
    "The brush works well. I did find that, even though I have thin hair, I had to put the setting to the highest and push the \"boost\" button. I thought it would curl faster, but it does the job.",
    "This DVD is designed to be used with a workbook which did not come with the DVD. While I felt the overall message was very good, I did not have the workbook. So when the DVD paused and asked me to review the workbook and answer questions, I was not able to do that. When I purchased the DVD I did not know that the workbook was required too. Although i appreciated the references to God and the Bible, I did think a wider audience could be reached without so many references. When viewing the DVD, I noticed I had to return to the main menu to continue. So it would be great if that annoying glitch could be fixed.",
    "This dove soap leaves your skin sooooo soft and glowing!!! I have sensitive skin but also want a defoliator that will be gentle enough for everyday use and am so glad that Dove came out with this line. The bodywash is also fantastic and leaves your skin smelling sooo fresh and so clean!!!",
    "As with any perfume, the scent of it on your skin is what determines how the end product smells. I didn't particularly like how it smelt in the bottle and when I sprayed it on myself, it got even worse. I would recommend getting a sample of this first because it is such a strong scent that you are either going to love it or hate it and once you have it on it takes forever for it to go away.",
    "This soap is amazing. Put out a bar in your bathroom and the second you walk in you smell the most heavenly fragrance ever. To die for....",
    "This cologne is of high quality and smells great, and my order arrive way before the time specified. This is a really great service from Amazon. I would recommend this item to all females out there who have a problem choosing a great cologne.",
    "I started using this with the Progaine medication five years ago, it has been great. I also used the conditioner to, I found the combined shampoo conditioner not as good as the two separate steps. AMAZON has been carrying this product right along, and did have the conditioner, but it seems to be not available anymore, I hope they get it in. They took my name and said they would tell me when it comes in.",
    "this is the greatest cologne every , the comments rain in all night , its awesome , put the topping on my style",
    "I have slightly oily skin and sometimes it peels during the winter. So I figured I would give this \"gentle\" exfoliant a chance. Well let me tell you, it definitely did exfoliate but it made my skin SO DRY that within 2 weeks of using it, I started to realize I began having very light minor WRINKLES. WRINKLES!!!!!!!! I'm 20 years old!!! I was horrified when I noticed 2 weeks later and stopped using this immediately!So if you have dry, peeling skin, do not use this product. It'll only take away all those essential oils that keep your skin looking young and fresh.",
    "Good Housekeeping magazine gave this a great review so I thought I'd give it a try. I had no idea what the $170 hairbrush was they were comparing it to, but there's no need to pay that--this \"imitator\" is wonderful! I love the way my scalp feels after brushing. I also got it on sale (10% off all Sonia Kashuk tools at the chain store that carries her line). There was no odd smell as noted by some other reviewers.",
    "As my hair has left my head I just hated to pay full price for a cut,my wife is so much more willing to do the job with this cutter. It is so easy to use and so very clean with the vaccum capabilities that she does not mind at all when I ask for a cut.Thank You Remington",
    "So I am woman who has had to use men's deodorant for a while because the women's deodorants would work well at first but then the scents would react with my sweat (and the pheromones therein) and would produce this really weird musky scent. So, the only thing that has worked for me is men's degree. however, I don't like the idea of absorbing metal into my skin & the natural deodorants simply don't work, in my case.So, I ordered one of these and WOW! No reaction with my pheromones at all and I'm staying dryyyyyyy and my underarms smell the same as the rest of my skin. It's amazing- buy it, you won't regret it. Tip: be sure that you wash the area before applying... from what I've noticed, whatever scent you have before you apply it, that stays.Thai stones rock... :-)",
    "I had problems with blemishes, and a friend suggested this for me, since it had been very helpful for her and her skin.It works wonders, and several friends I have suggested it to, is also very satisfied with this cleanser.",
    "Looks great. I bought two swords for my twins. For now both of swords are broken :)Can not hold side to side move. broken on connection place with handl.:)",
    "The fragrance it is exquisite and it is smells very masculine.The package of delivery it is ideal size.My rating is five stars is:1-Product Quality2-Shipping costs.3-Time Delivery.Congratulation.Thanks.",
    "Loved this sleep mask, and its lovely lavender smell. Had it for awhile and used it every night, until my 4yr old thought she was cool and wanted to wear it out with her outfit one day and it disappeared into oblivion. I will probably buy this again, most other sleep masks seem way too overpriced.",
    "I wear this every night....even helps me sleep in a better position. Just ordered my second one. I wash it as suggested and the stickiness lasts.",
    "All I can say is don't waste your money! I have fine, oily scalp. I just say ugh frizz mess and very drying.",
    "Fantastic shampoo. Everything else makes my scalp itch! my seborrheic dematitis and my excema started to clear up immediately!",
    "I love the way I smell when I go tanning thanks to spellbound. The shipping was fast, the only problem I had was that my blue ribbon fell off and sometimes plastic cap on the inside comes off so sometimes when I squeeze it out, I get a lot of lotion. It does really glide on you body very smooth and it makes your skin super soft. Definitely a great product and I will definitely buy again.",
    "I love it. I feel my hear healthy and nourishing it is amazing i'll keep using and i recommend it.",
    "I started using this product because my child has allergies. I became aware of the various dyes and chemicals used in regular sunblock. Only issue is this is very expensive product. A 4 oz tube costs $11. They should just make all sunscreens free of dyes and parabensfor the safety of human health, and make them available to the common people at a reasonable price.",
    "my sixteen year old loves this gel won't go out with out it.its not as greasy as others. will buy again.",
    "I was a little wary of getting my first hair straightener because I kept hearing about all the bad ones! I didn't want to get an expensive one since I wasn't sure how much I'd use it and the cheaper ones seemed to break or burn hair. This one was perfect for me: ceramic, reasonably priced, and lots of heat adjustment. It's only been a month, but so far it's working great. Now I can put my thick wavy hair into some measure of control and elegance. It's starting to take a little longer to heat up now than in the beginning, and I hope it isn't a sign of breaking, but of being broken in.",
    "The name says it all. I love love love this perfume, it is a perfect scent without being overpowering. I am on my 3rd bottle and will continue to buy as long as I can find it.",
    "I finally decided to spring for an expensive ceramic iron. After reading the reviews and seeing that Amazon had them on sale, I splurged. I can only tell you, it is amazing. I am so done with $20 irons that fry my hair. This iron makes my hair look like it does when my stylist does it.... Worth every penny",
    "I bought this stuff a while ago thinking it would help me with stretch marks. Since then I've researched and found that there is NO scientific evidence whatsoever that any creams can help prevent stretch marks. It's mostly just genetics.Anyway, that doesn't really have to do with the quality of the product (or lack thereof). This stuff is gooey, greasy, sticky, messy and horrible. Seriously, I felt like I was trying to rub vaseline on my stomach and wait for it to soak in. My skin never absorbed it and it was a disgusting layer of sticky slime under my clothes. After applying I had to wash it off my hands because it is impossible to rub this stuff in like normal lotion. After a few minutes I would always end up washing it off my belly too.I tried hard to like this stuff because I hate to waste money. I used it at least 5 times before decided enough was enough and throwing it in the trash. Definitely not worth the price when you can buy Palmer's for much cheaper (and whaddayaknow, it actually gets absorbed by skin). This tummy butter CRAP ended up in the trash can.",
    "I was excited to find this product, and was hoping for something that smelled similar to NARS Body Glow. This was definitely NOT it! It smells more like old lady perfume that's been on an old lady who has been dead for a couple months. REALLY nasty. My two year old (and this is a boy who doesn't even mind the smell of his poopy diapers) got a whiff of it and said, \"EWW, yucky mommy!\" Now, that's pretty bad! With that being said, I do have to give it a little credit. I used it on my hair in the shower (hoping the smell wouldn't linger since I would be washing it out with shampoo), and it made my hair very soft. I can tell it would probably make my skin soft too, but the smell is just too disgusting to ever try that.",
    "This may work for some people, but it did not work for me. I wanted to use it for the occasional large, resistant blemish. I followed the instructions carefully, but this product had no discernable effect.",
    "I have used this product for years and couldn't find it in the stores, soI was very pleased to be able to find it online.",
    "I love the idea of using this for travel with all the restrictions on liquids. It works great, and my only tiny complaint is that it's kind of hard to lather with. It still gets the job done, so I'll jet away with it.",
    "Murad is the only product that I like to use on my skin. I live in the desert and at 50+ yrs. old, I am trying really hard to keep my skin healthy.This product in particular is new to me. I have been using it for about a month now. It seems to help with facial dryness very well and does have a soothing effect. Not too sure about effectiveness for the redness.A bit pricey, but lasts a long time. I would purchase this product again.",
    "This is a decent conditioner. It makes my hair soft and detangles well. I love that it's all natural, but I can't stand the smell. It's a grapefruit scent, but extremely bitter. Other than the smell it's a nice product, but I won't be buying it again.",
    "This is a really good quality nail clipper, but the nails are thrown far away so you need to vacuum clean after each use!",
    "My daughter tried this product and her eyes got swollen. Since I have fewer problems with allergies than she does, I used it and it looked beautiful the first three days... My eyelashes started falling after that... I should probably try a hypoallergenic version (if there are any available).",
    "El mejor shampoo que he usado para mi serio problema de dermatitis seborreica. No irrita, me deja el cabello suave y saludable. Adem&aacute;s est&aacute; a un excelente precio.",
    "I love the spicy, oriental scent of Lucky No. 6. The bottle is unique and it seems you get quite a lot in the bottle. Great for clubbing or a date!",
    "I would never have bought this for myself; my mother-in-law got it for me for Christmas. I was skeptical and didn't even take it out of the packaging for a while. I don't have artificial nails and consider myself to be pretty low maintainence in the beauty department. Anyway, I decided that I should give it a whirl and I have to admit that it works very well. If you're just using it on your natural nails, it does shape, file, and buff effectively and only takes a few minutes. It is very easy to use and has 2 speeds so that you can file quickly or more slowly. I've always had okay nails - no major problems, but certainly nothing spectacular. After using this manicure kit, my nails are all equal in length/shaped the same and tend to break and chip much less. I haven't had a nail break for months and I haven't used any polish during that whole time. It also does a great job of pushing back your cuticle. If you're looking for an easy way to get better looking nails, give this kit a try! PS. It does need a longer cord - get a short extension to go with it!",
    "good slippers love them, but they are disposable. after awhile you have to throw them away. they get matted down and dirt is very apparent on them.",
    "I have been using this product for years and I love it. No complains--but with the new look of the bottle I feel like the formula might be slightly different.. I still love Redken it is great and very affordable!",
    "This hair color for men is easy to use and leaves hair looking healthier and and natural. I have been very pleased.",
    "This product does exactly what it's description says. I have thick, frizzy, unruly, and dyed hair and regular mousse didn't do it. I blow dry my hair and this product calms the hair into luscious texture. My style looks polished and stays that way especially on humid days. I love it!ISO Tamer Foam Smoother 6.7oz",
    "I love these products. They make my hair very easy to manage. The apple smells good at first but the scent left on your hair has a slight vinegar smell to it. It's not too bad, but I'm not in love."
]