[
    "I have not really tested the product yet, BECAUSE there is no power adapter included. It needs to be ordered separately. You need to order the Yamaha PA3C or PA3B Power Adapter (unless you already have one of course [haha]). Both of these are mentioned on the box as possible adapters. If you read the description on Amazon's site carefully you will find that it only mentions the PA3B, which is not available via amazon. However, the PA3C is possible to order, so get it as well in case you are considering this product. Just figured that all potential buyers should be aware of the issue. The lack of an adapter was not clearly emphasized (it is in the fine print)in the product description. Hmmm! I was not very happy at the moment I realized it.......",
    "I'm buying a second pair of these brushes because I lost mine in Superstorm Sandy. I tried to get by with Vic Firth brushes, which are good, but after playing with my friends last night I decided I just had to go ahead and replace these.First of all, the brushes themselves have an excellent sound. They are just the right amount of stiffness and somehow sound softer while still projecting well. My chops are limited but I find I can get a wide range of brush sounds easily with these sticks. Also, to me the tines of the Vic Firth brushes are too short to get the versatility I want.But the key feature is the handles, which can be used to hit the rim with a sound that is very similar to a wooden stick. This means you don't have to fumble around grabbing for a stick at the bridge when you want to do rim shots. Grooves like bossa nova are of course great with sticks like these.There is a steel bead at the end of the stick that I use in various ways on cymbals for subtle effects. I've also held the tines and used the brushes like a stick on the ride.Currently I'm playing mostly roots rock, I have a jazz background, and my chops are intermediate at best, so I believe these brushes are great for beginners as well as pros.",
    "Great stand, very adjustable and well made. Recently purchased for use in \"Shrek\" the musical where I had to play doumbek, djembe, congas and bongos in a compact set up. Great quality...Bill Vits, Grand Rapids Symphony Principal Percussionist",
    "After putting on these new strings my 40 year old viola came back to life in richer tone. Highly recommended.",
    "I'm part of a 4 piece contemporary Christian group that doesn't have a sound guy. Sometimes I also do solo or duo gigs. Most times, I run sound from the stage, which is almost impossible. Often, I don't even have anyone to help me with sound checks. The 482i doesn't fix all my problems, but it does allow me to play at reasonable volumes with increased intelligibility, which I was unable to accomplish by myself. A common problem I had before I bought my 482i was that some people complained the sound was too loud, while others complained they couldn't hear. With the 482i, that problem is greatly reduced. I get a nice, punchy sound that enhances vocal clarity and doesn't require endless EQ, or other tweaks.If you've got a good system with a knowledgeable person to operate it, you probably don't need this. But I'm already singing, playing keyboards and guitar, and sometimes operating a drum machine with foot pedals, so I need all the help I can get. My PA usually consists of a cheap Behringer mixer, this 482i Maximizer, a Samson sx1200 amp, a couple of Behringer B205d monitors, and a pair of Behinger B212XL speakers on poles. A very simple setup, but made much better by the inclusion of the 482i.",
    "This is a pretty solid Electric Violin. The plastic makes it light to hold, and that may be an issue for some as I like to feel the weight of an instrument to make it feel solid. The shoulder rest materials they give you are not worth installing, since they just fall off, and you would be better off to make your own, or buy one. Otherwise it sounds good and the headphone option is nice even though somehow this violin makes it's own reverberations without it, so you can also hear it without amplification or headphones, it just doesn't sound that good. Remember that if you have headphones on playing it next to someone.",
    "I ordered this product through a different online store but wanted to share a very quick review with you.I purchased this for use with my LP Matador bongos. These must be the heaviest bongos you can buy. With this stand, I am able to brace them firmly. I can hit them as hard as I need to and thanks to the stand's build and weight, there's no sway or movement. What I am trying to say, in a few words, this is a very solid stand and I did no have to make any special changes to it to work perfectly with my LP's. If you have a different brand of bongo, I cannot comment as to the fit but the bracket is universal and should work well with pretty much any type of bongos.Compared to other stands I considered (online), this is a very solid buy at a very aggressive price.",
    "Bought this to replace a stolen microphone at a local Property Owner's facility. Was happy to find a good price on the mic.",
    "i neeed to get this so i can make some beats on my computer",
    "I am thrilled with this saxophone - it not only looks great, it also sounds great! The case is nice and sturdy with top and side handles, and is also nicely lined. My son just started taking lessons, and fell in love with it the moment he saw it - which is motivating him to practice almost daily (without my prodding!). This is my second LJ Hutchen purchase from Hyson (purchased a flute last year for my daughter which we are equally happy with).",
    "This light seemed perfect for live performance. I am a singer with a band and needed to be able to discreetly see the lyrics in a dimly lit bar. The quality of light it produced, and the shape of it were great. Sadly, after the first use, the light no longer worked, even with new batteries installed - again.",
    "I should have paid more attention to the review that said this product is huge. Good bang for your buck though and my baby really likes them. I was trying to buy a baby-size version of this product. Whoops!",
    "One worked well, but the other insert, was only working with 2 poles(+ and ground), so for that reasonI had to make that output a mono one. That caused that what ever was heard on that output sounded withless volume that the other stereo output. :/ The other thing that I disliked was that as I inserted anadaptor for earphones, the input worked for a while and then it stopped, I constantly need to betouching the input, or pluging it in with extra force. I think the design is poor in quality.",
    "This guitar stand (for less than $10.00) is better than the $40.00 models I find at local music stores. It holds the instrument at the right angle and has padding in all the right places.",
    "i called customer service and the agent was awesome. he was kind polite and very understanding.and of course he took care of my issue right away.thank you austin bazaar customer support team for training this gentleman so very well",
    "I use three of these and am buying a fourth. Two are bi-amping a $40,000 stereo mastering system in my studio. These replaced a finiky pair of class A power amps whose paint cost more than these entire amps.The sound quality is ruthless and musical as hell. I did have to recalibrate the way I had my monitor speakers aimed, because every amp works a speaker response and delivery its own way. However these amps told me more truthfully where the speakers needed improvement setup wise...Before you think I am mad let me add I used to be a Krell salesman and McIntosh Labs salesman. I know power amps. My front end is all class A. I studied the topology of these amps and concluded they just might be a \"sleeper\" in the design department as they use SMDs and a bunch of HiFi tricks.Plus they are freakin loud and clean and never blow drivers with unlimited clean power... Unlike my Class A amps which blew up a monitor when they choked.I am finally buying another one to actually use as a PA amp and make an honest amp out of it. I would not say there are no other \"deals\" to be found out there in the world of commercial sound re-inforcement. The only other design that excited me was the Crown K series which I believe is discontinued. So this was the best I could find four years ago.Try them. You may like them...",
    "I don't know if it's the brand or what but this fog really sticks around! I fogged up my entire basement to the max and you could barely see a thing! ThanksEliminator Lighting!! I would kind of prefer a wireless remote but ehh no big deal. I Recommend this 100% to anyone planning on throwing a party, especially for the money.The only thing missing is a remote timer because it can get a little annoying having to press the button constantly",
    "The strings sound ok but I was looking for some that would be more like the ones on my electric.These strings made my fingers sore. I won't buy them again.",
    "I have been playing guitar for over 15 years, and never have I found a string that sounds so clear, rich, and full-bodied. The nanoweb coating is the best on the market. This is only my second set of strings in over 3 years. Previously, I had to replace them every 6-12 months. Once I tried these, I never looked back. Great for any style of music and or playing technique.",
    "Excellent strings, at a very good price! Very bright clear sounding flat wound strings. I highly recommend these strings.Chris",
    "We ordered this microphone for the pastor in our wedding. We were sent the wrong microphone and had to pay out of pocket to return it since they did not supply a return shipping label. The package was returned to them about 3 weeks ago and they lost it. We were told \" we are really busy and it might be hard to find your package.\" Over a month later and the only thing we have received is terrible service, no product or refund!I rated a 1 star because 0 stars is not an option.I WOULD STRONGLY SUGGEST NOT ORDERING FROM THIS COMPANY",
    "This mic is truly versatile. I have seen it being used as a microphone for:1) Acoustic Instruments2) Drum Overheads3) Vocals4) Large Choral GroupsAlthough it needs phantom power, the 9V battery input allows this mic to be used almost anywhere. I have used this in studio/live environment. And it always lead to excellent results. If I was held to gunpoint and asked to choose one microphone to save my life, it would definitely be the AKG-C1000S!",
    "While I like the sound and durability of these sticks, the main advantage for me is the grip. I had a set of these many years ago, went away from drumming, then recently got back behind the kit. After playing for a couple weeks with wooden sticks, I desperately wanted these again. For me, I just can't get the same comfort and grip from standard wooden sticks; these result in fewer blisters and longer playing time. Also, I like the added weight that the grips give in the butt of the stick, which allows for some playing techniques (a different bounce off the ride, for example) when you learn to hold them a certain way.PROS: I know a lot of drummers like grip tape on wood sticks, but I don't. And when playing fast-tempo or hard stuff, I think these grips are better. The sticks themselves are very durable, especially if you love smashing your cymbals. Slight extra weight of the rubber grips gives you a different balance when holding the stick, which can help with certain techniques.CONS: Very different feel from wood sticks, which you may not like. If you ever play with the butt end of the stick (as Nicko McBrain of Iron Maiden does on the snare), these may not work for you. Of course, you can do it, but the feel and sound is very different.Even if you don't want these to be your main sticks, I think they'd be a great addition for at least certain uses.",
    "This is a nice guitar with surprisingly low price. The sound quality was great, and the only thing that disappointed me was the Jasmine sticker on the pickguard wihch I don't like the design. It took me some time to remove the sticker, but except that everything was great.",
    "Pros :- Great appeal- Well made- Delivers at estimated time- For beginners and for experts- Definite good price for name brandCons :- Needs a little tuningOverall a great guitar and it's not that pricey , worth it",
    "We bought these as an alternative to the expensive in-ear monitoring systems available on the market. Every instrument can hear themselves clearly and get a clean mix of the overall band. They really work.",
    "I'll keep this short since anything I'll say has likely already been said.I play my acoustic guitar on it and it's comfortable enough that sometimes I remain seated on it for a while after I've already put away my guitar. And really, what more could you ask for? The build quality is great, I'm not at all worried of it breaking, and, of course, it comes at a great price. If you need a bench, you can't go wrong with this one.",
    "This is a nice metronome for the price. It's loud enough to hear over my bass guitar, and has a port for headphones if needed. Instead of the wooden click, clack noise of a traditional metronome this unit has more of an electronic pulse. It works, but I would have liked to have known this ahead of time. For the money though, it's hard to beat this product.",
    "I first saw a cajon in a church band and was impressed at the sound such a small box could make. I checked the local music stores' collection of cajons. While there were some that could put out more bass sound, or had adjustment knobs for the snare string mechanism, or were even had amplifiers, the Meinl Headliner served our purpose for the best price. The Headliner comes with a hex wrench to adjust the snare string tension from below. The faceplate can also be adjusted with a phillips screwdriver. We are amateur musicians and play at home for our family. The cajon makes a wonderful simple percussion instrument that anyone can play--even the kids. It is also makes a good seat for playing other instruments.",
    "This flute is extremely good for the price and makes a fine starter flute. It's not good enough for playing in college, but fine for the middle school beginner and high school student up to a certain level of playing. I checked with some flute players & teachers before purchasing, and this make was recommended over several others (it's not better than a Yamaha starter flute, but it's more affordable.) In particular, the price is helpful for children who may not always treat their instrument with the care it needs at first. My child didn't realize how delicate the flute is, and once dented it as a result (it's been repaired) so I'm especially glad I didn't buy something more expensive. We are happy with it and I would buy another of these if any of my other children choose to take up the flute.",
    "I didn't get it right away- but my 10 year old guitar player did! Works very well, and she thought it was easy as could be. Guitar sounded 100% better after the quick tuning.",
    "The metronome only has certain speeds- and does not move by intervals of one, which I finda annoying. But other than that it's fine.",
    "I play acoustic guitar. When I was first learning, I couldn't keep the pick from slipping out of my fingers. I purchased the Dunlops because of the grip factor. Problem solved. I don't know if I will ever try another brand pick of because I like these that much. I have a package of the .58mm and a package of the .71mm. I wished I played other instruments so I could justify buying the Dunlops in all the colors. Now, on to finding my favorite strings!",
    "I've played trumpet/cornet for many years and tried all sorts of mutes. This Denis Wick straight mute fits well and has a very good traditional straight mute sound which is not overly bright or tinny. There are other more expensive mutes out there, but I feel this one is just as good and is available at a good price on Amazon. I was impressed also with the fast speed of delivery using Amazon. Overall I am quite pleased with this mute purchase.",
    "I have a Clavinova and a PSR 6700. I play the clavinova at our local hospital and the keyboard at the Senior Center. I ordered the PSR225GMAD as a backup mainly because of its weight and price. I was amazed at the sound quality. I didn't believe it was possible with just two 3 watt speakers. The voices very closely mimic the real instruments and the rythm sections are outstanding. It is easy to set the voice, tempos, and accompaniment. At twelve pounds, I can carry it without the possibility of getting a hernia. It is attractive, has quality sound and it was at at unbelievable low price. My only suggestion is that you increase the number of memory setups. Four is not enough.A very satisfied customer,Sam J. Vaughn",
    "My son needed a trumpet to being playing in the band this next year. As a former trumpet player, I had an expensive silver King trumpet that I could not send with a fifth grader to school. Due to past reviews and price, I purchased this trumpet. On arrival, it played beautifully right out of the box. The sound is much better than I anticipated for the price.",
    "I attached this mic to my Kodak Zi8, and I recorded a concert this weekend. I didn't have the time to set the audio levels on my camera, but that was OK because it still sounded like I was recording in my garage. Great mic, just don't get the cheap rip off version",
    "I use this for a PA speaker on my jeep. The speaker is loud and was really easy to hook up. I sprayed it with some flat black spray paint to make it less noticeable underneath my vehicle.",
    "Right after the warranty ran out, the only effect it would create was heavy distortion with flange. No matter what setting I switched to, it only produced one effect. The volume was low and refused to respond, too. Once I managed to get it to respond to the controls by powering it down and back up, but that lasted about ten minutes.When it worked, the tones were thin and artificial sounding. This thing does not deserve the Line 6 label, and they should have the self-respect to NOT ever sell it again. Utter crap. Don't bother.",
    "After searching for a clarinet which would give me an instrument that I could be proud of and would not \"bust the budget\", I found the LJ Hutchen Bb Clarinet. I could hardly believe the value presented. I received it promptly and have been enjoying using it ever since. I had rented a more costly brand but this one is every bit as good and the accessories that came with it, the top quality case and supplies, are an excellent bonus. I had an incidental question or two which were answered promptly and courteously by the company customer service personnel. I will recommend the LJ Hutchen Bb Clarinet to my friends. It is an excellent value and a pleasure to own.",
    "Nice little recorder. Seems sturdy and well-made. Comes with a plastic stick to clean the moisture out of the instrument, a rather cheap plastic carrying case, and a small sheet showing fingering. Has a decent tone though we aren't talking concert quality or anything. Better than a toy. For the little bit of money I spent on this, I'm very pleased.",
    "This company gets better every year. I had heard about them on google, and the torrent sites. The burn's work 100% of the time and every-time their is an update you are guaranteed to get a good burn on your dvd.",
    "I always purchase Thomastik Dominant violin strings because as a violin player, I like the sound produced by using them in practice or in performance. They last too.",
    "I like this amp. It is quiet at full volume. However, the new lower priced amps are configured differently than the older ones or the high end models. I don't know the proper terminolgy for this but they just don't have the \"power floor\" the older amps do. In other words, this sounds more equivocal to a 50 watt amp as oppossed to a 100 watt amp running through 8 ohm speakers in a stereo mode. If you run monitors in a series you drop your ohm load (to 4 ohms with two speakers), the volume is louder but the amp also clips more easily. I use this for my monitor and is more than adequate for small venues. The case is well put together and solid. Again, it is clean and quiet and I've had no issues with it so far.",
    "I really appreciate Ejay Hip Hop 4 and what it does for me. Its everything I thought it would be. I would recommend this program to anyone.",
    "This product seems to work as advertised. Connected it up to my XP Laptop, and it was able to connect to my Piano. Very little to say about this item since it just does what I wanted it to do and it is one of those things that either works or does not.Happy with it.",
    "AS you can see in the product photo the center part of the pick where your thumb lies is constructed outward. While in reality that part actually goes inward. I thought that this pick would be a thick pick. But inreality its not. This Dava pick is as thick as a regular .70mm pick. Also, the middle part of the pick is so thin that it can easily break the whole pick into two pieces.",
    "Looked forever for bagpipes should have kept looking. they would look good on a shelf, but for a child to start learning not so much. Bag does not hold air very disappointing. save your $70 an keep looking. Amazon was great however, fast service an easy to navagate.",
    "Being an audiophile, I wanted a good needle so I could listen to my vinyl in crystal clarity but not spend a fortune on a cartridge/needle/stylus. I also wanted something that would be nice my records, so I looked up Grado. Though I am sure the gold, black, green, etc. would've been good, I thought I would spend a few extra bucks and get the red stylus. Man, was it worth the investment. It gives all of my music that 'warm' sound that vinyl enthusiasts talk about, the range of sound is amazing. no 'tinny' sounds, all the power of what a turntable system should sound like. people say 'dude are we listening to a cd?' I say, 'no, it's my turntable with a killer needle.' You won't be disappointed.",
    "This product is solid,well constructed,easy to assemble. The extra shelf is ideal for holding a (Bass Violin) bow and the support easily holds two or more pages of music,as well as a clip on light. These were all the features we were looking for and are well satisfied.",
    "I got three of these hangers and they're pretty awesome. I hung two acoustic guitars and my violin in my living-room and they all look quite handsome. You can pinch and widen the hook to fit most any instrument with a head on it. Aesthetically speaking, the hooks look really great and match the wood-grain on the guitars nicely. The mounts have a nice neutral finish to them that makes them a very flexible decorating accessory. The guitars are safe, out of the way, look nice and they really complete the room. The guitars aren't touching the wall (which keeps them blissfully free of scratches and paint marks), the mounts are sturdy and well made and they are easy to install. Just find a stud and go nuts, baby. There's also minimal damage to the walls since the mount just uses two long, thin screws. Overall the mount saves space, looks great, doesn't damage the walls heavily, and is sturdy and safe. :) Great buy!",
    "First off, they are not lying about how long these strings last. I perform every day (2-3 hours) and these strings will go more than a month.Secondly, I love the mixed gauge (light-medium) with excellent bottom, and ease of play at the top end.Third, They sound great on my Taylor.",
    "I have been using D'Addario EXP Phosphor for more than a decade. I have tried many strings in my 40 years of playing and these are by far the best sounding and longest lasting. I can use them for several months and not lose much tone. Usually I just replace them because...",
    "This is a cheap violin in every sense of the word... both inexpensive and low quality.That said, I didn't want to spend the money on a violin if it turns out I won't play it any more than I did as a kid.Given its price and my questionable commitment this is a great bargain - I didn't need to spend any more than the price of the violin because it comes with literally everything but the music. It had the case, two bows, rosin, extra strings, extra bridge, metronome/tuner, and shoulder rest.As for what makes it a low quality violin -* The pegs do slip. It is hard to get it to stay tuned (okay, it was hard to tune it in the first place!)* The fine tuner was broken (the pin didn't connect to the tuner for the E string and the pin head broke)* The tuner didn't come with any useful directions. Minimal ones to get to the instrument, but not really helpful from a usefulness perspective.* The sound quality is awful to low end mediocre. I plan to replace the strings since I have to get the fine tuner repaired.As regards other reviews as well as helpful tips -* Some reviews indicate that they needed to install the bridge. Mine came with the bridge installed* The bow will work to pull out sound but you need to tighten it (turn the knob at the end of the bow) and you need a LOT of rosin. I remembered this from playing as a kid though. You do need to get the rosin surface scratched so that it will stick to the bow. And you need a LOT. When you think you've got enough put on that much 2X over.* The shoulder rest probably shouldn't change the sound... but it does (though that may well be just due to the peg slippage as you get the shoulder rest attached) so if you plan to use the shoulder rest make sure it's attached when you tune the violin.My plan is to take this to get the strings replaced, the fine tuner fixed, and the violin tuned. I'll update the post after I get these things done.Keep in mind though that this review, along with all of the other four and five star reviews, is relative to the price. If I'd paid list this would be a one or two star violin. If you're expecting a Stradivarius for this price you should adjust your expectations down several dozen notches - this is to a Stradivarius what the last place t-ball team is to the world champion major league baseball team.For an adult who is not sure of their level of commitment this is an ideal purchase. I wouldn't purchase it for a child who is still learning - there is too much downside. I agree with other posters who say to rent the kids a decent violin.In summary - you get what you pay for but you do get everything you need.",
    "my brother got this keyboard for his birthday about 7 or 8 years ago, since then hes moved on from it and i started to use it :) having no real expertise on keyboard i found this worked great and is very easy to navigate around. it still works great to this day and although it does lack a few things, for example i would more like a keyboard with a bit more voices, its still very nice to use.Considering how long this has lasted our family, and how easy it is to use for beginners (i found the lesson modes really quite helpful) i would definitely recommend it",
    "this is a good little clamp that does the job but it will tear your truss apart if your not careful. i place a rubber band between the clamp and the bar to prevent severe damages, but otherwise, gets the job done.",
    "great price. great sound. great deal. Wuhan and Zildjian rule",
    "Just got these and they sound good... I just needed a E tuned harmonica but thought I might as well just order a full set at this price.",
    "This beautiful, responsive turntable is suited for hiphop DJs and other experienced users of high end turntable, not so much for the casual listener like myself perhaps. It starts and stops instantly, since it is belt less, and has a few incomprehensible controls that seem to be catering to the needs of scratchers and mixers that are entirely superfluous for the player of music to enjoy music. It sounds nice, especially since I bought a decent cartridge to replace the stock DJ-style cartridge it comes with.Replacing a cartridge is difficult, requiring tiny wires to be wrenched out of tight connections, and then jammed back in. I had to use a needle nose pliers to remove some of them. Tiny screws need to be removed and replaced, and they are easy to lose. There is a 2 gram weight screwed into the top of the cartridge carrier that I still haven't really understood, about which I'll say more in the setup problems I found.Setting up this turntable seemed to be almost impossible, if one follows the vague, almost incomprehensible instructions they provide. There is a separate weight that needs to be installed on the end of the tone arm. Fine. But it slides on the tone arm and can be positioned almost randomly anywhere, without any indication I could see or feel as to where it needs to be positioned.I spent days trying to figure out where they expected this weight to be positioned. In one positions, the needle would go straight upward, in another, it went down. Finding the position that allowed it to float freely, neither up or down, was impossible until I removed the 2 gram weight. Once I balance it, I was able to reinstall the weight and make all the calculations about how heavy I wanted my weight to be - I simply guessed than between 2.5 and 3 grams would be sufficient.I think I adjusted the anti-skate correctly, but am still unsure. What I realized is that the manufacturer of this turntable has no interest in providing any guidance for anyone interested in any use for this turntable but scratching and mixing records. This is probably why you can't turn the damn thing off all the way unless you dig around deep behind it to a very well hidden switch, which, if you don't keep your turntable on anything but a surface where it is easy to reach around the back and under it, you will never turn it off as long as you own it.If I were sophisticated enough to judge the sound quality, I would weigh in on it, but I feel like I bought the wrong turntable for my needs.",
    "with a very versatile array of 6 MIC inputs each accepting 1/4 and XLR - MIC6 is a switchable Line/Mic level input as well as being switchable to RCA/phono jacks for tape loop/CD player or patch to a home stereo amp, adjustable feedback suppression. Mic level output is also 1/4 and XLR.Master Gain Control. this mixer has won a permanent place in my seminar room PA rack.It could work equally well for a modest band MIC setup, particularly if you have a mash-up of balanced and unbalanced mics (1/4\" and XLR).electronically quiet, low cost, Modular power cord, unswitched outlet on the back, Bus jack to tie into another mixer... what more could you need?",
    "I study classical guitar, and broke fingernail in ring finger. I tried this item, and after some adjusting and a little getting used to, it worked just fine.",
    "I'm a fairly technical guy, and I like to think of myself as being musical too. I bought this to make some demo background drums for some songs I'm playing. I read through the manual pretty well (something I don't often do) and still I just couldn't get the hang of it.The preset patterns are nice, but I'm doing rock music and most of them seemed too busy. The patterns ARE editable if you can figure it out. I couldn't.Instead I found a VERY easy to edit app for the iPad that cost just $7. So I ended up returning this.I'm not saying this is a bad piece of equipment. The sounds are very nice and the touchpads are very usable if you've got an understanding of drumming. Unfortunately for me, but I just couldn't get the interface and editing steps through my thick skull",
    "Very affordable and adds a bit &#34;extra&#34; to any kit ! Easy to fit - the cowbell has a good ring to it",
    "I've been using this clamp for over three years on my kit. Fits nice, doesn't scratch the bass hoop and is stable.",
    "Solid design and engineering. I like the strong alloy screws included - stronger than stainless steel and much stronger than common wood screws.One major complaint; the system will not work on my Les Paul without modification. The supplied screws are #6 size, while my Gibson uses #8 on both ends. I modded #8's to fit, but Schaller should offer a version for Pauls.",
    "For the home studio, this package is quite enough. Alesis provides great quality products both for amateurs and professional. I've used a lot of Alesis products inside professional recording studios, which were excellent; and when it comes with their nano devices, they also deliver the goods. The nanoverb is an industry classic that started with another classic - the midiverb back in the late 80s. Get this model if you have a home recording studio. You won't regret it.",
    "I received this along with a pink keyboard for my daughter for Christmas. The keyboard had paint missing and you could see the original color which is black. Then they promised to send new one and never did. Don't deal with these people. I know I never will purchase from them in the future.",
    "We put these strings on my daughter's cello that had cheap stock strings, and were surprised at the huge improvement in tone. Very clear and bright--probably too bright for an advanced player, but good for the student players that these strings are designed for. Unless you have absolutely zero budget for your instrument, upgrading from cheap strings to these ones is money well spent.",
    "Had to return 1st one after a few weeks due to a buzz on low A (guitar, 5th fret on 6th string). Supplier said they have few returns on the Patriot series. Second one had no problem and sounds better all the time as it gets broken in (it's a replacement for the stock speaker in a Fender Super Champ XD). Bell-like tones, good articulation throughout the sonic spectrum. A well-balanced speaker.",
    "I got this for my daughter so she could take care of the investment I got her call a clarinet. Pretty good kit with a lot of good items included.",
    "I would've given it 5 stars but my 9 month old baby doesn't like it as much as I thought he would after we almost had to buy it for him at the bookstore because he wouldn't let go. That's probably a function of my baby, not the egg shaker. I got 3, yellow, blue and red, and he likes holding them. He really likes when I bang them together. They're tough for him to chew on but he tries and there are no teeth marks whatsoever. I think they're going to last a long time and I'm hoping he'll like them more once he realizes what they're for.",
    "Not made anymore so the review might not help. You cannot replace the modules anymore",
    "I needed a pre-amp to use my old school Pioneer turntable with my new receiver & this works great & at a great price.",
    "If you haven't used these picks, get some. They are the perfect size and shape. Your really can't beat them.",
    "I love these stands. I have several of them and really should have more because my band mates keep claiming them. Low profile so they don't take up a much room. Solid foundation so they don't tip when you put guitar on them. If your a gigging musician they pack up small and are easy to carry with no parts that come off.",
    "La distorsi&oacute;n es simplemente cochina, pesada, aguda, revienta o&iacute;dos y a&uacute;n escuchas a la perfecci&oacute;n toda la ejecuci&oacute;n de lo que tocas. Obviamente esta belleza la debes acompa&ntilde;ar con una guitarra con buenos mics, buenos cables, buen amplificador y totalmente recomiendo pasar a trav&eacute;s de un noise gate. Yo utilizo el NS-2 de Boss, funciona sin ning&uacute;n problema y obtienes lo que buscas, una distorsi&oacute;n estridente con poder.",
    "I had been using 12's on my S35 Takamine and they were over powering the chassis with vibration. The result was poor sound. Switching to these 10's made a huge difference in tone. It took a bit to get used to the lightness but now I will stick with them on this guitar. They are also easy to do bends which I like alot. I have never broke a D'Addario acoustic string.",
    "This string is simply amazing!! I bought D'Addario Pro-Art&eacute; Set because the complete set of Infeld is too much expensive for me. So i used Pro-Art&eacute; G-D-A and Infeld E, and the results are amazing. The sound is warm, rich. I recommend 100% to buy these strings!!",
    "Hmm... I play pedal steel, and I usually use an Echoplex to get some slap back and a few other tricks. I have a show coming up, where I am going to have to fly cross-country. So, I figured I get a Reel Echo, and leave the old `plex at home. When I first saw the unit, I was impressed that they designed it to resemble the sliding tape head instead of a knob for the length of the delay. Needless to say, it's just not the same. Doesn't have the right feel at all. And you can't get that great feedback loop either. Now I will admit, for the sound on sound function, it's perfect. But I've never needed to use that on my Echoplex. I will say that it is a good delay pedal, but if you want the sound of a real tape delay, the Reel Echo is not it.",
    "This pickup is a very nice quality piece of equipment. It looks great, and sounds great in my Washburn acoustic guitar. It came in a nice canvas pouch with very good instructions and has a nice long cord. It also came with 2 spare pole pieces and a hex wrench. It fits perfectly in the soundhole and is relatively easy to install & remove. The cord does not interfere at all when playing. I plug directly into a Fender Champ tube amp with no noticeable noise. Also sounds great using an effects pedal. Overall, it's very well made, looks really nice and sounds great. I would highly recommend this pickup.",
    "i went through 2 in about 5 months but the 18 inch crash ride wen used as a ride cymbal has lasted me about a year and a half with only 1 small crack that hasnt grew and my hi-hats still sound that same way as when i took them out of the box same with m 16 inch zbt crash.....the only cymbal from the zbt line i hate is the 14\" if u want a good cymbal for a cheap price buy the 16\" the 14 \" failed miserably",
    "I was looking for one case for my acoustic guitar; I bought this one for a reasonable price and it fits perfect.",
    "Very very long lasting. Sound is alright. I've heard better.Will perhaps try for some earnie ball strings next time. :)",
    "If you can't get enough of \"V\", then this series is a great addition to your collection.The story has holes (Does Elizabeth have a lizard tongue, or did I just see her lick her lips with a human one?), but the writers seemed to make an effort to have a sort of Sci-Fi purist logic to it - in, for instance - the way they deal with the red powder virus/bacteria and how it stops affecting the Lizards on some parts of the planet.It's this kind of attention to detail that makes the story interesting to fans of Sci-Fi, and an undiscovered gem for people who've only seen the miniseries.",
    "Well, it functions just fine but I could have built one myself with the left-over scraps of leather or plastic and a mini tripod. The tripod the comes with the case is one of those $2.00 things good camera stores give away with purchases (I have several that are actually heavier). The whole thing with the cheap leather and little tripod is not worth more than $20. The idea is useful, though just over priced.",
    "This Guitar Tuner has helped me learn how to play guitar. It works great and has helped me big time. I'm barely learning how to play guitar so I don't know how to tune my guitar manually so the guitar tuner has helped me a lot. It's really easy to use and it has a cool feature where it teaches you some basic chords. I mostly use it for the tuner but thats where it works best.",
    "I just received this piano yesterday and I am thrilled! The two piano sound settings are some of the best I've heard (and I've read elsewhere that this piano and its bigger brother--the ProKeys 88--have the best sound for any piano under $1000). The keys feel great considering they are semi-weighted, and the multiple velocity settings are very well implemented.When purchasing this piano, there are some things to keep in mind that can add to the overall cost. Most importantly, this keyboard does not have built-in speakers, so you will need a separate set and some good cabling to get sound for everyone to hear. Otherwise, if listening through headphones suits your needs, you'll either need a pair with a 1/4\" connector or a 1/8 to 1/4\" adaptor if you want to use your MP3 player headphones. Fortunately, the piano does come with a USB cable and drivers, so you can use it as a MIDI device on your computer immediately. Finally, you may want to consider buying a keyboard cover in order to protect it from dust and the like.If you're looking for more reviews, Keyboard Magazine has the one that influenced me to buy this piano. Overall, highly recommended!",
    "I have been using this recording software for over two months now, and it has succeeded my expectations. I wish I had purchased this product much sooner. The installation and set-up was a breeze, and I began recording in no time. The sound quality is amazing. Although I did purchase Magix's audio cleaning lab to re-clean some of the files that I have already recorded. The best part is that I can now listen to the songs from my vinyl records on my laptop or MP3 player.",
    "If you've shopped online for quality Irish flutes, you know they usually cost over $200. This instrument can be played, truly. However, it takes a very skillful pair of lips and lung to produce the low D and even more to play in the upper register. It's not a terrible instrument by any means, but you definitely get what you pay for.",
    "We got this for our daughter, she had a high-end Yamaha flue. It fits perfectly on this peg. The idea is not just to hold the flute, but after you are done playing, and you clean the flute, you still want it to really DRY OUT before you put it back in the case. This is the way to go. (Don't leave it flat, someone will sit on your expensive flute, or they'll put a book on it, or worse...)Very Happy. We'll look into adding a peg to this for a piccolo; that will be nice too!",
    "Ordered this guitar for my daughter's elementary ed music class where she had to play a song on a guitar. She loves it. Her prof said he was glad she didn't get a low end wal-mart special. Good beginners guitar. She'd found one on the web ordered it and it turned out to be a child sized one. She was in a panic for a guitar so we found this one on the web and had it shipped one day. It didn't show up at Fed Ex when it was supposed to. We called back and Amazon shipped another one One-Day which got there barely in time. The original guitar order showed up four days later which she refused. Amazon handled the return nicely and waived the one day shipping charge. Very happy with the customer service. Not so happy with the shipping. Be sure you watch the progress of when it get's accepted at Fed-Exp.",
    "I purchased the M-Audio AV-40 speakers to use with my Apple wireless network. They arrived quickly and were very simple to set up: plug the power in, plug in my Airport Extreme cable, connect the two speakers with wire provided in the box, and stick the rubber cushions on the bottom of each speaker. They deliver crisp highs and decent bass (I prefer to leave the bass boost button on). Volume is more than enough for a living room. After over a month of use, I am glad I bought them and would do so again.",
    "I bought this stand because I need space for a volume pedal, sustain pedal, and rotary speaker effect on the floor, so the \"X\" style stands don't work for me. I have been using the \"Z\" style, but it took a long time to set up. This opens up immediately and is heavy duty. The only tradeoff is that it makes it somewhat awkward to carry, especially if you're not too tall. I put a bungee cord between the legs to keep them from swinging around. There is a little side-to-side play when it is all set up. I also bought the M-92 upper tier separately, and it seems they may have had different versions. The stand has a nut in the bottom of the frame while the second tier has the threads on the side. There was also no tool to adjust the second tier in the kit, but I found a couple metric screws, m8 x1.25 thread and the star drive screwdriver at the hardware store to complete my set up. So far so good.",
    "It's a tuning fork! You hit it and is sounds an A. The resonating box makes it loud enough that you can tune with it across the room, or even down the hallway. Great piece.",
    "I bought the RA-100D for my young son. I based my purchase mostly on the reviews and did like the sound quality. I have to admit I was very disappointed with cosmetic problems, any quality inspection would see the nicks and scratches in the finish. I hope my son doesn't think I bought the guitar second hand.",
    "I was soo happy to get this, but we had to return it, because you have to turn the volume up so loud that you can't hear my voice, even with the MIC turned all the way up. It would have been so cool to have, it has a TV and DVD player to watch movies, but even the movies would freeze up once in a while. It made me sad to have to take it back and I hope we can find another one like it. I thought mine was defective and tried to exchange it but they ran out of new ones. Now I see a lot of people must have the same problem.",
    "It was okay I thought it might be a little fancier than I thought. Next time I will be an electric guitar because this was just a little too simple.",
    "I've played electric guitar since 1968. For about 20 years now I've used the EXL 140s exclusively, but can't always find them in a store, and always get dunned for high prices. Now I just go to Amazon and buy this excellent 10 pack which always shows up in my mailbox in a few days and works out to about $3.50 a set. KILLER!",
    "Never been more happy with my tone. Perfect if you own one of the RB series amp otherwise look elsewhere. Own the RB1001 and producing a gloriously majestic tone",
    "Item being reviewedNADY SP-4C Dynamic Microphone. omg we love it. THE SOUND IS AWSOME.THANK YOU EVER SO MUCH.",
    "We purchased this for use at family reunions, but have used it for small church functions as well. We are very pleased with the quality and performance of this small, but very effective portable sound system. The sound is very clear and the volume can be adjusted to work very well in a large hall without effecting the quality. We would definitely recommend purchasing this item.",
    "This book came with a Cd of a full orchestra/band. This made playing feel like you were a part of a group. Also fun to play familiar tunes.",
    "As long as you understand what you're buying -- then this is a terrific unit.What you're buying is the ability to do four-track recording, two tracks at a time.You can then mix those tracks down and dub them to stereo -- likely a cassette tape player or our computers' audio card to burn a CD or MP3.There will be two main people interested in this unit:- Singer-song writers who use a recorder to help them compose.- Budding musicians (even your kids) who want to produce simple demo tapes while learning the basics of multi-track recording.DO NOT buy this unit to record your next chart-topping hit!Buy this this unit if you want cheap, easy, good-enough multi-track recordings for your own purposes. Don't expect studio-quality -- this is basically a consumer quality recorder, reconfigured for musicians.I think Tascam deserves praise for keeping a model like this on the market. There are certainly more powerful and better-sounding multi-track recorders but there are times when you just want cheap and easy.For cheap and easy, this unit is a good as it gets.",
    "The worst thing that can happen during a live performance is a technical problem. If you want to get a product you can count on, look no further. Be it 6', or 12', or more, Monster Cables are the way to go. I wish I had learned this lesson years ago.",
    "Let's face it, this is a pretty simple device that should work well, and it does. You can't tell from the picture, but it's actually two layers of filter. It attached nicely to my stand, and in tests with and without the filter, it does appear to be smoothing out my p sounds. Not a lot to say other than if you're looking for a pop filter, this one works. I used mine with the AT2020 USB.",
    "As a more classical violinist, I have always played on an accoustic. Recently, I have been doing more \"band\" and \"rock\" performances, so I decided to invest in an electric. This is a great violin, not stellar enough for recording probably but good enough for fun stage shows. The unique body style attracts lots of attention from audience members and the ability to use it as a practice violin while my daughter is sleeping (you can still hear it when \"un-plugged\", just very soft) has been an added bonus. As for quality of sound, well, I guess I'm just spoiled to the nice robust tone of my accoustic. Maybe with more amplifier experience, I may be able to achieve a better quality?!? This violin does come with a terrific soft case, all the cords needed, a set of headphones and a bow. I will note that the bow is pretty cheap (fiberglass I think) - not the worst bow ever made but you may want to replace it with a better quality one. Also, you will probably need to take it to a music store or violin maker to have the bridge placed properly and buy some additional fine tuners/peg dope (they only send you one on the E string) and the quality of the tuning pegs isn't the best. However, having sounded so negative... I am loving playing it! What a rush when you hear your high A tremolo come out of the amp! An exciting product of musical technology!",
    "I ordered this as a replacement for the stock GT stylus that came with my Numark TT1625 tables. Amazing...with Amazon Prime it showed up in 2 days for the low price of 40$ with free shipping. The unit came in a small plastic case and installed in seconds. The sound level and quality verse stock is like night and day. DJ's out there...this is what your looking for in a stylus at a price no other brand can match. Pick up 2 per table at this price having one as a backup and still save money. Amazing",
    "This is an excelent microphone, sharp answer, excelent distance.. you won't be disappointed. It gave me freedom at playing in the show.",
    "Update An Easy Fix and reccomendations to Greatly improve the sound:A Bass problem Solved.Many basses Particularly the Epiphone Eb-0 and Gibson EB basses.. But other basses also can have this problem especially short scaled ones. The problem is when the cotton or metal windings are resting over the bridge saddle. I have searched extensively over the internet and found no easy solution that would not require machine tooling and hard to find parts. What you need is a spacer that will go down the strings...and will stop at the Ball / Ring end. I came up with a very easy fix that anyone can do.. All you need are Steel 8-32 Nut's. The Type a screw goes into. The Size is based in USA.. So foreign sized may be different.. If so just bring you \"E\" string to you hardware store and try out different sizes until you land one that fits as I initially did. I found I only needed one or 2 nut's and that moved back the windings so only the string part rested on the Saddle. The mount of nut's needed may vary depending on the type of strings so just in case buy 5 nut per string and your covered. They cost less than 10 cents each. As a result intonation was perfect and the action and tonal qualities sounded correct and made a huge difference in the overall sound as a big Improvement.If using an Epiphone EB0 bass I spoke with Epiphone to find out the Gauge strings the Bass was designed and setup for: They told me to use: E: .105 A: .080 D: .065 G: .045 .If buying a new Epiphone please trust me one this.. Change the strings!!! I could not find and exact match but the closest I found in gauge were all the same except for the A string being .085 in a set of Ernie Ball Hybrid slinky roundwounds - which worked perfectly.. The intonation did not go off on the A string.Hope this Helps as an easy fix that will make your bass sound vastly improved. Remember the cotton or cloth or metal winding should never rest or touch the saddle.. And should always be well behind it. This fix is cheap and an easy fix!!Hope this helps!----------------------------------------------------------------------------This is my older review before I used the nut Spacer and changed strings:The sound and performance is greatly improved now. Still some Buzzing but much better overall than before....I have been playing bass for more than 30 years and used to own an Original Gibson EB0 made in the 60's which this bass copies. Gibson still also sells and makes a replica of this bass but you can expect to pay well over $1,000.00. Firstly the sidewinder pickup is not designed nor sounds nearly as good as the original.The Bass Buzzes like crazy - I have no intension of filing down frets in an attempt to maybe change that. The Epihone Basses as this model are notorious for the felt or string windings resting on the saddle where they should never be but the felt completely goes over the saddle of the bridge on the E string.. this is a known flaw... and you will need spacers to correct that. The felt or string winding should always be behind the saddle. The sound barley provides a distinguishable sounding note unless you amp or use effects that treble up the sound.. and even then it sounds lousy.. Noisy electronics' that are not properly shielded with poor electronics. I own another short scale Bass a Korean made Dan Electro that has nice low action with no buzzing and clear tones, and the ability to get a nice boomy sound or a very trebly at your choosing. You can distinguish on a boomy muddy setting on the Dan E. the note of the fret.. the EB0 you could be one fret high or low and the tone is hardly noticeable.. great if you make mistakes as no-one will be able to hear them! The wood and finish feels like a quality bass.. but the rest of the bass is junk. If you want that Animals classic bass sound and tone.. I would suggest looking into Eastwood's classic 4 semi hollow body, or the new Magnum bass which has a massive pickup right at the neck just like the EB basses, but more powerful and great sounding. The Eastwood Magnum bass just came out it is costly at $750. but will give you those low deep tone sounds. The Classic 4 sounds quite good in that regard too and gives a nice classic bass sound without sacrificing quality.. and cost $450. You can always get a fender Jazz but they have less boom and are not short scaled. The Classic 4 Eastwood is short scale tho the Magnum (copy of 70's Ovation Magnum Bass) is full scale. There are videos demo'ing these on youtube... I suggest spend a little more and get better quality. If you cant afford much more then I would suggest get a Fender Squire version of the Jazz Bass.. and use an amp or Bass effect device to get the tones you like.",
    "The cable is good, and does it's job. The next day after ordering it, I dropped by The Guitar Center, and purchased a cable that is guaranteed for life, works just as well, and is 1/2 the price...",
    "I had just paid $34 for this cable at a Guitar Center when I saw this on Amazon. It's a very nice cable and I love the cable tie feature you can use to coil up the cable.",
    "I bought this as a gift for my husband who always wanted to to learn to play but never really got around to it. I did a lot of research and found this as the most complete pakage to have for the price that is just unbeatable! The guitar is beautiful in black, and it includes everything you could ever need to play a tune - the picks, a digital tuner, a bag to be able to carry it around and protect the guitar, and extra strings for replacement. I recommend you get the Mel Bay books if you plan to either learn or review...my husband has learned so much since Christmas it is quite amazing. Great buy.",
    "This thing works awesome - at a FRACTION of the cost of buying a keyboard amp, (and much less weight to carry around) you get a much more powerful and rich sound out of plugging your keyboard into the PA, than you would with trying to just plug it in direct. I have only used it for solo gigs and small ensembles without drums, but I've always kept the gain very very low, so I would imagine getting enough sound to keep volume with drums in a larger space would not be a problem.Sooooooo glad I spent money on this instead of a separate keyboard amp.",
    "What an excellent product. It's intuitive, not too combersome and it really makes a difference in the way mobile PC sound plays into external audio equipment. I like the analog volume control, it's really easy to adjust the output level. Other cards have a GUI that is not as easy to use or locate on the fly. As far as the performance, it's definately the best I have used so far.",
    "I bought this to record into my laptop which does not have an internal mic. It sort of records when I yell into it but the sound quality is horrid. Unusable.",
    "Humes & Berg are an adequate (if that) choice for the brass player lacking in coin, but I'd recommend saving up and buying something better. (Unless it's last minute.) One 'nice' thing about these mutes, is that they're widely available in most all music stores, if you need a mute on the fly. That said, don't expect nice sounds from these. I got one, when I needed a mute and had lost my other cup mute. I didn't enjoy using it, even as a backup. I don't even know what happened to mine. It's probably lying somewhere in my room.I've been playing trumpet for ten years, and let me say, I hate the sound these mutes produce. The straight mute, and the cup mute both produce tinny, raspy sounds. A good sound for a cup mute would be soft, feathery, and crisp. These mutes are tinny, tinny, and guess what? Tinny.I'd recommend the Denis Wick Adjustable cup/straight mute. While as a straight mute, the sound leaves a little something to be desired, (I use a Bach Elite for my straight mute) as a cup mute, the sound is simply great. I love my Denis Wick, and the fact the it's collapsible, (the cup portion comes off) it fits easily and neatly into my Strad case, where it is at home.There you have it. Keep this as a last resort, buy something better.",
    "Good strings for the beginner - however, I had to buy them elsewhere, as this seller sent the wrong strings (twice). After two months, I'm still waiting!",
    "have owned this for a couple months, now. since i've had this a couple things have happened. first, i tried this with my old turntable, new audio-technica PL120 and compared it to my stock cartridge (AT-something). the stock cart was nice, no issues. this grado was lower output and slightly lower bass. HOWEVER, clarity was great. lots of back and forth, final conclusion was that this grado does sound much better. bass was just tighter and clarity is a very good thing as well as less noticeable scratchy sounds. only drawback is that with the setup i had (turntable with internal preamp to mixer to amplifier), i was getting a little hum at high volumes. not good.NOW, i have a new (to me) turntable: a used Technics SL1200 mk2 with a ground wire (unlike my AT) and a dj mixer with phono inputs and ground lug. low and behold, two turntables side by side, the experience has reversed: my new technics (although not brand new) can get turned up to the max with ZERO HUM with grado cart. absolutely ZERO. on the other hand, the AT with the AT cartridge (which performed as i initially thought it should) at close to max presents a faint hum (MUCH less than the grado in old AT table setup): super faint, but i do know it's there by comparison the the technics.bottom line: the GRADO is a better cart, OVERALL. but, the AT is louder and boomier in the bass. the grado needs to have the gain turned up a little higher and maybe turn down the treble. but, here's the kicker: the grado is $60 and the AT is $100. so, if you have a turntable with a ground wire and a phono preamp (or my dj mixer) this grado should be an obvious pick. if your rig doesn't have a ground, look at something else. maybe AT or Shure.",
    "Excellent product.....I love it! Great storage space for music and other music accessories in addition to the keyboard. Heavy duty....very good in portable support.",
    "This is a very limited device. As such, I haven't had any problems with it, but its limitations have proven too much for me. Without being able to attach headphones and monitor my input, I really can't use it unfortunately. I imagine under more controlled settings than I usually work in, you could figure out exactly where your vu meters have to be in order to get a good sound into this device, so I think this would probably be good for recording at home, where you can leave it plugged in and set to the same levels.I am right now using it to record from a cassette to mp3, and plugged into my stereo tape deck, I can imagine using it like this a lot. I have not been able to attach it to a hard drive, so I have only used it with a usb2 compact flash reader and a 1gb card, and generally successfully. But again, the only way to know if you are really getting the sound right is to stop recording, remove the card or whatever, and plug it into something that does play it, like a computer. And I have one next to my stereo, so I can do that if I want.For field recording I have found this to be too much of an impediment. I am however enthused about trying the ikey plus, as soon as it is available at your usual online retailers like Amazon here (Just released apparently, and has a mic input and a headphone out.) I will probably sell this one as soon as I can get the plus model.********************************This added much later. I have since sold it and gotten the iKey Plus, and am very pleased with it, at least for the few times I have used it. Not only does the iKey Plus add several key functionalities, but improves on the ones already present. But the absolutely crucial feature of being able to monitor your input is what really made the difference. I'll probably give the Plus model a favorable review in a few more weeks, unless I encounter some major glitch.",
    "I must vehemently disagree with the aforementioned review. I found this CD to be simply an abomination. I don't know what he was listening to, but as far as I'm concerned, it is without question among the worst of the worst of Naxos' very large repertoire. When I bought this CD, I was quite hopeful. I thought that Naxos had eradicated the mediocrity found in many of its earlier recordings. (And the label's recent price hike also raised my expectations). Theodore Kuchar and the National Symphony Orchestra of the Ukraine have made several brilliant recordings for the Naxos label, foremost among them being Kalinnikov's two magnificent symphonies. THAT performance is virtually unassailable. So here is the short list of the many problems which I encountered with this CD.1. The sound and recording quality is ghastly. Throughout the whole CD, I needed my CD player's volume on max just to hear anything. Even then I would say well over 1/3 of the Capriccio Italien is inaudible.2. The tempo and spacing of all the pieces is decidedly to slow. Kuchar has managed to take these masterpieces and turn them into lumbering hulks. When listening to them I honestly had images in my mind of an old tired train sputtering with all its might up a hill that it will ultimately fail ascend.3. Finally the performances on the whole are underwhelming at best. I must particularly point to the 1812 Overture. It is pathetic endeavor. It's literally one step up from a second rate high school band. The cannon's were for me the greatest sadness here. They sound like someone popping a paper bag full of air. I have heard this piece live with real cannons, and these do not compare. Some may call this nit-picking, but for me, it irrevocably compromised the integrity, and majesty that this piece should have.So once more, DON'T BE FOOLED by the cheap price tag. These compositions are ageless masterpieces. If you have never heard them before, don't let this recording be your first experience with them, FOR THE LOVE OF GOD. Rather spend a little more, and get a decent recording and a decent performance. Virtually ANY OTHER one available is superior.I rarely get this angry over a CD.2 THUMBS WAY WAY DOWN",
    "Hi for anybody looking for a desktop rack for the cisco lab this is it. It has a lean towards the back for balance but for the price you cant beat it. It has holes to be a 12u rack but its more of a 11u rack depending on how many switches, routers, model thickness, etc. Cheap and holds my equipment for my ccna/ccnp lab. I have 2 switches and 5 routers. Comes with a bag of 47 screws so i see no reason to buy any additional screws. All in all i highly recommend it.",
    "These strings came within 2 days and were in great condition. They were very cheap in comparison to all of the shops around me. I'm very pleased and plan on ordering them from these guys from now on!",
    "I have had the Peavey Escort for about a year and have been very happy with it. However, I wanted something smaller and quicker to set up and I found the Messenger. This unit is very compact and has high performance for the price. The great thing is that the controls are very similar to the Excort so it is easy to train others to use it. I am very happy with it and the only area of concern is the RCA inputs which are set up for sing along disks, but in fact it is just one channel for left audio and the other channel for right audio. Once you figure it out it is easy, but a little confusing at first.",
    "I find it very difficult to purchase a product that I cannot see a full image: the base of the 2nd tier stand cannot be seem. It's the part that connects to the 1st stand. I'm not secure in purchasing something that doesn't make me confident in its structure. thank you!!",
    "I purchased this to connect our Church's sound mixer to a computer for audio playback. Sounds beautiful! The price is great, the quality is great!",
    "This product does exactly what I want. It allows me to adjust effect parameters on the fly. I use 2 of these expression pedals with my Line6 M9. The build quality is not sub par, however it is not a durable steel chasis you can stand on. All in all if it were to break I would replace it with the same product. I would look at other product offerings if you are rough on your equipment or you are using it for Wah.",
    "Its affordable and works great. What more could you want. The straps thread around the neck and the release is plastic, I love it.",
    "I'm a house DJ and mainly use CDJs, but got a gig at a club that only had Technics 1200s. Been so long since I'd used vinyl I couldn't find my needles. Ordered these over night, they arrived early, nicely packaged and as described. Great needles for mixing, wouldn't recommended if you're a heavy scratcher (which I am not).",
    "Hawaiian born and playing slack key taught to me by immediate family, Ledward Kaapana unselfishly shares secrets of his family playing style. The pace and content of the DVD is detailed and slow moving to allow the viewer to grasp the various techniques. The enclosed tab sheets are \"priceless\" and serve to refine the exemplified styles. This is pure traditional Hawaiian slack key by one of the best players in Hawaii. Much aloha to Bob Brozman and Led Kaapana for the production of a fine product. As Led says, \"Jus' Press\".",
    "I started my search for a midi cable thinking it would either cost an arm and a leg, or close to nothing. I don't want to pay an arm and a leg for a wire, yet I don't want a cheap product that fails to work. The program I have to compose music is the Voyetra Music Write Plus. When I found a midi cable wire that carried the Voyetra name, I knew it was a winner. When I found it at Amazon.com's low price, I knew I HAD to get it. The product works great, and is exactly what I have been searching for. Not only does it come with the wires, but it also comes with a newer version of Music Write Plus I don't have. Two thumbs up to this product, it's makers, and sellers!",
    "The bottom stays vertical in transportation, which makes it less cumbersome, and folds up to create a shelf.In addition to using it as a stand extender, it is great to use with pianos. Flimsy papers on a piano can be SO frustrating, but this does the trick.I am very happy with this purchase.",
    "Like many people who grew up in the 50's, 60's, etc., I had a slew of LP's and wanted to start puting them on CD for my use. This little jewel really does the trick and make it easy. It also produces a very high quality sound.",
    "Best slide cleaner I have since I purchased my trombone in 1951, my old and worn Selmer loves it. I'd recommend to any tromboist, troms rule.",
    "This strap is very comfortable and should last a lifetime. The embossing is first rate.I hand dyed mine with the cactus in green and the steer eyes in red.",
    "I purchased the DVD version of this when it came out, and then, of course, they later brought it out in blue-ray as well. It is easily my favorite music video and I was interested in seeing and especially hearing it in the best quality I could find so I went ahead and bought the blue-ray as well. As far as the content goes, if you like Cream, or Eric Clapton, or Blues, then you will most likely love this concert. It is not flashy, no antics, dancing ,running, leaping about, just great music from some very fine musicians. Eric thanks us for waiting all these years, that the slings and arrows of outrageous fortune cut them off in their prime, and Jack chides him that this is their prime. I agree with Jack. They might not be as nimble as in their younger years, but they play with experience and emotion that more than compensates for the fading of youthful energy.I have read reviews complaining that Ginger seems a little long in tooth and not up to his former standards. While it is true that his drum solo on Toad is not the blazing tapestry of tones from yesteryear, he still rocks the kit in a way few other drummers do. Watch him on Crossroads, or Badge or Outside Woman blues, or Sunshine of your love, and watch how the whole of Albert Hall moves with him. I have heard Eric play some of these songs with various other artists for decades, and though I enjoy many of those versions, none of them hold a candle to these. Within the first few seconds it is immediately apparent that Ginger is on the drums and it is like coming home. It just sounds right. Now, about the quality of the blue-ray compared to the DVD. The video is markedly better, as one might expect. The sound is better as well, though not as much as the video. Considering that this was the best sounding music DVD in my library, any improvement on that is icing on the cake.",
    "I've been using several different programs from ancient to modern, and none of them possess the ease of operation combined with good results. This program will teach you step-by-step, and also help you find parts if you don't have everything you need. You're most difficult step falls on what type of system you have, (that includes your turntable & computer). If you can get your turntable/stereo system to connect properly with your computer you've completed the hardest task! And Spin It Again will help you with this part!For those of you who might be younger let me fill you in: this program works with rare, and hard to find vinyls. I listen to NSBM, industrial, power electronics, folk, old pop, classical, Oi, metal, big band, etc. and it works with them all (though the noise and power electronics can be tricky!)Bottom line is, this transfering stuff can become a part-time job, and this program will help speed you through the process. The only people I wouldn't recommend this product for are the anal rententives who like to spend hours getting each song \"just perfect\", in this case you either need to go get a degree in sound engineering or seek professional help.",
    "If you want to hear your mix the way it should be heard, these are the monitors you want. Fostex has gotten it right with the PM-1, simply amazing sound with unbelievable clarity. Perfect for any studio, home or professional.",
    "Looks custom works perfect. I leave mine on my toms. I bought several I like them so much. It's a quality Key for a small amount of coin.",
    "I had read reviews saying this product does not work on certain music stands, but I have yet to find a stand my accessory shelf does not work on!! It is light weight so it does not pull the stand down or mover the stand in anyway, and it also fits snug to the stand so you do not have to worry about it slipping off!! I would suggest this product for any music teacher or music student!",
    "These are just perfect ... Reading the earlier reviews I was just hoping that I get all of them :) When I saw the package, there was no way anything could come out. Besides they were in a sealed plastic pack so I was really happy. Just thought I did write this review to let others know that the packaging is perfect now!",
    "If you value your mics. like I do, this is a worthwhile investment.",
    "Ernie Ball 6102 Amplifier Pop Out Casters :Ernie Ball 6102 Amplifier Casters Pop OutI had bought a new Fender Hot Rod Deluxe III tube amp about 6 months ago. I had always wished it came with casters. It's a bit of a heavy beast to carry around. Now that I've installed my new Ernie Ball 6102 Amplifier Pop Out Casters it makes lugging the amp a bit more tolerable. I love that when the casters are popped out, the caster bushing is lower than the amps rubberized feet. So stacking and stability are still there on stage or off with the casters removed.Installing the casters was a little nerve wracking. But drilling into a pristine piece of equipment can put anyone on edge. Wish there was a template for drilling. But all in all it was an easy job. Took me maybe 20-30 minutes to install myself.My only gripe was there were no screws packaged with the casters, even though they are shown in the photo here on Amazon. My instance may have been a fluke. But that's okay. Trip to he hardware store solved that problem. Plus I knew the screws were long enough not to come through the inside of the amp case, and thick enough to handle the torque from being used.All in all I'd highly recommend the Ernie Ball 6102 Amplifier Pop Out Casters. It's a good product at a great price.",
    "Boy, I'm really not sure about this one. As a motion picture sound mixer of several decades, I've had no problems navigating around the controls of this home-use mini-console. I am confused, though, about some of the inexplicable fluctuations in output signal I've experienced. For seemingly no reason at all, the output will jump from not nearly enough to way too much, without my having done anything to influence it. I suspect that the cause is some sort of intermittent connection inside the unit, which, in this day and age of relatively consistant component standards, would show a rather shabby level of quality control. Frankly, even in this modest price range, you should at least be able to expect some stability in your signal flow.",
    "I originally gave this item a one star rating because after two years of use some of the keys no longer worked, however, I ordered the part for $15 and replaced it with ease and now my keyboard is in working order again.",
    "I love these picks. The grip on the picks really does help you keep a hold of them as your playing. These are really thin though, so if you're looking for a firmer pick, try finding some thicker ones. The only issue I had was the product picture shows 6 different colors of picks, but then says Light Grey in the product description. Color isn't a big deal, but it would be nice for them to change the picture to match the product more precisely.",
    "This looks like an incorrect Amazon listing, due to a query bug caused by two similar items with the same title. John Abercrombie's instructional Tape/DVD on Homespun Tapes is called \"Jazz Guitar Improvisation\" (and is excellent by the way, but check it's own listing), while this title refers to Sid Jacobs's DVD. Jacobs' other books are also quite good but this listing really doesn't give much information to determine whether it meets your needs.",
    "It came before the date they told us and the throne was great. Very sturdy and comfortable. My son loves it.",
    "This was really a good buy for me as I just started to learn key board.This opinion I got from some of my expert friends in this field after seeing this item.So, folks, go ahead and buy this, you won't be disappointed...Good luck",
    "This guitar would have been perfect if it were PINK as in the description. When my god-daughter opened it up, while on the phone with me and told me it was RED, I was very upset.",
    "How could you do better? Martin Uke strings are great quality strings, and they come at a fair price, right to your door, in short order from this nice vendor. I ordered the soprano/concert set of strings. They were exactly as I expected.",
    "This metronome is very small -- slightly larger than a credit card, and just a quarter inch thick or so. This makes it handy for use on the road, but there are tradeoffs. First, the maximum volume is not all that loud. Second, because of the size, there are only four buttons on the unit, and the user interface thus has to do the rest: if you want to adjust the volume, for example, there is no simple \"volume\" knob or button. You have to use the \"select\" button and cycle through the various options, and then decrease/increase volume.For regular home use, then, this is not the ideal unit, in my estimation. I'd prefer something that is more quickly/easily adjustable, and louder.",
    "Just received this item and from the picture on Amazon (and for $6.99) i was really expecting this to be a fairly cheapo item. But, it actually feels substantial and I thing will last a long time. The handles themselves are metal with hard plastic covers. Definitely worth the price.",
    "Terrible purchase. This item does not work for me. I bought it late December and ignorantly never tested it when I first got it. It probably wouldn't have helped much anyway. As the price and hassle for returning wouldn't have been worth the headache. Just tested this microphone the other day and it didn't work. I never used it previously. In fact, it was still in the box when I took it out to use this past week. I initially thought there was something wrong with my camera's microphone jack. However, I tested it on several other cameras, computers and on an MP3 recorder. Still nothing.It's incredibly difficult to find a durable, quality and inexpensive lav mic. I have purchased 2 other mics before this one and they never last. They'll just crap out on you during the middle of a shoot. Or you'll go to test the sound before filming and realize it has surpassed its 3 month design. Can't imagine how it's so difficult to find a halfway decent microphone to plug straight into a camera or recorder.Don't waste your time or money. Even if you get one of these and it works out of the box, my guess is it won't last long.Pass over this and keep looking.Good luck!",
    "Love it! Good price and sound quality I have used high end mics and yes a 416 is much better but Rode make good products and this is one of them enough said.",
    "....bought this for my budding young singer....Although I know nothing about mics, it turns out she is the envy of some of our \"more experienced\" relatives....We have to hide it, now....",
    "Found this little device for a good price and it worked just as described. Added a nice touch to my transparent System Unit case.",
    "Wears through batteries super-fast, glitches and fails to operate. After just a few battery changes, the springs in the battery compartment snap off.",
    "This is a considerable improvement over what I was using before - I do feel like I have to reapply the rosin a lot more frequently though. Also, it doesn't seem as &#34;dust free&#34; as I thought it would be. After each practice I still have to wipe off a good bit of rosin from under the strings and from the edge of the fingerboard. It also likes to cake onto the strings, so I wind up doing a bit of scraping after I play. Still, I would recommend it.",
    "I have it for more than 6 months and mostly use it for practicing with the metronome. I have another tuner, which is set EADGBE, that is much easy to tune without any confusion. Although this tuner has flexibility for tuning differently, it's confusing for me because it keeps changing the chord and going left & right +/-20 or more. However, it's a bonus for using the tuner, and I don't have to bring all to the classes. For the metronome, which is my initial purpose to purchase it, it's great and have enough adjustable calibration, 13 beats, rhythms, and tempos for practices.",
    "I got this product think because of the price it would be flimsy. But I bought because of the other 5 star review. It felt very sturdy when I pulled it of the box. It also includes a microphone clip. A good microphone cable isXLR male to XLR female Microphone Cable - 15 feet.",
    "This Microfone was worst to use and it was very expensive. waste your money to buy it. They used small battery to run, and small batery costly as well. Finally Should not buy this Microphone unless you have extra money to throw away for fun....",
    "Some have commented on the smell of the case, we did find it to be there in ours. The guitar itself is very nice well made and sounds great. The guitar is worth the price so if you don't like the case smell then get something else. The case design is very nice and we hope that in time the smell will go away. All in all a very good value.",
    "Length:: 9:59 MinsI got the Behringer XENYX 1202FX so I could achieve better quality and extendable audio abilites that my PC alone could not provide. I primarily use my mixer for podcasting and youtube video creation. The mixer allows me to connect 4 mono audio input devices like MICs, and upto 4 stereo audio input devices and control the levels for each input device to mix into a cohesive output sound.You could easily hook up the Master Output to an amp, powered speakers, or to your PC's Sound LINE IN if you want. However, I do not use the Master Output much at all. Instead, I hook up the provided CD/TAPE INPUT/OUTPUT connections to a Berhinger UCA222 USB Audio Interface. This gives me a much better sound that my PC equipped sound card. So using the UCA222 on a system that already has a sound card, expands your system to have 2 sound card devices.To have your PC software receive audio from your mixer thru the UCA222, you need to make sure you configure your software to choose the USB as your sound source for recording. If you don't use the UCA222 or similar device, and instead just hook up the mixer to your PC's sound card LINE IN, then there's nothing you need to configure on your PC.I love this mixer. I can connect my iPhone to one of the stereo INPUTS, a professional MIC to one of the MONO inputs, and whatever other audio devices I want to add on such as a CD Player, an MP3 Player, even the output from a PC Sound card.I highly recommend this mixer. Behringer has other models - some much more robust, and others far simpler. ou can get an idea what is available on their site",
    "My wife wanted a disco at our house so I did my research on Amazon and bought a few items. This was fantastic. It puts out a lot of smoke, although I had to go back and do it again every 5 mins or so. The next day I found that some of the juice had leaked out, so next time I'll put it on a tray. I bought a large gallon jug of spare juice, but in the end the bottle that comes with this was more than enough for two evenings of dancing.",
    "The CDDB database flat out does not work at all which renders the program essentially useless. And you can forget MAGIX support or the user forum. AVOID THIS PRODUCT!!",
    "I strongly recommend these bongo drums for beginners. You don't have to tune them, they're easy on the leg, they sound great, and you can't beat the price.",
    "My son uses this for practicing at home with his electric bass (Jazz Band) and his standup bass (Chamber Orchestra). It is solid, yet flexible in height and angle. Assembly was a breeze. This is the classic music stand in schools and is also excellent for home use. Built like a tank. Should last forever and can be passed down to the next generation of musicians in the family.",
    "This item serves its purpose quite well.... but the only issue is that the arms for the brace could have been 3 inches longer... but the concept is very nice....",
    "The product worked decently for about 3 months. The mic inputs never sounded great. Suddenly, for no reason, it stopped initializing on startup. Now the extremely bright LED light just blinks. While this is good for party time in the computer room it is not good for recording songs. Buy something more reliable.",
    "This is a great mic cable that seems to perform well. The fact that it comes with a lifetime warranty is a big plus, especially at this price. I however have not had to try their warranty service as of yet so cannot comment on how good their customer service is.Note, Planet Waves parent company is D'Addario so they are the same company.",
    "Excellent product. Even works for cassettes, even though the sound from some cassettes aren't as good depending on if they are original or copies.",
    "My hubby and I are both musicians, and hope to foster a love of music in our children. With the help of this full octave xylophone (with attached mallet, so it won't get lost!) and other Little Tikes instruments, we hope to do that. There are so many tunes you can play with just these 8 bars; however, I plan to get her the piano--you can imagine how an exited toddler won't always hit the target with a mallet! Don't let that deter you, tho'--if it makes music fun for the child, go for it! And of course, Little Tikes is virtually indestructable!",
    "I work for a hospital and present health education programs out in the community. I need a sound system that is portable, yet fairly powerful and easy to use. I originally purchased the predecessor to this sound system about 7 years ago, and had nothing but trouble with it. I decided to purchase this new model, hoping that improvements had been made. Unfortunately, that wasn't the case. I often check to make sure it works before I go out into the field, but when I set up it doesn't work. The batteries are new, but it won't turn on. Sometimes if you play around with the battery pack and push it into position (it often pops out as there are 10 batteries to jam into the space) it will work. Also,nomatter how I position myself and the case, I get a lot of feedback. Sometimes it's the microphone that doesn't work even though new batteries have been used. Very frustrating. We spent over $1,000 on 2 of these products, and don't have a workable sound system. Stay away from this one!",
    "I've had a Yamaha Silent Brass System for years and when I need to practice without disturbing others, this does the trick quite nicely. It really does feel remarkably natural with minimal back pressure!I also use the mute by itself for a quick warm-up before gigs, when I don't want to take the time to setup the full system. 2 Thumbs Up!",
    "Very nice unit. Works well with a variety of guitars. Solid unit. Highly recommended and reasonable price. Good birthday gift for our son.",
    "first off i see the best in things and this does have some qualities that are ok.You can \"hear\" it and its bass response is decent.now i wouldnt be doing my job if i didnt say why i dont like them.i bought 6 of them to use as monitors on my small pa. I use them alongside sx ev300's and of course these dont match up but they have very low defined high end, the horn is not clear, the woofer is muddy. the wiring on the jacks are a joke and wired backwards. 2 out of six had different woofers in them. I am going to try and make these sound better and will report back !Also the actual speaker shipped to you does not match the picture, please amazon fix this.",
    "This table top music stand was just what I was looking for. I read all the reviews here and decided to purchase it. It is sturdy and easy to alter the angle. Plus you can't beat the price. Something similar in my local music store was around $40.",
    "This guitar is the perfect size for my 11 year old daughter. When it is tuned it has a very nice sound. The only problem is that it won't hold a tune. I think new strings will solve the problem. The CD is nice, but it moves too fast for someone trying to learn how to play.",
    "I almost bought a lp to mp3 product to record on my computer until I seen this product on Amazon.com. This is old school and I love it! Don't bother with the computer method this is much simpler to use and it works great. Just hook it up to your receiver and start recording your lp's in no time. You have to use the analog input for lp's by pushing the input button on the front panel until analog shows up on the display and then push the auto/manual button until the manual input comes up on the dispay. First put in a blank cd-r audio disc in the recorder and wait for the blank disc shows up on the display. Then play your record and push record and wait for record pause to show up and you can set your recording level by using the level plus or minus buttons. Once you have the optimal recording level set you are ready to record. You also have to manually track each song by pushing the record button between each song so you can separate the tracks. It helps if you write down the song times on a sheet of paper so you can know when the songs will end. This way you can assure you will track each song properly without any problems. I love it and I am getting back to recording my albums like I used to when I had a cassete recorder. I highly recomend this Teac cd-r recorder and soon you will be making your own cd audio disks and loving it!",
    "Great item that is well worth the money. My daughter loves how simple it is to use. She also enjoys how easy it is to make it speed up or slow down.",
    "I dunno I thought I needed a pick holder, already had one but had forgotten. Not sure where I put it now, but it I am sure one day I will use it and just LOVE it for it's ergonomic beauty and vast utilitarian properties. It's greatest purpose thus far has been qualifying for Super Savings so that a $23 item could ship free as well.",
    "I bought this mic for my neice it was delivered efficiently and she says it is working out great. She uses it all the time posting videos on You Tube. No complaints about the seller, professional.",
    "Before I start, I have to tell you that I didn't try to use this endpin rest with a cello or an upright bass. I have a custom instrument, a modified guitarr&oacute;n with a home made endpin, the bottom end of which is an ordinary 1-inch, rubber cane tip--so this might not apply to your instrument.Anyway, this thing worked pretty well on carpet where you don't need it. The lip isn't very high, though, so my cane tip did want to come out of it. Where you DO need it--on a hardwood or synthetic floor--this thing was useless. It slid around worse than my cane tip by itself. If you get down on your knees each time you want to use it with a can of Pledge and a dust rag and clean all the dust off the floor first, then do that to the bottom of this endpin rest, it'd probably work fine--but who wants that? Or you could spill some cola on the floor first and let it get tacky--that would help this endpin rest considerably, I'll bet. Or just use it on carpeting.Anyway, I made the perfect endpin rest myself. It consists of a metal cappuccino cup and four-foot web strap and buckle. One end of the strap goes around the cup handle and the other goes around the rung or leg of whatever chair or stool I'm sitting on. Totally solid and secure. Works absolutely perfectly.",
    "I ended up returning it, and taking it from a four-star review down to a three-star. Why?It boils down to the pickup selector switch. I mentioned in the original review that it was badly positioned, and I found that I was constantly hitting the switch with my picking hand while playing. And since I generally play with the neck pickup selected, this meant that I was constantly having my playing interrupted by an abrupt change in tone. In addition to being badly-positioned, the switch itself is too easy to flip -- it takes only a light touch to move it out of position.It's a shame because in most other respects the guitar was great, but that pickup switch was a deal breaker.---------------------------------------------------------------I needed a plain-jane Telecaster-style guitar with some tonal flexibility (humbucker/single-coil switch), a comfortable neck, and a quality build. After doing a lot of research and considering the Fender Blacktop Tele, I chose the Schecter PT. It arrived quickly, in good shape, and with a great set-up (the guitar is Korean-made, but is set up by the Schecter guys in their L.A. factory, and they did a fine job).The build is tight and clean. Frets are smooth and polished, body laquer is evenly applied, and the attractive cream binding is flawless as far as I can tell. Action is fairly low (though not too low), and the controls all seem solid. Pickups sound good, though a bit beefy (even for humbuckers). Single-coil tone is very Tele-like. The guitar is a bit heavy, but that's the price you pay for playing a Tele-style axe.One gripe: I wish the pickup switch were further offset, because it's easy to hit it with your picking hand.So far, the Schecter PT is a good guitar for the money. It's plain, but attractive, and it has a quality of build and setup that's a little surprising at this price-point.",
    "Easy to use and sounds good! We got what we expected. For the price this is a good value and quality.",
    "I had a serious problem called propagation delay, something ive never heard before since I am novice in this technology field. Basicaly it means tha there is an anoying and confusing delay between your voice and the bakground music.The problem seems unsurmountable and after browsing all over the internet to no avail I was almost ready to give up until I fideled with a very simple solution, instead of buying a profesiona mixer.I connected the device directly to an amplifier instead of to the tv but left the video output directly to the tv and that took care of it.So that made a cheap device worth the money.",
    "Was upgrading the chrome on an MIM. Perfect fit. Used Switchcraft jack. Includes screws and 1 washer(for the jack). Looks great.",
    "This case it great. It's small but big enough to hold the clarinet and accessories. It is very lightweight. I got this as a christmas present, and I'm enjoying it allready. The only thing a little wrong with it, is that when you put your mouthpeice cap over the mouthpeice it's kinda trick to fit it in. But I found a way that it works. I recommend this case to everyone.",
    "I just love it when something arrives that works flawlessly. Such is the case with this little beauty. I just bought a Panasonic SPCTX7 home theater and thought for sure there was no way it would get along with my Bang and Olufsen circa 80s record player. Bought it on a whim. Its nothing short of miraculous. Just plugged the thing in 20 min ago, and working like a charm. No static. Crystal clear!!! Dont hesitate to buy~!!!",
    "This product was just what I wanted and expected. Save space, it's compact and the price was right. I recomend it for those who use the fender pastport.",
    "I was looking for a crispy sound and this is the one.A really versatil hi-hat beacause when you need strong and hard sound, just opening it a little bit, you get it. If you want a sweet and crispy sound for latin rythms then you just have to know how to play it to get it.It's a really nice hi-hat, i just bought it and i know i still need to keep playing it to get more out of it.",
    "I have been a touring drummer for most of my life.. it makes sense to buy a good product for a great price... if you play out a lot and have to replace stuff...other cymbals can cost 100's of dollars more and cymbals as we know don't last forever so replace them with something that does not break the bank and sounds just as good and looks great..they take a beating!!",
    "Whatever you do, rent rather than buy this instrument. This is not a good choice at all. PLYWOOD?! You need a real ebony fingerboard and who cares about horsehair. Some of the worst bows come with \"real horsehair.\" As an experienced violist, don't buy this instrument. Go to your local store and rent a viola or violin. This is a very bad choice. If you NEED to buy a violin or other orchestra instrument online, take my advice and go to sharmusic.com. Don't waste your money on this viola.",
    "Purchased item for a beginner student. Wood was beautiful. Case was very sturdy. Wonderful that it came with two bows. We are happy with the purchase of fhis product.",
    "This is exactly what I was hoping for. The string cutter works better than expected. It's nice not having to go hunt down diagonal pliers when it's string changing time. The only little issue is that it's a little tougher to spin really fast than the little string winders because of the grip. No biggie though.",
    "I was worried I didn't receive any shipping confirmation over a week after purchasing the \"package\". I was going to wait until the final day of the \"estimated arivial\" of the package. When the package finally came, it only included the mic and cable but no mic stand. I figured the stand was coming in a separate package, the packing slip printed and the \"comments\" said \"no mic stand\". I checked back on the online description and customer reviews and didn't see any note of \"mic and stand package but no mic stand\".I took the lost, I'll never buy from these individual sellers again.",
    "My first set of 15\" hihats and I love them... the a series is not too heavy, they have a very balanced sound.... great addition to my larger drums.",
    "Love this mic!! Used it for a quartet and the sound was phenomenal also was great with a instrumental group.Everyone came through clearly and distinctly.Great vendor as well, Shipping was fast and well packaged.Thanks to all of you!",
    "THe CDJ 200 is one of the best mixing turntables out there and its affordable..One of the features i like about the CDJ is the beat-loop where it keeps the BPM constant until you chanhe it..its good for changing music...i really recommend this item to everyone who wants to DJ.",
    "This was a gift for my grandson, who produces DVD's in recording studios.He plays a guitar, while singing songs for which he writes the lyrics.He now has all the equipment needed to produce hiw own DVD's. I was reallypleased to receive this particular product the day before Christmas - whenI expected it on the 30th of December.He is very pleased with the quality of the product.Well done Amazon!",
    "I put these on the bottom of my kid's high chair and me and the old lady can now sling the brat around the kitchen back and forth at each other. \"You feed 'em, I already fed the little monster yesterday.\" \"I ain't gonna feed the mooch, he doesn't even work, you feed him, here catch.\" We can whip Jr. back and forth at each other without much effort at all. I imagine these would work well on amps as well. Good solid construction and rubber bushings that go between the metal glide and the amp, or high chair.",
    "Works great in a quiet room. When I used it at a performance at a pub the ambient noise renders the tuner useless. Even with a plug-in clip-on mic on the instrument it did not register the note reliably. When this happened I would borrow a Yamaha TD-10 from my guitarist which worked great w/o a plug-in mic. I've since sold the TD-10 and bought a new Yamaha TD-10, which is sadly discontinued.",
    "This device has some potential, but it's not close to being a professional tool. Don't plan on taking this thing on the road. One small bump and you'll hear loose screws shaking inside. The play/cue buttons are terrible too, so mixing and blending can be a pain when you have to press the button repeatedly for it to play. I can't seem to get a scratch effect either, though it's supposed to be capable of it. If that sound it makes when you spin the wheel is what they are calling scratch, then the effect needs some work. If you're just doing house parties and/or want a DJ toy, get this. Otherwise get turn tables (CD or Vinyl) and Final Scratch.",
    "Couldn't be happier! Have everything you need for a neuro exam in one instrument! Should have been a little less bulky - otherwise a great buy!",
    "Whoever created this was a genius. I got this for Christmas and it works pretty well. Theres a little trouble where it wont engage properly when you push the pedal down, and you have to almost drive your foot into the pedal, but you could just adjust the top part so its closer to the clutch, making it easier.Once you had it perfectly placed, it's ready for some action.",
    "Not too bad. I was expecting it to be a little softer, but it is way better than the original rosin that I got with my violin. I don't have a lot of experience with rosins, but this does exactly what it advertises and works just fine.",
    "I bought two items from the same maker and vendor at the same time; I was looking at one, and it looked like such a good deal that I decided to check out their other offerings. I am so glad that I did. Yesterday I received both this keyboard stand and aGearlux Deluxe Collapsible Orchestra Music Stand - Black. The quality of each item was substantially better than I expected. Both items feel solid and well made, and I expect to get years of use from them.",
    "I'm sure glad that I bought these straps, there not leather but are put together very well. I plan on using them as backups in the studio. The price was just right, cam quickly and I'd buy them again.",
    "This was one of the great superbands of the 60's and 70's and apparently into the 2000 era. The music of cream was visionary and futuristic. It brought back some dear memories.",
    "The bag itself is great for the cymbals. However, the shoulder straps started failing at the top seam a few months after I received it. Poor quality strapping material and sewing in my opinion. I'm looking to have the straps reattached and reinforced at the top seam.",
    "Works beautifully with my Taylor 914ce hooked into my Marshall, or into my Line 6 then into my amp. These cables will last a long time, crystal clear tone for a far better price than the Planet Waves cable.",
    "I ordered the nero 6 and I recieved the suite edition. This did not have the features I needed and I will have to buy the retail version. Amazon was great about it and gave no hassel about the return. It was quick and professional, I was very pleased with their respones. Neor 6 is alot easier to use then 5.5 and has ALOT more features. You can download a demo to make sure it is what you want, but I would recomened it to any one.",
    "I got this spray bottle thinking it had oil in it but it is empty it is just a spray bottle.",
    "I was having some problems with my Ego Compressor comp getting noisey, sent it back and found out that It Had been using a slightly drained battery, so I got one of these and it is great, nice and quiet again, half the price of the boss one.",
    "I never got a chance to use this microphone because it doesn't work with Windows 7. Maybe it would work with XP? This sells for $99.99 @ Best Buy and I'm not sure if that one would work with Windows 7, but Blue claims the \"cheap ones\" on Amazon are sometimes defective. Save yourself the headache and pay up for one that will work with Windows 7.",
    "My friend enjoyed this as a gift I gave her. She says it's saved her \"recording life\" haha.",
    "This unit puts out a lot of light. It is definitely a pinpoint spot. It does not wash nearly as much as my regular spot bulbs. However, the light has a definite blue tint to it. I'm not sure how that may affect the color on the video of my performances, but will keep an eye on it.",
    "Actually, a GREAT metronome, except apparently I'm the only one who finds the dial exasperatingly hard to turn. A simple set of up/down buttons would have been much more ergonomic. I solved the design flaw with carpet tape (double-sided duct tape) and the tops of two zip ties. I posted an image under \"customer images\". Now it works beautifully and is easy as pie to spin to the desired tempo. I rated only one star in an effort to get Korg's attention. Really an excellent product with an annoyingly designed tempo dial.",
    "Hello,I'm in brazil and seems that this product can't be shipped to me! Is this right? or can you do something?",
    "I got this for a secret guitar for Christmas and this thing is built to impress!!! Thick but flexible... VERY ornate... I would buy this again in a second!!! as a mater of fact I am going to go look for one for me right now =D",
    "This mic has surprisingly good sound for this price range! I would definitely recommend it!",
    "very good guitar every other store i looked at for this guitar was at least $300 but this is a great deal",
    "This capo is works well but only if you really wrench it tight...but then it sticks a bit trying to release it. But for the price, I have no complaints.",
    "I bought a 3 pack of Hohner Blues Harps.At first, they played alright, but after about a year some of the notes wouldn't play properly or it took a half second before the reed would activate, which doesn't make for really good music if you can't blow a note and have it play right away. The unit is not dirty, nor was it abused. I disassembled it and checked the reeds and they were clean. Some people swear by these, but 2 out of the 3 I bought were junk.",
    "I got this mic about a year ago and have been using it with a Presonus Firebox and Logic 7 to record vocals, acoustic guitar, and mic'ing electric guitar played through a Vox AC15 tube amp. Thus far I am happy with this mic. In terms of sound, it is good for vocals, giving a really nice sound with very low noise. After I have tweaked the EQ in Logic to give a boost to the mid-range frequencies, and put a bit of reverb on them, the vocals come out sounding very nice.I've used poor quality mic's for recording for a long time, always thinking that an expensive mic would be out of my budget, since I just do casual home recording. But a friend of mine told me that nowadays there are mic's in the 200 dollar range that can come close to those that are 1000 dollars or more. I'm not sure about that since I haven't done the comparisons myself, but I can say that this is far and beyond better than anything I have ever used before. Not just the sound quality, but the look and build of the mic are very solid and professional. I like the fact that it comes with a suspension holder and a nice bag to hold and protect the mic.If this is slightly above your budget level, I would suggest checking out Shure SM 57 as a great all-purpose dynamic mic.EDIT: One year later, after building up my studio more and comparing this mic with a few others in its price range, and slightly cheaper, I would say that this mic is a bit brighter and harsher on vocals than some other options. I'm now preferring an Apex 205 ribbon mic or a Shure SM57 or 58 for vocals (both available for $80-90). They are both warmer than this mic for vocals, and more pleasing for my voice, at least! I'm now looking for alternative condenser mic's to replace this one with. However, for two years, it did serve me well!",
    "This is the absolute best shotgun microphone you can get under $100. if you recording anything outdoors I would highly recommend getting this as long as you're not next to the freeway sounds great.",
    "NOT WHAT I ORDERED. THIS WAS A CASE COVER FOR A FLUTE. WHAT I TRIED TO ORDER WAS A CASE FOR BOTH THE FLUTE AND PICCOLO. A DOUBLE CASE.",
    "I've been using this Rode mic to make archival videos of concerts for the last 3 years and it is awesome. Clear, transparent and the next best thing to being there. Great sound at a reasonable price seems to be the Rode mission statement. I wish the camera man(me)was as good as the mic!",
    "I bought this stand thinking it was the model that had the FOLDING legs that slid into the main compartment. I was mistaken. The legs are, as advertised, permanently attached. They can be unscrewed using an Alan wrench, and then placed into the tower, however I found it VERY difficult to do so, fearing I would scratch the outer paint. The arms are very sturdy so long as you're using a light, compact keyboard. I have a full sized 76-key synth on the bottom, and depending how into my playing I get (when I start hammering away on the keys), the stand does shake. As for the top stand, I have a portable 61-key synth. While it's sturdy, if I only have one hand resting on the pitch bend, while the other hand is busy doing whatever else, the keyboard tilts in that direction - which isn't a fault of the stand, but instead of physics. This stand looks great, travels great, doesn't show much wear and tear from gigs, and is pretty much customizable to any height requirements. Keep in mind the MIC BOOM is NOT INCLUDED. And the stand doesn't have a handle like the one in the picture does, either.",
    "Nice quality at a good price. No dimensions listed so I went by the picture for size. The mallet was three times larger than I expected. Am using it, but wish it was smaller.",
    "This is an awesome product. It produces a really clean sound, giving you that greaty 'plucky' quality. Turning up the sustain between 12:00 and 3:00 is the sweet spot for this pedal. The sustain is so natural. Finally, I like combining it with an overdrive pedal. Set your gain to low or medium (I prefer the Zen pedal, but also use the Ibanez T9 mod plus), and the Keeley compressor transforms that into a truly warm quality that is great for blues/rock, maintaining a nice crisp edge. The Keeley compressor is a bit more expensive than other compressors, but from what I've heard and going by the experiences of my friends, it is well worth the difference.",
    "Over all just a little bit too slick for my liking. Without a doubt it was great to see them play again, but if I had a say in the matter they would have used the same amps, guitars, and basses from the old days. (I know Jack says they tried that approach in rehearsals but \"didn't like it\") I found Jack's hi tech bass rig sounded too clean, and was under mixed. I thought the drums sounded fabulous as did Ginger's drumming. That brings me to Eric, sigh...would it have killed him to strap on a Gibson for some of these songs? The Strat sounded good on stuff like \"Badge\", and a couple of others, but \"Crossroads\"?... c'mon! That's like playing \"Whole Lotta Love\" on a banjo. I have to echo what others have said here about song selection on the DVD, No \"Tales of Brave Ulyses\", but we get \"Stormy Monday\"...that ain't right! Oh, and \"White Room\": Eric, the wah wah is that long skinny black pedal on the floor beside the Leslie switch.",
    "I was deciding between two and three stars. As a general assessory kit, this was fine but this was listed as a complete care and cleaning kit which it is DEFINITELY not. There is one tiny half pipe cleaner and a brush (2 in 1) and that's the extent. I needed something to clean between the keys and joints and this is definitely, definitely not it. However, it does come with a bunch of cloths and leather like pieces for buffing. It does not include a user pamphlet as stated.",
    "I'd first like to say that I bought this guitar on Amazon for about $65, a lot cheaper than it's being sold now (currently $111). It's a wonderful guitar for an inexpensive solidbody, but it looks a little different than the picture would lead you to believe. For one, the guitar doesn't have a \"finish,\" not even a glossy clearcoat -- it's solidbody wood, sanded smooth and given a deep wood stain. Secondly, the guitar is pictured as being much lighter in color than it actually is. The photo shows it looking almost like a red colored wood; in reality, it's a much darker, deep brown, akin to coffee.This does not, however, affect its playability, which is wonderful. I have a bit of buzzing on one fret, but that can easily be fixed with a good sanding and polish. The guitar can also be strung and tuned easily, though with any guitar of this body style you'll have to continually tune-and-retune until the strings will keep a tuning. It's a very heavy, sturdy guitar, and for a solidbody with two humbuckers you'll likely not find one that sounds as meaty and smooth.",
    "These were good drumsticks. I used Vic Firth sticks for a long time, and they were always good. These particular sticks performed very well. They were 5A's, so they were lightweight, easy to grip, and were very easy to move around. When you play drums fast, it helps to have a stick that is not too heavy to use. These also had a lacquer coating, so they had a good grip. My only problem with these were that they had wooden tips. I learned that wooden tips seem to come apart and shred after a while, but only if you're hitting cymbals, not if you're just hitting drums. If you decide to buy these sticks, buy the kind with a nylon tip, they will last longer.",
    "Giardinelli Master Violin Care Pack with Chin CushionOK, first I'm going to complain then I shall compliment. First off I didn't get the red cloth that is shown above; second, I didn't get a pretty light blue chin cushion (I got a gray ugly one instead); third, I received a thing of dark rosin instead of the light one shown above (dark rosin is for colder climates not for warmer climates, light is for warmer climates like where I...I...I am!). I received the promised pouch, yellow soft cloth, peg grip drops, polish, duster, and that metal thing. Compliments, eh, I might tell those one day the only compliments I have for this so far is it's useful, but not what I (emphasizes the I) wanted or was expecting!",
    "I bought this mainly for the good reviews and low price, but despite it's low price, it is a very decent pop filter. It came well packaged and 2 layers of mesh with about a centimeter and a half separating them. No explosives get through this. You can feel the difference by blowing on your hand without the pop filter and then blowing on your hand with the pop filter between them. I was going to go with the Musicians Gear Double Pop Filter but really there is absolutely no need for that. This works perfectly, and it ended up being cheaper than the other Musicians Gear Single Pop Filter would have been.",
    "As a bass guitarist, this pedal is slightly limited on all it's features. The \"oct 1\" or one octave below function is pretty good, a little hard to catch on the lower strings of a 4-string bass, but still audible. However, the 2 octave function isn't of much use at lower notes. Also, the drive channel isn't anything spectacular. I'd still use an ODB-3 or Big Muff to get any distortion.",
    "First let me say I have 100 mics, 50 speakers, and 30 amps for Pro Sound, DJ and PA rentals and been doing pro sound for almost 50 years. 75% of all my equipment is Electro-voice and have never been let down by an EV mic, amp, mixer or speaker. I have been let down big time during perfomances by Mackie, Carvin, Crown, Peavey, Community, etc.There are times (mostly out of town gigs) where the situation changes and I'm forced to buy equipment in an emergency, and if the local dealer does'nt stock Electro-voice, I take whatever is available. That's how I ended up with two Yamaha P5000s amps. (Yamaha is my second choice after Electro-voice.)If you don't put too much emphasis on these first three cons, these amps may be ideal for you.Con #1. The speaker outputs are both speakon and 1/4 jacks which at first seems to be a good thing. However,the 1/4 jacks are not true \"jacks\" as we know them. They are a plastic barrels mounted on a printed circuit board. If you,a guest, or a waiter/waitress gets tangled in the speaker cord, these plastic tubes break very easily.This has happened to once-in-a-lifetime renters on several of my other Yamaha amps (EMX 88S, EMX860ST).Con #2 The power cord is hard wired instead of the typical computer power cord. Again at first, looks like a good a idea until you realize it's an 18 gauge cord. UL does'nt allow 18 gauge extension cords anymore because offires when people use them for heaters, toasters, hair dryers etc.Even all of my microphone cords are 20 gauge which is the next step up from 18 gaugeFor an extra 25 cents, Yamaha could haveused a 14 gauge cord (or 16 gauge at the minimum). I will replace the 18ga cord with a 14ga cord when thewarranty expires. (I assume the Yamaha engineers have never been at the end of four hundred feet ofelectrical extensions begging for every volt & ampere, or been plugged into a generator also operatinga moon bounce, beer truck, and tent heater only having 90 volts available.)Con #3 The extra large front handles are eye appealing, until you try to mount the amp in a road case. The handlesstick out way to far and you can't use the cover of the road case. The handles cannot easily be removedwithout violating the warranty. Looks like you have to disassemble the top, bottom and front to gain accessto the screws holding the handles. A bum design.Pro #1 The reason Yamaha is my second choice after EV is the design of their limiter. I have other non-EVand non-Yamaha amps that leave an audible drop out when the limiter activates. It may only be tenths ofa second, but the audience can detect the drop out. The P5000S limiters act flawlessly. There is nointerupption in the music, no pressure wave sent out when they release, and you can't really tellwhen the limiters activate other than by looking at the signal leds.Pro #2 The mode switch on the rear which allows you to operate CHAN A full range and CHAN B for subs, orCHAN A&B; for mains, or CHAN A&B; for subs with a frequency control which allows you to control thesignal sent to the subs.Pro #3 Recessed and detented front gain controls which are protected from damage and quite accuratewhen setting CHAN A&B; to the same output level.Pro #4 Twin fans, pure sound, impeccable inside wiring, switching power supply (no massive toroidal transformers),relativeley light weight per watt.Pro #5 Removable clear plastic anti-tampering windows which cover the front gain controls when you want to seta certain level and don't want anyone monkeying with the knobs. Easliy removed with a suppliedwrench.Pro #6 A seemingly minor point, but they include a cover for the rear 5-way binding post/banana jack panel.May not seem important until you understand where once-in-a-lifetime renters try to plug things in.Conclusion - in my opinion, if Yamaha spent $2.00 for a better power cord, Switchcraft speaker jacks instead ofplastic tubes, and easily removable handles, I would give the P5000S a glowing perfect rating.But until then, I say 3.0 mostly because of potential catastrophic failure of the 1/4 plastic speaker jacks (tubes/barrels)Renters always get 1/4 cables anymore. They don't know how to use speakons. I've gottenamps back with two 50 foot cables wrapped around the amp because they forgot how to remove the speakonconnectors.I'll be modifying both amps as soon as the warranty expires to change the power cord, remove thehandles, and install metal Switchcraft speaker jacks.",
    "These D'Addario Medium Acoustic Guitar Strings come as individually packaged sets of three, with the necessary six strings in each set. Being new to guitars, we had no idea how often the strings would need to be replaced so this three pack seemed like a good starting point.The strings are good quality, produce accurate tones (according to our auto-tuner), and have held up well.Highly RecommendedCFH",
    "I bought this cable to finally take advantage of the MIDI from an old Casio keyboard. I'm running the Casio into a Macbook Pro, and using the synths in Garageband. Everything is working great. No complaints.",
    "if you like dylan you have to have this. while it doesnt' contain all of his greatest works it does have some of the biggest hits. i also highly recommend this to anyone who's a new dylan fan. it gives you a good taste of what his music is like and leaves you wanting more. dylan is a singer/songwriter who will be around for all time. definitely one of the best albums in my collection and is a great addition to any collection.",
    "Very poor sound quality. Returned and got an HHX Evolution instead. Bottom line: You get what you pay for.",
    "Back in the seventies and until recently Augustine strings have sounded really great but were not consistently in tune , more often out . The new ones in the cardboard package (so far the black and red label traditional ones)are actually in tune !They have a full and natural sound . Any individual guitar will respond uniquely to each formulation of string ,some guitars need more treble or more bass ,more middle or less mid-range etc. These strings will compliment most any guitar in my opinion .Andres Segovia liked them *",
    "This version has been eclipsed by Acid Music 2.0. The differences between the versions are significant, and it's well worth the extra money to get the latest version.",
    "I have purchased Clayton picks in the past and have found them to be pretty sturdy and reliable.I've even bought the Hula Hottie picks before this. Visiting guitarists always get a kick out of them when the reach into my pick jar and find one of the hotties.This batch has more curves than needed.Unlike past picks orders, which I felt were of good quality, these are curved.I'm guessing that the press Clayton is using to print the artwork is forcing a Pringles-chip-like curve into the picks.All but two in the pack were duds.I hope this isn't a sign of things to come for Clayton picks.",
    "I paid right arround $500 FOR a brand new KSM32...and my KSM44 together from a music store in Memphis...but everything they say is true...the only mic under $1000 that tops this is the AT4047.",
    "This surely is a solid product, the build quality is very good, excapt the loose rotating head which i thought its broken hehe, i loved the leather case and the mic holder, i LOVED how my distorted guitar sounded in the recording, glad i chosed shure sm57!",
    "This was bought as a Christmas gift and the receiver was trilled with it. Has a great sound!",
    "Who would've ever thought it would happen? The legendary British supergroup Cream called it quits in 1968 and apart from a few one-off reunions (such as their induction into the Rock and Roll Hall of Fame), the band hadn't played together since then. However, all things must come to pass eventually for in May 2005, it finally happened. Cream reunited for four sold out concerts at London's Royal Albert Hall (the very same place they performed their farewell concerts 37 years earlier) and the magic was not only rekindled, it was also like the band never went away.The double-CD document of these four momentuous nights features Cream in top notch form with Eric Clapton letting rip with his best guitar work in years, Jack Bruce providing his trademark muscular bass work and commanding vocals and Ginger Baker's powerfused drumming sounding arguably better and more solid than Cream's initial run in the '60s.There is not a single weak performance on the CD and overall definitely shows that even though Cream has been away for 37 years, the chemestry between these three musicians never left. While classics such as \"I Feel Free\", \"Tales Of Brave Ulysees\" and \"Strange Brew\" are absent here, there are plenty of other classics to digest during the nearly two hours of music including \"I'm So Glad\", \"Sweet Wine\" \"Spoonful\", \"Badge\", \"Crossroads\", \"White Room\", an awesome performance of Baker's drum spotlight \"Toad\" and, of course, \"Sunshine of Your Love\" among many others.This is definitely an historic live performance from one of rock music's pioneering bands. Not a single note is out of place and the band sounds as fresh and youthful as when they initially formed nearly 40 years ago. Also, there are absolutely no guest musicians or sidemen onstage with the band during these performances. What you hear is just Eric, Jack and Ginger giving their all and believe me, it is awesome!!!Welcome back Cream!!!",
    "I got this mixer yesterday and i must say it is horrible being so happy for a product to come in only to realize that you can't even use it... why you ask? because it didn't come with a power adapter!!!!! how am i supposed to even try out the product if i cant turn it on. also I dont know what happened to the original butter like fader but this one was not that. I bought this mixer after extensive research and playing with a fellow DJs and I was very impressed but the one that I received was far from perfection. I have decided to not contact the seller about this information but rather instead of going through hassle of sending it back and making sure money is returned I just bought a innofader and am going to hopefully find a replacement adapter.",
    "It does what it says it does - shake and makes a rattling noise. That said, my son quickly grew bored with it and only occasionally bothers to shake it - and that is typically within the context of another toy. These are probably great for younder kids but not so much for my 14-month-old.",
    "My keyboard came with that little flat pedal that moved around and was unnatural even for a beginner. This pedal is an enormous improvement, more or less approximating the feel of a real piano. Since I had just started to relearn pedaling in my third time is the charm beginning piano lessons, this purchase was a great and timely addition to my keyboard.",
    "We ordered this for my son's birthday. Two boxes arrived separately from different shipping companies. There were hundreds of pieces including the nuts and bolts and there were no instructions.",
    "I've had the G2 box for about 2 months now. I loved it and then I started hating it, and now I love it again. First love was all about discovering the vast collection of sounds and amp modulations this box can put out in addition to featuring a good tuner, excellent drum machine, portable headphone amp and an amazing bypass. Then, I started to hate it because much of the effects novelty wore off and all I wanted was to easily find certain sounds quickly without stomping through the endless tonal variations. So, it sat for a couple of weeks. I've rediscovered it recently, and I'm in love with it again and this time I think it's going to last. Why? Well, I decided to read the manual. :-) Do yourself a favor, read the manual. It's not that complicated, but I think you'll benefit greatly by actually reading it. This box is a solid machine and it will blow you away with its many capabilities. Need a noise reducer - got it. EQ - check. Just need a phaser - got it. Compressor - got it. On and on. Use it as you need it. It's a great, well built multi-tool and very friendly to other pedals in your chain. I do wish the input and output were on the sides instead of the top though, but, hey...",
    "We just received our LJ Hutchen clarinet. I can't believe how quick it came and how beautiful it looks. I admit I was very leary about buying an instrument online but for the price I had to give it a try. It sounds great!!! I am very impressed with the quality and the price. Even better my daughter who we bought it for loves it.",
    "This metronome does not have all of the confusing options found in some. It does not give an accented beat, for example. I does have: an earphone port, so you can not bother the people around you; its own stand; an easily-turned dial; clearly-marked speeds and tempo markings (i.e., &#34;Presto&#34;). The sound is my favorite part, and all of my students and their parents agree: it does not sound tinny or electronic. It sounds like wood, like the old-fashioned obelisk-shaped metronomes. I have reordered these several times for my students, and as long as they are available I will continue to order them.",
    "This book is certainly worth getting if you want to play ABBA's songs. However, several of the songs (Fernando, Dancing Queen, Chiquitita, and others) tend to leave out some of the notes that are best known in the song. Chiquitita leaves out both the intro and the instrumental ending; Fernando leaves out the intro, and Dancing Queen leaves out some crucial 'fill' notes in the verses that are included in the \"Easy Piano\" version according to the \"Look Inside\" feature on this web site (Amazon.com).Despite these few things, It's still fun to play the songs! And it does include all the songs from the album of the same name.",
    "I'm using this unit with my AKG Perception 220, and the difference is nothing short of astounding for reducing the bright harshness of the mic and for warming up the tone. It also works incredibly for recording bass guitar direct. My G&L; Tribute JB-2 sounds as beefy and punchy warm as my '72 P-bass (which is currently having major electronic/ buzzing issues and un usable for recording), when run through this awesome preamp. It also works as a great direct box, with the added tube pre making you sound great.This is easily the most well spent $30 for ANY piece of equipment in my entire sound equipment set up. It's a complete no brainer, every musician and recording or sound engineer must have one of these on hand. You will find yourself using it a lot, and will wonder how you ever got along without it before. At this price, you can get a few and be ready for anything!",
    "I've had this metronome for years and loved it because it's simple to use, and has the entire range of speeds that you could want. The batteries last long in it (as long as you make sure it's totally off when you are finished with it. It has both sound or a flashing light if you desire for helping to keep time, which helps if you don't want the audible pulse or if it's still hard to hear that over your playing. I find the pulse to be loud enough to hear over most of my playing.The most clutch factor about this metronome is the 440 Hz A that it plays you so can tune even when you're not near a piano or if you don't have a tuning fork (or perfect pitch as some luckies have). This tuning A plays very loudly.Note that when you order new, it comes with a 9V battery :)",
    "These picks are just like the black Jazz III's, only they feel a bit meatier in your hand. Produces a slightly more bassy tone, and lacks the razor-precision of it's thinner and sharper older brother. Therefore, I would consider these best for heavier rhythm on the lower strings, yet they still do work better than most picks on lead playing. White powder on each pick to absorb sweat, nice idea but feels like touching a chalkboard and it wears off after the first use. Overall great picks with a ton of control and super strong, but I would still prefer the black Jazz III's for their versatility.",
    "My daughter (that I got these for) has liked these reeds, and what she has liked most about them is the ease of play. However, overall, and especially for sound quality, she's preferred the V.12's.",
    "There's a lot to like about this mixer. The case is all-metal, unlike some others in this price range; the pre-amps are excellent and quiet; there are insert points, XLR outputs (on top, which I prefer) and a contour control that really works; it's reasonably easy to use and is small for an amp that has six XLR inputs and fader controls across the board. Also, the power supply is internal, so there's no \"wall wart,\" unlike some competitors. Digital FX work fine for vocals but I could see how they could be a bit cheesy with some instruments. I put this together with a pair of Mackie TH-12 powered speakers for a PA that cost about $700 and will fill small- and medium-size bars easily. You get a lot of bang for the buck with this mixer.",
    "I can make sound already. This trumpet looks and sounds great and it comes in a hard case to keep it protected while I'm carting it to lessons.",
    "I am happy to hear comments about our products from users but I would like to request that you do a bit of homework prior to putting statements in there that are based purely on gut feelings. The father referred to by the previous reviewer happens to be one of the most prolific teacher, composer, vocalist, and multi-instrumentalists of the North Indian music tradition. He was one of the foremost harmonium players in the world (he passed away in 2006). You are welcome to do a search on Youtube and see him singing. He is none other than the legendary Pandit Shiv Dayal Batish. He is the same teacher that was sought by Patty Harrison, wife of George Harrison, to help her learn another very ancient and difficult North Indian Instrument called the Dilruba. He also played the Vichitra Veena, a very rare slide instrument hailing from North India, in the Beatles movie \"Help.\" Pandit Shiv Dayal Batish has written over 20 books on music of India and holds a great deal of respect in the music and learning community.It is difficult to get across to any new student that the learning curve for Indian music is steep and riddled with many years of instruction and practice. It is not a simple matter of picking an instrument and expecting to be a master within a few years. Similarly, any tutor on any subject is simply an introduction to the arts. A beginning tutor can just set the stage to get one comfortable with the inner working of the instrument. The son, just happens to be Pandit Ashwin Batish another legendary educator of Indian music and a virtuoso performer of the sitar and tabla. Like his father, he has numerous video you can watch on YouTube.The greatest lesson one can receive from buying this tutor is to see a rare instance of these teachers and performers giving you their introductory insight on the Harmonium. Yes, there and a few more tutors planned. This is only the beginning. I invite you to visit our web site at raganet dot com where we discuss the history and theory of Indian music amongst other music related issues.Sandra Batish",
    "It's made of strong plastic, doesn't bend or feel flimsy in the hand. Cuts bass strings with ease, winds strings easily. The end that covers the tuning key is very large, and perhaps on smaller, closer spaced, tuning keys may pose a problem. You'll just have to turn one key vertical and then wind the other one, and finish off tuning by hand (of course). I like that it's plastic, contrary to some other reviews, as it doesn't scratch or mar finishes unless someone should get stupid with it, and it's heavy enough plastic that you're not scared to use it. Good product. I'd buy another one without a doubt.",
    "I'm so disappointed! Could these songs be any slower or boring? Clapton has been phoning it in since Cream broke up, and I thought I would finally get to hear him jam again, but no. Just more of \"I Shot The Sheriff\" easy and slow guitar solos, no energy, no imagination. Clapton's reputation is overrated and not deserved. He can't touch guitar players like Alvin Lee or Jimmy Page. Don't waste your money on this highly overhyped and underplayed reunion.",
    "It looks cute as is, and if I gave it away as a keychain I would probably replace the big loop with a stronger keyring.However, I bought it to make a harmonica necklace for a friend. Remove the loops with pliers, and attach a long brass chain.It looks exactly like a Harmonica in miniature, and it plays very well. This is adorable and a fun gift for a music lover.",
    "A professional quality product that lives up to the hype & easily justifies its relatively high cost. Used by electronics repair & pro audio technicians that need an effective, long lasting cleaner & conditioner for any kind of metallic, current-carrying contacts. Particularly effective for low current and/or low voltage applications. Don't use it for cleaning \"pots\" (potentiometers) or faders & be careful not to squirt it on plastics, including plastic parts of switches. If possible, apply directly to the metal parts where they contact each other & \"exercise\" the connection to work it into them.Don't use too much -- you probably won't ever need to use anything besides the lowest spray rate setting on the nozzle.",
    "The USBPhonoPlus is a handy preamp, with digital audio out to USB from any preamp or line level input. It even accepts digital audio input from TOSlink or coax, which is nice if your computer doesn't have a digital audio input.Input level gain is adjustable, as is the monitor headphone level, a nice and not often-seen touch.Performance is excellent. In my configuration, I had a cleaner signal with less noise using the USBPhonoPlus than using the built-in preamp and a Griffin iMic USB.Why can't I give it 5 stars? Because there is one limitation that prevented me from using it in my original intended application. Although the USBPhonoPlus offers digital audio output (TOSlink or coax), these are *passthrough* from a digital audio input - they don't output from the analog inputs. Only the USB will output the analog or digital input.",
    "Easily tuned and sounds so much better than a toy guitar. A two year old can enjoy strumming this little guitar and the surrounding adults can enjoy the sound. No batteries, lots of fun.",
    "This is horrible! The sound sounds like a 1/32 and you should not buy this junk. The pegs keep on slipping and NEVER stays in tune for than 10 minutes. I am returning this to amazon.",
    "I've been using this since elementary school. That was almost 30 years ago. It still exists, so it must be good!",
    "This ingenious little device beats sliding the pick underneath the strings any day of the week. Unlike other pick holders, it's unobtrusive and doesn't utilize any potentially damaging adhesive material. This has gone a long way in reducing my pick loss casualties. Also, it's so affordable that it makes the perfect gift for guitar players.",
    "While it may be a crutch, so are a lot of other things that I enjoy using. Like cars, calculators, and matches. Sure, there is an older, harder way to do it. But why?Honestly, I just felt motivated to balance out the one star reviews from people who have stated that they've never used, handled, or purchased the product. But don't take my five star rating too seriously; I haven't used it either.",
    "The pop filter is of decent quality. The stand is not as flexible as I might have hoped, so it makes it hard to use it with the desktop Blue Snowball microphone that I have, but that's remedied by attaching it to the desk itself.",
    "this is a great pop filter, u would maybe want to use a Blueball Mricrophone though. But all together a great filter.",
    "Tried several other 'names' to improve my sound, some more expensive, and some cheaper. Although this is not the cheapest, it ROCKS !This is some powerfull piece of kit. Took a coupla days to find my way around it, but it is the best deal going for $ value. Easy to read knobs on dark stage. Incredible boost and distortion, light, small, and TOUGH built. One note of caution, the damn thing EATS batterys, so get yourself a mains converter for about $19",
    "I decided I wanted to hang my guitars on my walls instead of having them take up space via floor stands. Just find a stud and drill in the screws they'll hold just fine. I'm really bad when it comes to stuff like this so I had my brother help me. Just make sure you know what you're doing because I thought I did when I really didn't at all.The wall hangers look really nice in person, and they keep the guitars held in place very nicely/safely. The only thing you should have to do extra after purchasing and installing these is creating a makeshift wallpad for behind where the guitar is hung; if something happens that makes it hit the wall, it won't damage the guitar or the wall.This is as legit as it gets if done right, though; I've had my guitars hung via String Swing for months and I've had no problems or concerns. I am very pleased with the cheap alternative to floor stands. It saves room and makes the room look cooler.",
    "These reeds work great for our son's tenor sax for the marching band. They last longer in the damp conditions of the southeast, and he is happy with them.",
    "I ordered this for my tiny closet-cum-voiceover recording booth, and am really pleased with it. It was well packaged and arrived promptly in great condition. The base is just 10\" diameter and takes up less than half the floor space of a standard tripod. That means I can put the stand up against the back wall and gain more sound-insulated space around it, which is just what I needed. My Rode NT1-A mic shock mount screws directly into the top fitting - no problems with the thread. The stand is nice and stable, but not too heavy to carry around when necessary. The only change I would make to the product is to include assembly instructions. Okay, I know it's a simple piece of kit, but not everybody has the confidence to start pulling something apart to find out how it works!",
    "this is the best guitar ever when it was purchased i had no idea it was for me the sound is fantastic and i don't know how to play but i am ready to learn.",
    "Just received this must bag in the mail, and man is it great! It's so huge and roomy, with a moveable divider to keep your mutes from denting each other, and the padding is so thick and soft, just what you need to protect your nice metal trombone mutes. I was able to fit in my Tom Crown cup mute, Jo-Ral straight mute, Stonelined straight mute, Stonelined bucket mute, and a toilet plunger. Heck, if I owned a pixie mute, it would fit in there with room too!It comes with a luggage tag, and a shoulder strap too for ease of carrying. There's also a big front zippered section on the outside of the bag, perfect for holding your various trombone supplies.I'm not sure if I would recommend this bag to bass trombone players, as those mutes are massive. I'm not sure if you could fit more than two bass trombone mutes in it, but I don't own any, so I can't say.I wish that someone else had reviewed this bag before me, because if they had, I would have ordered it a few years ago when I started needing mutes on a regular basis. Protect really should have given some dimensions or a better description of the bag at the very least. It's a great bag, and I don't see why any trombone player needing to carry mutes would be without it!",
    "The best way to tune your guitar is with one of these, and this one is a great product. Very versatile but simple to use and reasonably priced.",
    "Dunlop's 475 Big Stubby 3.0MM (the purple pick) is astounding. It has an indentation so the pick doesn't go out of position. The pick is light AND hard for perfect string control. When you strum a string, whether it be on a bass or a regular guitar, the string moves, not the pick and the string. The pick is tapered at the tip..again, very helpful in note control. What else..oh, I read in a Musiciansfriend review that this pick will break guitar strings. I imagine it will..if you are a gorilla. Then again, if you are a gorilla, your banana will break guitar strings. My gramma has gone to God. But if she was still here on earth, I would send her Big Stubby 3.0's for Christmas. (And she doesn't even play!)",
    "My daughter's private teacher recommended this flute for her and she loves it. Her teacher said it was a great deal and that it would be perfect for her. The price is great and we are very happy with this instument.",
    "I was disappointed with this rosin. It creates the grip, but produces a very noisy sound with my violin. Not worth purchasing. After trying this for the first time, I immediately went back to using Hill Light Rosin. Paying a few bucks extra for the Hill or other similar professional rosin is worth it.",
    "These Midi cords have worked great for me. Have been using them now for about a month. At only 10 feet, they are good for a studio, or semi-permanent work station, but would not be ideal for a live set-up. If you're looking for a cheap, quick way to hook-up your gear, these cables seem to work pretty well.",
    "I love it because it's UHF and has crazy range. I don't because when I had it on for a while it started to go in and out.",
    "This strap is terrible. I've bought 4 straps so far, this was the most expensive yet. It's the worst thing I've ever used. Feels so cheap, not real leather, feels synthetic and very cheap. I hate it. If you like tweed, go for official Fender tweed straps.",
    "I don't play drums that much when I first received the pedal I wasn't to happy with it. It felt like my stock Pearl pedal. I have felt cheaper pedals feel and respond better then this one. But I have see other better drummers on my set just kill with this pedal.",
    "I was also one of the unlucky ones get one with a broken knob. The reason for this was evident right away. Right when I opened the box I found it strange there was no packing material. It was just thrown in an empty box. Then when I saw the broken knob I was not surprised. Maybe the plastic for the knob is cheap. But, trying to save money by not using packing material is no excuse.P.s. I fixed it with some super glue.",
    "I read a lot of reviews before I took a chance on this case, and the majority were good ones. I have to say, I don't think you could get any better for the price. My full size Brownsville acoustic bass fits perfectly. It has a decent amount of padding, carrying strap, large storage pocket, and nice zippers. It seems to be well made. This is the first soft case I have ever purchased, so I don't have others to compare it with, however I feel good about the 30 bucks that I spent for it. At the time I purchased this case, I received free shipping through Amazon. Just my two cents, but I think it's a great buy.",
    "This was a present for my son, and I know nothing about it, but hewas extremely pleased.",
    "I read all the reviews before I bought and decided to try my luck. Even with short distance 3 feet, I got tons of noise. Not useful to record to a camcorder ,",
    "I've been a bass player for almost 20 years, and for the last 6, I've been using the DR coated bass strings. The bass strings sound great and last a long time. However, I switched to mostly playing guitar about two years ago, and in that time, have generally used GHS strings as they were well regarded by Atomic Guitars, a local repair shop.Now that I'm more comfortable on guitar, I thought I'd give a few different brands a shot to see if there was anything I liked better than GHS. Of the ones that I tried, these DR strings were simply the worst. After carefully restringing (and paying attention to their warning of how to crimp the string if/when cutting), I broke the \"A\" string within four hours of playing time over a couple of days. I restrung it with a single \"A\" from another set, and another couple of hours after that, the \"D\" string broke. Both strings broke close to the ball end, near the bridge, and this is on a guitar that hasn't shown any issues with other brands of strings. With that, I said \"enough is enough\" and re-strung with a different brand.During the short amount of time that the strings were in use, I didn't notice anything remarkable about them that would make me put up with the poor longevity. Apparently I'm not the only one that's noticed the propensity for these strings to break; I wonder why DR doesn't address that?",
    "I orderd 2 wall hangers to display my grandfather's violins. I was sent 2 hangers, each of different wood colors. One was a light oak; the other a dark walnut. Because this is a display with his picture, the violins are to be side by side. I contacted Gear 1 Music by email to see if I could get a second dark walnut hanger and have never heard a reply. The hanger does what it is supposed to do but no response does not leave a good customer service feeling.",
    "I have two recorders this 1, and a made in Germany key D, the one I gotFrom here is good tone ,looks nice plays good to. Comes with a well madeCase I like it very much, Plays loud though. I would recommend it.",
    "As I said great quality very sturdy construction, folds up to a small size that I can fit in my suv and very lightweight",
    "If you can believe it, I bought this pedal to replace my Ibanez TS808 which I think was just too darn delicate. I think I used it for about 4 months and the foot pedal got stuck in the on position.....not good. I took the TS808 to a repair shop which they fixed (for a pretty penny - I guess getting parts from Ibanez is a real pain in the arse)...but now it's even more delicate and noisier than ever. So I pulled out of my rig and installed this Maxon 808. It's almost the exact same pedal. It's a lot more durable and easier to dial in. It's a tiny bit brighter than the Tube Screamer but with a slight adjustment on my guitar.....easily corrected. Its a warm but good solid dirt tone that does not sound blown out at all. I normally use it with a dual humbucker Tele and those buckers are noisy...but it was the perfect partner for that guitars tone. Now I just use my Fulltone OCD with my Les Paul and now both guitars sound superb in the \"Black Crowes\" style that we play. You could use this pedal for anything..it's really warm and friendly.",
    "Conga light is a great conga when you just can't have a full size one due to space/mobility limitations. It is a great sounding percussion instument that does not sacrifice anything and delivers on quality, workmanship and value.",
    "The bag is exactly that... a bag to assist with the carrying of your lighting. We use it to carry one of our American DJ lights and it does the job. The bag has a pocket in the front to carry the cords for the lighting which makes it convenient. Definitely a good buy for the money.",
    "This fluid did not work in my Rosco 1700 fog machine. Rosco uses proprietary temperatures and pressures and perhaps this fluid simply dosent work in those conditions. Based on some other reviews it seems to work on cheaper machines, and even then the ratio had to be modified. Eventually I put the entire bottle into a single quart of Rosco fluid with no noticeable change in scent.I am not claiming that this fluid dosent work, but it didn't work in my Rosco machine. I know from experience that Rosco machines are very picky with what fluids they like so your results may be better with a different machine.",
    "A truly convenient tuner for when everyone is loud and you need to tune an acoustic. But the low E string never gets it right. It shows up as a B on the both of the two of these I own on all my 7 guitars. It shows up as \"E\" if I use the 12 fret harmonic. Otherwise great.",
    "First of all, it's a great product. My dad is very pleased with his new melodica. I'm not very good with notes and music theory, but every key sounds as it's supposed to and don't require much air to play.",
    "Got this amp along with 2 audiosource Amp-100's from Amazon and a Gemini PA7000 Professional Line Preamp and Input Switcher. This Behringer out the box looks like its ready4war! Heavy, tank like build. Nice front and powerful. Running threw my PA700 with this at 1/2 gain on both channels (8ohm to klipsch Icon 62's with 10gauge speaker wire) this amp produces probably 3-4x the SPL (sound pressure level) as the amp-100 ran in bridged mode (which is suppose to be 150w rms...yeah right).The comp. was 2 amp'100's (90 bucks each) in bridged mono versus one of these.The amp-100's have no low hiss but I think I read the fix is the break the ground off the power cord for this amp, but dont quote me on that.My onkyo 809 receiver puts out 135 FTC rms at 8ohm and this amp prob. puts out double that at 8ohm to my speakers or whatever amount it needs to double my sound level. Also the sound is full and now I have that \"movie\" headroom I was looking for. Not just \"loud\". This amp and the Gemini PA7000 are a great combo.Sending the Audiosource amps back tomorrow. Probably gonna get another one of these and keep in the garage as a backup.***Edit.....28 aug 2012, just got my 2nd one of these in the mail after hearing a video I made of music playing on Pandora thru my system when this was driving my two front klipsch 63's and remembered it sounded way better than the seismic audio amp that has more power driving them now. So I had the current A500 driving my center and put the 2nd one on my fronts. Listen to Net radio in pure audio mode on my Onkyo 809 and these amps have a noticeable higher damping factor than other amps they sound more robust and the bass is \"thick.\" The only thing I remember is when passages in movies get really loud this amp isn't as loud as the seismic audio amp, but this one sounds better, so I think the seismic audio amp is more stable on a lower load.",
    "This guitar bag is great!! It's durable & keeps your guitar well protected. The storage pockets & over-the shoulder/hand carry straps are a real plus.",
    "I just bought this guitar after reading all the reviews and needed a guitar to leave at home while I travel with my other one. I just started playing in the last couple of months and wanted something decent so I could get all the practice I could. the guitar came in immediately and I started the inspection on the body after opening it. I was a little disappointed because it looks like they didn't finish dying the bridge and there was a splash of (Red?) from the wood that was used. I strummed on the strings to find that they were tinny which was no surprise from the reviews posted here. Well I finally got around to playing a couple of chords and all of my doubts and problems with it melted away. The only thing that I can say is that the guitar has a great feel along the neck and is super smooth to play. I ended up playing the guitar for an hour before I remembered the mess I had left from the packaging. I never expected a good guitar like this for 100 bucks but am glad that I took a chance. I'm sure that I will buy a better guitar when I get better but will definitely keep this one forever. A very good buy in my opinion.",
    "I used to have a guitar strap specifically for acoustic guitars without a second nut (ties came right off the strap itself), but I lost that. I have been looking for something to replace that strap, and I didn't feel too comfortable with trusting shoelaces (and my knot tying skills) to hold my guitar up. This product is easy to use, secure, and I can take it on and off quickly. I definitely recommend this item!",
    "I've had this Hisonic model for over two years, use it three times a week and sometimes more--fabulous speaker, love the lavalier mic (although it would be nice to have alternate directions to clip it on). It saved my vocal chords! Use for broadcasting my voice while teaching dance classes and I also use it in conjunction with two wireless mics & mixer (purchased separately) and the lavalier in our singing group performances to make it easier for senior audiences to hear. Easy to recharge. Love it! Love it! Wish I had purchased the one with the wireless hand mic and lavalier instead of this one--never use the headset.",
    "This is a very nix tambourine kinda slippery do to the skin it's not that easy to tear the skin but other than that it sounds great :)",
    "Speaker is durable. Suited for indoor or outdoor use. Gives good sound for a paging horn. Fast shipping!!",
    "I use elixier strings for my guitar n I should have not tried this string on my guitar if I knew the quality of d'addario. It feels dull n not silky. And most of all I could not play fast fret with this strings. Therefore I do not recommend this to elixier users!",
    "Recommended, but allow yourself a few months to learn this one. However, within a year this software can be a great timesaver for the professional musician.A lot of features but very difficult and complex to learn if you want to score and listen back before printing and heading to the recording studio or rehearsal.Complications are due to inaccessible instructions. Simple procedures are disguised in the manual index behind many uncommon terms used in place of standard music-notation and orchestration vocabulary. Plan to spend quite some time searching for answers anytime the software doesn't cooperate with you. The manufacturer appears to be overwhelmed with questions for help from consumers; submitting a question to their customer service usually results in their sending a list of clip/pasted references from the difficult manual. Be very patient and persistent and a customer service agent will usually get back to you in due time.A competitor could knock their socks off by coming out with a simpler version.",
    "I own a mobile DJ company and have 4 ultimate TS-90 stands and i'm really not happy with them. This product is simple does the job and is well priced. They are a little heavy at 9 lbs per stand but i like the look and operation of them. I've been happy with them so far.",
    "The capo is sturdy and of quality construction. You need to press fairly hard to adjust or move it, but it fits snugly on the guitar neck and strings. What more could you want?",
    "I bought my Fusion about 4 months ago when I learned that Alesis was likely discontinuing the series. So why am I writing a review on a probably-discontinued product? Because I want to lament the premature demise of a keyboard that was definitely before it's time. And it was unfortunately a product released before investing adequate time QC'ing the thing, as the Fusion operating system was still quite buggy when it was first put on the market in early 2005. The sad part is they FINALLY fixed most of the bugs and the keyboard had the support and backing from Alesis it should have had from the start about 2+ years after it was released. By that time, unfortunately, the word-of-mouth reputation for the Fusion was already mostly bad, and trying to recover from that \"bad press\" appears to be a struggle Alesis is about to give up on.I'm a fairly adept synth guy though far short of \"expert\". I have some experience working with and programming sample-based synths, analog synths, and even PD (phase distortion) and FM (freq modulation) synths. I have a few Alesis products, a couple Moogs, and even an old Casio VZ-10 and Yamaha's FS1R and DX200. I love tinkering and plinking when time allows (that pesky full time job gets in the way) and have a decent ear for mostly getting the sounds I want. Despite using a few soft synths, I admit I prefer hardware synths.Though I ended up with a Fusion 6HD this review applies to the OS and electronics of both the 8HD and the 6HD as they're identical. I went through 2 Fusion 8HDs that both had problems with their keyboards. The black keys struck with a higher velocity than the white keys, and any highly velocity-sensitive programs (like pianos) sounded out-of-whack because the black keys were noticeably louder than the white keys. Checking out Fusion forums, I learned this isn't/wasn't an uncommon problem unfortunately.SO...with a little bit of history and background, what do I really think of the Fusion?Well, mostly I'll comment on the synthy-ness of this keyboard, which is its real strength (it's also a sequencing workstation with multitrack recording capability). The ratio of programmability versus price on this thing is/was incredible. What I paid (&lt;$800) offers more power and programmability that my Roland Fantom X6 and literally at less than half the price. It has 4 synth engines including analog modeling (for those classic squeaky, squelchy synths sounds), sample-based playback (for more realistic instrument emulation), frequency modulation (for those DX7 klangs, rings and other metallic weirdness), and even physical modeling (mathematical emulations of wind instruments). The options for routing and modulating the sounds are incredible and the interface for programming is fairly decent (on a 1-10, I'd give it a 6 or 7). The modulation table lets you route almost anything to modulate/affect an expansive list of sound parameters, as well as letting you program modulations for the modulations. The different filters offer some impressive frequency sculpting to any of the different synth engines (FM as well), and the effects are more than adequate to help polish up the sounds.And how does it sound? Well, that's a bit subjective (ok, QUITE subjective)...the analog still sounds virtual to my ears, but smoothly so. It's a fine complement to real analog and a suitable substitute in most instances. The sample playback is fine and obviously largely dependent on the samples used. The included samples are decent, though nothing spectacular, but fortunately Alesis offers software for easily importing popular sample formats. The FM is VERY nice. I'm a fan of the less obvious uses of FM (not the painfully overused \"DX7 Rhodes\" piano from the 80's) and this thing is 10 times easier to program for FM than any of the old Yamaha DX keyboards. Lastly, Physical Modeling on synths hasn't really been explored much since Yamaha tinkered around with it a bit (the VL1, I think), so it's nice to see it added as an option. To my ear, the sampled flutes and oboes still sound better than the physically modeled ones, but if you get creative with the PM, you can create some truly weird and wicked sounds.If you're new to synths, the technical details won't necessarily make sense, but my main point for writing this is if you're in the market for a VERY powerful synth for way little money, this is definitely one to consider. As of this writing, a few music stores are still offering the 8HD model, and the 6HD can easily be found used for half a grand.Kudos to Alesis for the vision to create such a synth, but bad on them for the buggy realization of that vision. They finally mostly fixed the problems, but for the Fusion product line it might have been a little too late.So, to round it all up...if you're into crafting, tweaking, brewing your own sounds and don't mind diving into a keyboard a bit, this is an AWESOME gadget to let you do so. If you're mostly looking for a nice pallet of pre-manufactured sound colors, this will deliver somewhat (especially with the free download-able banks offered by Alesis) but there are other keyboards (Fantom or Motif) that offer more in that department, albeit for more money.",
    "Does exactly what it is supposed to. Easy to mount and holds guitar as advertised. If I had another guitar, I'd buy another one...",
    "This was used for general lectures on campus, the speakers have always given it high marks. Fits snug and comfortably.",
    "My grandson is really enjoying the comfort of playing his sax using the Neo Tech sax strap.",
    "I just received mine following a Gold Box deal (kudos, Amamzon, you got me to buy something I wasn't looking for). I really like the sound. Better than a low priced harmonica, and I've never been able to figure out how to play the harmonica at that. Keys work well. Nice that it came with a decent case for the money. I spent a couple hours with it, breaking out the Hanon and scale books, and I think that within a week or two I should be used to it enough to sight-read on it from fake books. Best of all, it's fun.Dislikes:The four lowest notes are well out of tune. I found instructions for tuning the reeds on the net but it looks difficult to do.You have to blow pretty hard to get the highest notes to sound. Maybe all of these instruments are like that?Also, the shaped mouthpiece on the end of the extension tube is really nice to use, but the short one is not (see picture). Why couldn't that one be the same? Is there some setup element I'm missing?Were this an expensive instrument, I'd only give it 2 or 3 stars, especially for the intonation issue. But as priced, on par with toys, it earns 4. If I'm still playing this after the novelty wears off, I may trade up to a better one, but I'm very happy with this purchase.",
    "These are very comfortable and easy to put on. I am new at the violin so it was very helpful to be easy to use.",
    "The guitar arrived flawless. Great guitar for the money.would recommend for the begginer. With a proffesional sound. Will sound as good as an expensive.one.this was a gift for one of my children and.she loves it.thank you.",
    "This is a really good product. Got it for my brother who is a self taught guitarist and who's into just bout anything from jazz to metal and he loves it !",
    "This brush is a piece of junk. It doesn't do too well of a job removing dust at all, it more or less just spreads it around. The fibers shed quite easily as well. I had it shedding fibers from the the far left and right sides before i even put it on a record. Not only does this 25 dollar hunk of Chinese made junk not do what it's intended to, but it scratches records! Yes, I said it scratches records! I used the brush foolishly confiding in it to do its job. When I was done, I noticed my record had more scratches than before! I have to add, no pressure was added. I simply let it glide on the record, going with the grooves. Now my original Metallica Whiplash EP has more scratches than it did before. Thinking I was paranoid, I tried the brush on an old crackly Buddy Holly LP I'll never play again, and just as I suspected, the superficial scratches started to accumalate. This was pretty easy to tell with a light held up to the LP. Please, don't make the same mistake I did. I get MUCH better results wrapping a section of a cotton t shirt around my finger, turning the turntable on and let each pass against each song, dragging my finger down after a few revolutions. The dust and nastiness accumalates at the edge of the LP, and I simply slide it off. It works for me, unlike this brush. Please don't make the same mistake I did. Stay away from this brush.",
    "Well-made, easily adjustable, and thickly padded. This bench meets my needs perfectly, easily accommodating my ample frame. Assembly was a snap.",
    "I'm far from an expert on cammies and mics, but this is definately a great buy. I film concerts w/ a cammie that has an external mic output. This microphone has given me excellent results. Very, very clear sound. Have never gotten any hissing or cackling. Does a very good job at filtering out excess noise (i.e. people around you), and picks up the sounds of a concert well. You can also adjust how the mic picks up the audio. You can choose 90 degrees, which is basically straight ahead, or 180 degrees, which will pick up sounds from the side as well as straight ahead. A very good microphone, I highly recommend this item.",
    "so the mics very good...probably the best part...it works better wired direct.The wireless options nice although i rarely use this feature. I have been in situations where I needed a wireless microphone, but for the most part, I stay within a few feet of the receiver so it's not a necessity.In my situation the pdwm100 passed with flying color!",
    "I was looking for a fairly inexpensive guitar that I could mail my husband who is deployed in Afghanistan. This was a great choice! I ordered it and had it mailed directly to him! Didn't have to play any extra shipping because it was available in prime shipping! He's happy with the guitar! No complaints here!",
    "I have had this product for months now, and I cannot install it on my computer. Roxio \"support\" has been no help. There is an upgrade available at their website, but it hasn't done anything to help me install this product. I'd love to hear from other's who have had this problem!!!",
    "I use these on my Gretsch set, 14x6, 12x9, and 16x16. I love this since I play by myself most of the time and these really take a lot of that excess echo out. Very noticeable difference on the toms.",
    "Great strings for the price. The nylon strings have a much sweeter voice than I expected. They stay in tune pretty nice. I am totally happy and recommend this for practice!",
    "I purchased this guitar for my daughter's birthday. For the price, this guitar sounds and looks great.It was bigger than I thought, but I think it's a regular size. (sorry, I don't know much about guitar.)It came nicely packed, but I wished that there were an instruction paper or sort. There's a piece came with it and I have no idea what it is!Overall, I think this is a great buy. Now I need to look for the case for it!",
    "I bought this used on this site, and the pedal arrived a tad dusty but in overall good condition.I chose this one on the advice of an experienced drummer (which i am not, i'm more into guitars), who owned one for years and was happy with it too. It may not be the fastest model around, and i'll probably change it for that reason (my foot is too slow, hehe) or maybe get a double pedal one day, but for a beginner like me this is perfectly ok.For the price it's probably the best model around. My friend advised me to choose Pearl or Yamaha, which is exactly what i had in mind anyway, and to stear clear of lesser known brands and sometimes even some famous ones.Thumbs up!",
    "I bought these strings for use on my son's Yamaha electric guitar. He tends to break the high E string a lot, and rather than buy full sets and end up with numerous extras of the other five guitar strings, I find it more efficient to buy the high E strings in bulk.D'Addario is a high quality string and these are a great value. If you are a guitar novice and are looking for a particular string in bulk, just keep in mind you are probably not going to find \"bulk E strings\", \"bulk G strings\", etc. Rather you will find them sold by gauge. For example, for the high E string you would buy 09 or 010 gauge strings, and so on.I did not rate these strings a 5 for one reason. I have found they do tend to break more frequently that Ernie Ball strings, thus I would consider that brand a somewhat better purchase.",
    "The quality of sound is clean, and bass/mid/treble are spot on. These headphones feel very light on my head, and easily/automatically adjust to my head size. The actual earphone parts fit perfectly and fully around my ear. The whole design makes these headphones flexible, so if you like to DJ and/or produce music using one ear like I do, it easily lets you do this. The cable is on the longer side (longer than I expected) and depending on who you are, you might or might not like that. This cable is also detachable, which is great for portability and if you happen to run it over with a chair or something (the usual death of many headphone cables), it can be replaced. The design is not flashy, yet sleek at the same time(in my opinion of course). In short, if you want portable, flexible, and great sounding DJ/Production headphones, it's worth every penny.",
    "Great cymbal. The down side, this cymbal doesn't fit in with the style of music I play. Examples,christian, contemperary christian, and gospels played in a major key. The up side, sounds great played with songs that are in a minor key.",
    "I have used this microphone all summer as a traveling speaker/instructor and I love it. The Shure mike that came with my setup was OK, but I was having problems with uneven pickup when I moved my head to the side (drop outs) or looked down at my notes (too loud and distorted). This one is such an improvement!! I've found that if I place it centered on my shirt (OK--I'm a woman and I don't wear a tie!!) it is just about perfect. So long as I don't turn my head much more than about 45 degrees, there is no drop out. And looking down at my notes does not cause distortion. I've also discovered that if I move it slightly to the side and closer to my neck (like on the lapel of a jacket), it is actually softer than when it is front and center. That was I can fine-control my volume without adjusting the gain. Note that I do use the foam cover at all times as was recommended by the manufacturer. All in all, it was worth the investment.",
    "I ordered this as a Christmas gift for my husband. First of all when it arrived the box it was in was a wreck..this could have happened during shipping...anyway, I thought a power source came with it...wrong...one of the tightening screws(thumb screw) was missing as was a tube sleeve. I am very disappointed with this. I have always had a good experience with Amazon but not the case with this order...also I have tried to contact the seller to no avail! Not a happy customer at this point.",
    "These were purchased for my sons guitar. He loves them. I plan on buying him another set of them for Christmas.",
    "Nice mics -- nothing all that special, but sound good at a decent price. I like the interchangable capsules to switch from cardoid to omni -- very handy.",
    "The sound is good and it works very well and it is very easy to use. You can hear it a long ways away but it doesn't blast you when you are sitting close to it. I would recommend it.",
    "I've been playing drums for over 10 years, but recently I felt like branching out to bass, and then mandolin. I'm not a \"serious\" musician in a band or anything, but I love trying to learn any instrument I can get. Anyway, I got this pedal just as a way to make practicing more fun, and it turned out to be exactly what I wanted...and much more. For a couple weeks, I explored all the preset effects, which are pretty good overall, then I eventually started to create my own sounds, which is the main reason I love this thing. I'm using it for both bass and mandolin; with 40 customizable effects, there's plenty of room for both (obviously these are two very different-sounding instruments, so they should have different effects as I see it). The editing process was pretty easy once I got used to it, and now it's quite intuitive, not to mention addictive. Sometimes I'll spend and hour or two just making small adjustments to a new effect, playing along with the...decent enough built-in drum machine, and so on.Like I said, I am not the most serious musician, I just really enjoy playing around with instruments and occasionally experimenting with sound editing. For someone who is an expert bassist, this may not be the best pedal (or maybe it is, who knows?) but for someone like me, this is perfect, and has really enhanced my experience of trying something new. I couldn't ask for a better multi effects pedal.",
    "I think this product is a little overpriced. It cannot cost more than 20 dollars I think. Otherwise, it's perfect.",
    "Scanners provide an effect that no other device can give you and even though this is one of the cheapest you can find with little features, you get what you pay for. Considering the price, this scanner is very bright with brilliant colors. It's also very well built. The gobos and colors are on the same wheel and it only has a few channels (4 I think). Also if you choose to use the built in mic for sound active mode you will be pleasantly surprised. The mic picks up very well.",
    "I don't know much about violins, but for what I paid for it, it will do the job. My son was wanting one for his birthday and it's cheep enough if he doesn't like plalying it I didn't spend a lot of money.",
    "I'm very happy with this harp case. It's thicker than you might imagine, judging from the picture. Each harmonica is held by its own strap, which fit perfectly. The zipper feels like a very good quality. I expect to be using this for years.",
    "This is an absolutely beautiful instrument that plays extremely well. The design, details, and strong make demonstrate it's excellent quality. I am extremely pleased with this purchase and so was the recipient who received it as the gift he never expected.",
    "I moved into a new house and build a new very wide desk from Ikea (78\" Vika Amon with three Vika Curry legs and a Vika Alex Container/leg). I currently have an HK 3390 with two Pioneer BS-41 speakers. The system sounded extremely unfocused. Bass was going everywhere, it just sounded like a massive downgrade and I knew it was just the room. My table top was vibrating too much and so forth.I knew I needed some isolation pads and did some research, found these MOPAD's even though they were pricey, I said what the hell. I was amazed when I put them under my speakers, they also gave a much needed lift to them as well and it just sounds amazing. I can't imagine how much better the speakers would sound if I used them in my old room (An acoustical heaven).Don't listen to those who say they can just buy foam from a hardware store. If you know your room needs some sound treatment, try these pads first.",
    "When i set up the speakers -- I immediately noticed continuous hissing noise from the right speaker. I swapped the cable -- changed where to take powers -- hissing noises never go away.I checked the knowledge base of m-audio but there were no similar report, and their customer support is non-responsive. I am returning it to amazon today. It has decent sound quality, but with defective right speaker, it is not really fun to listen to.",
    "I bought this as a beginner guitar, just something to learn on and play around with. I already have a Fender bass so I thought I'd try and finger out the electric guitar. The sound quality isn't that bad, and it stayed in tune pretty well. The amp is pretty small, maybe 15 inches in height and width and maybe 6 inches thick, but it was really nice for toting around and traveling with. The amp has a distortion button on it which was fun, but not really great quality. It comes with an extra string, pick, strap, and carrying case. The carrying case is not usable at all, I had to throw it away, it was like using a plastic bag to carry aroung my guitar and it was really dirty and dusty...but that is really not a big deal, most packages come with a less-than-great carrying case, so I suggest that you keep that in mind when you purchase this guitar, you'll have to separately buy a reliable case if you want to carry it around. The strap isn't the greatest either, but it's to be expected from this type of purchase. It is usable, I have used it many times, but if you want a super comfortable strap - plan on buying that separately as well. I've also dropped this guitar a few times and it stayed in tune!The bottom line is that this is actually a pretty great deal for a beginner. It comes with an amp which is a *huge* bonus, and the amp works very well. It's PINK which is also a plus. :) It sounds pretty good, is sturdy, and is overall an awesome guitar package for the price.",
    "This is a great metronome. It has a loud click that can easily be heard while you are playing. It is sturdy as well. Well worth the money!",
    "I don't like to post a review unless I have new information to add. So... the only thing I would add to the other reviews on this item is that what I said in the title: Heavier microphones may bounce a bit when using these mounts. The plastic is sturdy to stay in place, but a bit flexible. It has to be to allow you to bend the clip over the rim of the drum. I use different mics for different drums and noticed that a Shure SM57 stays in place pretty good, but other mics I've used (including the Sennheiser MD 421 and others) tend to cause the end to flex under the weight of the mic--especially when miking the resonant side (bottom head) of the snare. So if you use heavier microphones than SM57s, be aware that they could bounce a bit during recording/performance.",
    "I love this capo better than any I have seen or used. Great quality and price. You wont go wrong with this capo.",
    "I've been a professional musician for 40 some years. I have a Martin 12-string guitar, and I've always used Martin bronze light strings on it, and been very happy with the sound, and ease of playing of those strings. I bought a new mandolin a few months ago. Although it is not a Martin mandolin, I replaced the medium gauge strings that came with it, with these Martin light strings, and improvement in tone, and the playability of the mandolin is very noticeable. I highly recommend them.",
    "I received this product new with the mini Mic not soldered onto the 1/4\" jack. The customer support from Fishman was so difficult to deal with regarding this problem I had to pay a Fishman 3rd party repair person to fix the problem.That said, the contact mic is decent but the mini Mic is practically useless and picks up almost no sound. A good contact mic and good preamp work just as well. I've used this pickup for classical, jazz, and rock styles- the contact mic helps when playing with drums or other loud instruments, but a functioning mini Mic would have made this product good for solo work as well.",
    "I have nothing bad to say about these speakers. They push the sound and are absolutely great for mixing. Though these are some of the lowest priced studio monitors you can buy, they are definitely making it worth the penny. They have a very good flat frequency and even plugged through an unbalanced signal I'm getting great sound. If you don't do your mixing through monitors, get some and if you can't afford expensive ones, these are just as good. They are very heavy and durable and every bit as good as the expensive ones. KRK is a very good brand and comes highly recommended by everyone at guitar center.",
    "DJ Ringtones do not work on i-phones. This is not made clear or obvious before purchase. On the contrary, the ad leads you to believe it will work on any common phone. As I have no other cell phone, this was a total waste of money!!!Other than that it was very easy to use and create ringtones. Too bad I have no use for the software.",
    "Costs about 2x as much as some cheap capos, and it's worth every single penny. THis has a strong clip, yet does not damage my concert or tenor ukulele necks. It won;t budge once you clip it, and it's low profile. Made of metal, it should last a lifetime.I took off one star only for one thing: the hand clip portion of this does sometimes get in the way of fretting because it sticks out from the neck quite a ways. Some other capos, like this oneJim Dunlop 7828 Russell Banjo/Uke Capodoes not have anything that you can hit your hand on when fretting. Sometimes I try the Kyser on the opposite side, away from me, the player. But, it seems to still hit my hand on some chords, just different ones. That said, I can work around it, and it's a lifelong capo of fantastic build and keeps those strings from buzzing at all on all my ukes. If one was to have large hands, as I do not, this interference may be even more of an issue to consider.C ya. Happy strumming. Mahalo.",
    "Simple, low price, and high quality strings. On my Cordoba C5 they sound great. Can't think of any issues.",
    "Actually, this item is the first audio interface that I've ever used with Garageband. However, it works pretty well with simple connectivity and easy setting. Honestly, except some limitations of sound making from direct line-in instead of miking, it makes really good guitar sound for me. I love it!!",
    "I own this app and it's awesome! I literally filled an MP3 player in one afternoon with new MP3s using Audio Xtract on my PC. I recorded 6 streams at 128kbs and it was amazing! Then I moved it all to my player, no problem there either.The exciting part is that I just got an email from their support that a new pro version is coming for the holidays that records literally anything, including iTunes and all the internet radio streams out there. They said updates are free, so no need to wait I guess to get free music.",
    "alright, so im new to drumming, and i thought to myself that i needed something to practice with that wont wake up my parents.so i bought this baby, the feeling is pretty similar to a snare drum, minus the fact that its rubber, it feels nice and sturdy, the rubber smell went away after a few days of usage. i also did not want something TOO big so because i planned on taking this around with me when i had to wait. and just whip it out and play, but its just perfect size, its not to big and definitely not too small. of course this review is coming from a total beginner, i have no experience with other brands or kinds, so i cant really tell you anymore than my first experience, but im highly satisfied.",
    "I wish this place wasn't so far because I'd love to see what their store has to offer. LOVE LOVE LOVEEEE this capo. And it's pink.. :) It is a very strong and sturdy piece for any guitar. I use it on my acoustic and my electric. Thanks Russo and staff! &lt;--- Fast Shipping",
    "When picking a violin chin rest, it is very important to know what you like and what you're comfortable with. Ifpossible, the best thing to do is to go to a store and actually try different styles yourself until you find one you like.That being said:This chin rest is great. It's a simple mechanism so I see no need to spend lots of money on a fancy/more expensive one. This rest looks very nice in Rosewood, nice smooth finish, sold mechanism, everything's good.The most important part: How does it feel?Always be aware of the shape of a chin rest, where it sits on the body of the violin, and how YOU hold the violin most comfortably. I prefer to have my chin nearly centered on the violin's body, right over the tail-piece. That's why I chose this chin rest. It mounts the violin right over the tail-piece and the end-pin, and it has a fairly large cradle/surface for your chin. In my case, it worked out perfectly. It's very comfortable and works great with my way of holding the instrument.My only complaint, and it's a small one, is that this particular chin-rest is somewhat tall. The distance from the bottom clamp to the top of the chin-rest, once attached to the violin, is a little higher than I'm used to. It just means that my chin is raised a hair more than it was with my old rest. But I was otherwise completely in love with it, so I kept it. It took me all of 1 day to get comfortable with it and now I absolutely love it.My point here is that there are dozens of different styles of chin-rests, and everybody has a unique way of playing and holding the violin. So if you're looking for a new chin-rest, make sure that you know what you need to play comfortably. Look at different styles and pay attention to where they mount on the violin, and consider how you like to hold your instrument.",
    "The EQ simply does what it's suppose to do. It's cheap, useful, easy to work with.FBQ portion was not very useful. The red lights won't come on no matter how loud the feedback is.But for $100, it's a great EQ.",
    "I love these small picks. I was told several years ago that if I used these types of picks that I would become a better guitar player and at that time I was very skeptical. After playing guitar for the last 31 years I can say without hesitation that I am a better guitar player and these picks are part of that process. I noticed that the larger picks got in my way at times and I started out using the very thin picks as well as large picks. I decided to try the smaller tear drop picks and I found I liked them. You have to play a lot more precise using these small picks. I also noticed that I was breaking the thin picks almost every time I used them, so I started to experiment with the thicker tear drops and found that I liked the sounds they produced. The nuances were much more pronounced and I could get several sounds by the pressure I would put on the strings with the tear drops. The thicker the pick, and the smaller the pick, the better the sound and the cleaner the picking had to be in order to create that sound that you only get when you hit that string with a small medium to hard tear-drop guitar pick. You will love the country sounds, and nothing creates that heavy metal squeal like a good solid tear drop pick. I ware the tips of the pick down until it becomes rounded. When they are no longer pointed I still will use them for certain songs that require a certain sound that only the small picks are able to make. I never would have believed that a small thing like a guitar pick would make such an impact on the way I played over the last 31 years. I buy them by the dozen but may splurge and buy a couple of hundred to have on hand.P.S. You can pick your friends and you can pick your nose but never ever pick your friends nose.Clayton Acetal Standard Guitar Picks, .80MM 1 Dozen",
    "i bought these for our church to use on wood blocks we had so the kids had something to play during praise and worship and the kids love it they had a blast being a part of the service",
    "Excellent, super solid turntable. If you don't feel like dropping 700-1000 dollars for a Technics SL-1200, this will do nicely. Everything you need to DJ.",
    "Im Pleased the product was just as it was described on this site. It arrived just in time for our Gig. Thanks, great for the great service",
    "I play on an old bach strad (serial number dates it back to the 60s) and I've used the original case since I bought the horn. I've had this trumpet for several years and now that I'm in college I decided it was time to get a new case. Another trumpet player in our wind ensemble suggested this case (he has one very similar and he loves it). I haven't been on any tours with this case yet, but it seems very sturdy and I'm sure it'll protect everything. My trumpet fits inside well and doesn't wiggle around a lot. There's a good amount of padding and the large space for mutes is appreciated, I'm able to fit my straight, cup, harmon, and plunger as well as a cleaning kit and I still have room for more! The compartment on the outside is large and has room for just about anything you would want to carry. Yes, this case is a little large, but it also holds everything you would need to bring with to a practice. People might complain about the size, but you have to remember that if you get a smaller case, that doesn't hold mutes, then you would need a mute bag as well. I'm very pleased with this case and wish I hadn't waited so long to buy it.",
    "The acoustics and Gibsons hang wonderfully, but my Strat hangs slightly crooked and awkward in the yoke. Yes, I know that the product says that the yoke can be squeezed together (I don't trust metal fatigue), but I just slid the little rubber washers closer to the headstock which helps tighten the space up. They are all mounted in wall studs, so all of my guitars are safe just hanging out. I trust this product and love the white base that matches with the room that these are hung in.",
    "The Crybaby Wah Pedal was a big birthday hit -- thanks.",
    "I have used this tuner for several years and have much appreciated its simplicity. With previous electric tuners, I found it very difficult to tune in a crowded or noisy environment. The microphone would pick up other noises and would be confused.This tuner, though, clips onto the guitar (or fiddle or mandolin or whatever) and picks up vibrations through the wood. Thus, surrounding noises don't interfere with tuning.Other nice features of the tuner are that it is quite compact, the battery seems to last a long time (I haven't changed it in two years of use), and the little clip swivels so you can see the LCD display from various angles.On the whole, I have been quite happy with this little tuner.",
    "These have to be my favorite picks! I play acoustic and these work great. They are medium weight, nice quality. Not too thin, but yet bend nicely. Ever since I used one I had to have more so I ordered them on here. They have a nice grip also which I like so they don't slip out of my hand. Very sturdy. Will buy them again if I ever need to!",
    "I bought this for the combination of good comments and good price.The bag is sized for a very specific keyboard, it seems.IT doesn't fit any 49 keyboard I know and most 61's.THe provider, Musician's Friend wants me to repack it and pay for the UPS shippingif I want a refund. It doesn't make any sense.Oh, the bag? it would be an OK bag if it could fit anything snugly.",
    "I enjoy the capo for both acoustic and electric playing. Easy on easy off fits snug over all six strings. I recomend it to anyone who want a quality capo at a reasonable price.",
    "We alreday had another model of a Manhasset music stand for my daughter and decided to purchase one for my son. My only complaint is that the bolts were on so tight it took awhile to get them loosened. I don't know how my son will be able to adjust the music stand without a wrench (maybe they will loosed over time and yes we tried to adjust so that it was tight enough to allow the music book on the shelf and would hold the weight). A recommendation would be to have a different type of adjustable bolt, (one of those wheel types). The ease of moving the height up and down is very smooth. The bottom of the stand is scratchy, so if you have hardwood floors, get the pads. We ordered those, but they haven't arrived yet, so put a throw rung underneath. Overall, this is a good product and we expect many years of use with it.",
    "For the price it is really good. Especially in this kind of economy, prices are increasing but this is an awesome bargain.I know the other reviews say that this chair is uncomfortable and all but they are probably used to $150+ seats. This drum throne meets my budget and does the job well. I`ve had this for at least a week and have played with it for a concert. During a recital your mind should be focused on reading the notes, not on how comfortable the chair is. To be honest this all comes down to budget and what you want. This chair is comfortable and is the right height. I think this is a very good but if you certainly need a $100 chair, go for it. Packaging was very safe and affordable. Compared to other thrones this is very good and is ahead of some top-notch competitors. Also the legs are made out of steel so it will last some time. Packaging was very safe and it only took 5 minutes to fix. The chair was already assembled and the actual seat needed to be fitted on-Thats it! Quality wise everything was good except that to change the height it took some time but not a major problem. That was the only problem with is chair and I can very well live with it. This review is long but i hope you buy this throne!Thanks !",
    "These headphones are great and sound awesome. they are very comfortable and because they go around the ear sometimes hot in warm places. i kind of like the 10 ft long cable but it depends. the one thing that kind of bugs me is that if i plug them into my phone or ipad they are not extremely loud. even at max volume i dont think they are very loud. im hoping someone can give me an answer to this problem, if its an amp, which one in specific. but when i plug em in to the speakers in my computer, i am amazed at how loud they make em, they sound perfect. i was also kind of hoping they could block out sound, but sadly no. it makes up for it with the quality of the sound though.these headphones are good for most music, i havnt found music these headphones dont sound good in yet. but yea in all, the sound is amazing but not that loud by themselves, the cable dosnt bug me as much, they are very comfortable but sometimes warm,why do mine say made from china?,and i would recommend these headphones, they are cool, im not gonna lie these headphones leak sound alot but they are not bad. again if someone could help me with the volume issue.",
    "There is a two step learning curve for Vegas 7At first look it is very easy to import video and position it on the timeline add an audio track and boom you got a decent video.Once you have learned the basics of positioning multiple clips and audio tracks on the timeline you will find there are some very serious tools that are part of the basic install. you can have more then one video clip at the same position this means you can layer your video. If you have green screen or if you are using 3d animation it is insanely easy to postion layer over layer over layer of video to come up with some great effects. additionally just like the multi-layer video you have access to multi-layers of audio meaning you can have professional dialog and theme music playing and adjust fades and levels. but it doesnt stop there lets say your video guy was too wide you can digital zoom and you can pan and you can do all of this on a timeline meaning you can completely control or re-edit scenes. and if the video has a tint or poor contrast or a multitude of other problems you can adjust the settings just like you were using photoshop tools on a static image.If you get serious with your work you can setup network rendering and distribute the processing load across a few computers.Sony made this software easy for the beginner and strong enough for serious studio work. Sure there are still a few things they can add but this is excelent software that will have you producing work from day 1 and searching through all its features until the next upgrade comes out.Avid and Apple cant touch this for the price and featuresif you are ready to step up from moviemaker into the world of professional video editing or if you work in a editing hut and need clean work fast then this is the product for you.Dont believe me then download a demo or kick out the bucks you will be happy.There is only one drawback that I have found and it is not an issue for most people. As Vegas is Professional software it does not support the direct import of many videos that use low quality codecs this includes Divx import .. But it will export as Divx ... The reason behind this and why most pro editors dont have import for these codecs is the high compression. Garbage in means Garbage out.. This is just the fact you have to live with when you are working with software made to do real work and not Freeware like MS MovieMaker2 that is basically for videos of the kids. Maybe Sony can add this in V8 but thats the only missing thing. so prepair to convert to AVI before you import.",
    "I like the quickness of the capo. But, I'm just restarting in the guitar world, and, ladies, it takes quite a squeeze to get the darned thing open and in place. But, as my hands get stronger (or is the capo getting weaker?) it is getting easier to use. I pretty much agree with the previous reviews about its utility and drawbacks, primary drawback being the uneven pressure. But, until I get really great with the instrument, this will have limited affect on the quality of my notes.",
    "I received a new glaesel cello mute, exactly as described from the seller very quickly. The seller is awesome.Now, about the mute. I have read many mute reviews. As mutes go, this is a good mute. The string tones are correct and true according to my chromatic tuner. This means practice relative to hand/string position will be accurate. The mute fits a full size cello perfectly, rubber between the strings not touching, stays on the bridge easily.It mutes the sound appreachably, however instruments are loud by nature. My townhouse neighbors do not hear the cello with the mute, however occasionally do without the mute. (I think the sound goes out my closed single pane window and into the neighbors). The room next door, same dwelling? Yes, and yes, just not quite as much.If I were in an apartment I would only practice when the neighbors were not home...or rent a small storage facility locker (climate controlled preferred), or find a practice hall like Sam Ash if you dont have a house/townhouse and/or non-shared space. Or remove your strings.Better than a round type rubber mute in volume control.",
    "This item is solid in construction and easy to assemble (just a screw driver & 17mm wrench). playing guitar with music sheets at a proper height leads to better posture with less fatigue. Very nice and simple product. I wish I had one a year ago.",
    "This is the first guitar tuner i have bought so i dont know what to expect. I don't play guitar, but bought it for my son, along with a guitar and amp. So i attempted to tune the guitar myself before i gave it to him, and it was so easy. just remember to turn up the volume on the guitar first, cause i didn't at first and it wouldn't work.",
    "I hesitated a bit before ordering this shock mount, thinking that the cheap price would mean a flimsy or poorly fitting device. But I'm pleased to say that the construction is quite solid, and the fit, while tight, is very strong and in no way damages the microphone (an Audio Technica AT2020 USB). Altogether I'm happy with this shock mount, and I would recommend it to any other AT2020 owners.",
    "My Beatles acoustic tribute band uses these cables as they add a very classy vintage look when playing acoustic guitars.They look great, sound great, are durable, and don't tangle easily.Highly recommend them.",
    "Fabulous cable. Really extra heavy duty. I don't have to worry about this one pulling apart anywhere. If you need a stereo to mono/mono, this is the cable to get! Thinking about purchasing another just to have an extra. Puts those other cables to shame.",
    "I love drums and rythim so I decided to learn how to play drums. I decided to buy something not to expensive nor too big so that it would not became a problem if I got disappointed during the learning process. Well, I have this set for one month now and I'm satisfied with it and it had served it purpose which is to initiate myself in the art of drumming. However, I must warn you, it's a toy, do not be fool by it having pedals and all, the product will not give you the real feeling that more professional drum sets can give. I'm already thinking about buying a serious equipment, but it won't be until I finished my basic learning phase",
    "My 1-year-old daughter LOVES this toy!!! Not only is it a tambourine, but the plastic in the middle makes it a drum too! She can't stop playing with it. One of the best deals we've gotten on a toy EVER. Fantastic!!",
    "First thing off, is the crappy power connector. Pretty much a bogus setup they haven't changed in decades. (On ANY of their gear)They put a rectifier inside the box, and simply supply 12VAC wall wart power to the connection...such as it is.If it falls out of the equally lame socket, write EHX and complain as I have! This suggests very poor electrical engineering, regardless of the case at hand.The unit compresses nicely though, and has some flavor for sure. All comps have a flavor. This one sounds like a stones kinda thing.Way different from a Summit or an Effectrode PC-2A. Still...it has a decent tone and is pretty variable given the minimal controls.Box is a bit bulky. Could do without the tube lamp....pointless.Guess I would have preferred a decent 12VDC supply instead of the AC unit.Played mine just a couple times, and noticed a temporary signal dropout of sorts for about a few seconds. I'm suspecting a loss of voltage temporarily due to the horrible connection scheme on the power connection. It is REALLY A LAME DESIGN. I will modify mine immediately.So from a sound electronics view, it's not to bad at all functionally. Mechanical engineering wise...not too swell. But people drive Fords everyday successfully too! Sound wise, it's worth the cash. I'd suggest some mods myself. The Neutrik connectors for guitar also suck IMO. Should be Switch Craft IMO. The comp sound is VERY nice though, and the tubes really help at 300 volts!I thought it a risk to purchase, but seems pretty nice from a pure audio analysis aspect. Beefed up with some mods, it could see road use I think. Without the mods...Don't think I'd try that.Best of luck should you decide on one. AT LEAST IT'S TUBES, AND AMERICAN MADE !!",
    "1st time I ordered this product, it would not extend and only stood about 3 feet tall. luckily I have Amazon Prime and it got replaced quickly (I got a new one within 1 day) but I digress...This product is shorter than my other inexpensive music stands, it's only about 4 feet tall at its longest extension. It's sturdy enough for my drum playing, my guitar, keyboard etc (but I had to get a different one for my singing, since I have to stand up for my singing practices).I like that it's lightweight, it's easy to adjust, the heavier/more expensive ones are harder to adjust for me and if those fall, they can hurt. If this one falls on you, you may not even feel a thing, it would be like bamboo reeds. I love it!!!For a taller, inexpensive music stand, I will orderHisonic Signature Series 7121 Two Section Folding Music Stand with Carrying Bagagain.",
    "got this in today, very fast shipping.. amazon has always been awesome. yeah its 7 dollars (or 8 whatever) but if you seriously want to learn this instrument pass the sweet potato up. in essence its two pieces of plastic molded together, mine had a few holes in the trim allowing this ocarina to sound like a dog dying. i will purchase the clay ocarina because i want to learn on something that sounds good, seriously the one i got, the 3 & 4 holes have no pitch difference. if a kid wants this they would probably be happy, again if your serious about learning pass the sweet potato up. the packaging looked like it had been in a dust warehouse for years.",
    "EXCELENTE PRODUCTO, MUY BUENA CALIDAD Y PRONTITUD EN LA ENTREGA. FUE UN PLACER HACER NEGOCIO CON ESTE VENDEDOR.GRACIAS POR TODO",
    "First time out of the box this Tuner worked properly after battery was installed. After that, the mode I wanted to use worked once and that was the only time it worked. That mode would be the Auto Mode with the dial pointed to slow, never worked on medium or fast in the Auto mode as well.",
    "I got this to play my laptop's virtual synths out live. Keys are surprisingly solid and the action is decent. You can't expect hammer-type action (I've got the Studiologic in the studio for that), but this is better than synth action for piano sounds.It is *very* light, which is a real plus for me as I want it for live gigs.At this price, it's a good bargain. Octave +/-, Transpose +/- (Perfect for me as we tune down a half step); pitch bend, mod wheel and volume slider are all user assignable. I don't make any use of the Program Change features, so I can't comment on those.",
    "I received this clarinet for my 8th birthday when I began learning to play. Seventeen years later, I am 25. My life has taken me so many places, thousands of miles away to college and marching band, and tens of thousands of miles around the world to China after graduation. The trusty B12 has been an ever-present friend and companion throughout the years and has never given me trouble.If you have a son or daughter who will start learning clarinet, I wholeheartedly recommend the B12. Good tone is 80% the player and 20% the instrument (and that might be generous to the instrument), but you don't want to buy something that will fall apart. Please don't just take my word for it; try before you buy. But this is one young man's opinion based on 17 years of music from his trusty B12. The only thing I have upgraded is the mouthpiece to a C-star, and I have replaced the pads occasionally, and the springs once (I think).If your student becomes more serious, I suppose you could upgrade to something nicer, such as a wooden clarinet. I just never have had the heart.",
    "Mr. Raymond was very responsive and helpful in answering my questions. I placed my order on Friday, & Spirit Flutes sent a \"thank you\" message the same day, to say that my flute would be shipped priority mail on Monday. Amazon estimated that I would receive my package in three weeks, so you can imagine my surprise when it arrived in only three days!The shipping charges were very reasonable. and the shipper used USPS packaging. The flute and stand were separately and carefully wrapped in heavy paper, and Spirit Flutes included a soft, synthetic flannel, drawstring bag as a little bonus.The flute itself is well rounded, beautifully polished, and the maker went to some artistry to incorporate variations in the wood grain into the design of the flute. It simply begs to be held. As a personal preference, I am glad I ordered the flute in cherry, because the stand is cedar, and too aromatic for my taste. The cherry wood is also a lighter, warmer color than the cedar.I am a total novice, having not played any musical instrument since middle school, but I watched a few \"how to\" videos on U2B, and I was able to produce respectable sounds on my first try, making this a very rewarding experience indeed!I avoid shopping at the Malls whenever possible, and I buy something on Amazon.com nearly every month, and I have to say that this has been the most rewarding experience I've had with Amazon so far.",
    "I was very happy to have found an inexpensive trumpet for my 5th grade beginner. I didn't want to spend $[...] on a trumpet not knowing if my son would still be interested next year. At first, I worried the Cecilio trumpet would be a cheap, plastic type toy trumpet, but was pleasantly surprised when it came and found it to be a good beginner's trumpet. My son also thought it was the coolest looking trumpet in his class. The trumpet was also shipped before the \"ship by\" date. Overall, we are very pleased with this product.",
    "I thought I'd be luckier than most of the previous reviewers, but no; when my Deluxe Keyboard Stand was delivered, it was missing eight screws and eight grippers, thus making it impossible to assemble. I had to repack it and return it to Amazon. What a waste of time. I also noticed that it is designed so that, when seated, your knees hit the stand legs, making it almost impossible to use (should you ever get all the parts).I have since bought a very strong, properly-designed stand by Kaman in a local store (already assembled). I suggest Amazon stop selling this Casio stand, as all the necessary parts often are not included.Kona",
    "Great Keyboard, Can't say enough good things about it. Within seconds I was playing it like a pro. It sounds like the instraments on it. This really isn't a keyboard its a synthisizer.",
    "Just picked up this guitar today at Guitar Center after spending the past couple of weeks scouring the web for a good first guitar for my boyfriend--and after countless hours of research, a careful inspection, and test run in the store (and a bit more playing when I brought it home), I couldn't be happier! I've been playing for three years now and my boyfriend has always been interested (but a bit more so this year) and so when it came to a Christmas gift, I knew EXACTLY what I wanted to get him. I'm a student on a budget, so $100 was really my limit (this is why I spent soo much time researching). All the reviews here and on diff. music websites were great--and all true! The guitar sounds so full and rich and really holds its sound nicely. I play classical personally (just bought my own guitar a a few weeks ago) but I found myself falling for this acoustic! The finish is pretty sweet (more of a matte finish), guitar itself is pretty light and even comes with an attachment for guitar strap. I can't wait to give this to him!",
    "This product is well-built and would be quite useful for someone who's just getting started or when budget prohibits shopping for higher-end products.I am returning the product because I am highly dissatisfied with the tone of the preamp. I was hoping to put this between myself and an M-Audio Firewire 410 so I wouldn't have to keep resetting levels between bass, guitar, etc. However, the Firewire 410 preamp sounds so many times better than the preamp in the 802 that I was forced to abort mission.Fiddling with the Eq made things a little better, but the difference between the 802 and direct is still unbelievable. Plus, who wants to put a bunch of Eq on an incoming recording signal and have one more thing to mess with trying to get ideas down?I give the 802 three stars because it seems like a quality product, but would advise more discriminating users to save up and get something with a better preamp.",
    "My 19 month old was annoyed that his toy violin (or his \"fuh-feen!\", as he calls is) didn't make a good sound like Papa's while we would play together, so I figured I'd buy him a 1/32 real fuh-feen. He loves it. I recommend using a different rosin (I bought \"Melos Light Violin Rosin\" here on amazon).I take off one star because the tiny plastic lever under the fine tuner on the D string bumps into the lever for the G string and so you're limited in how far you can fine tune the D string (you can still use the standard tuners, but I prefer the fine tuners). However, since he's 19 months old and only likes to make a bit of noise on it, this isn't a big deal for us at the moment.",
    "I ordered the recorder and book /cd for my daughter, who needed it for music class at school. (I think that sharing the community recorder is just gross! Even if it is \"sanitized\" after each use. Yuck!) The instrument is good quality and perfect for school music classes. Didn't sound nearly as bad as I thought it might :) The color choices make it fun, too!",
    "Love this old school record case. It's perfect for our purposes. It is containing albums that previously were stacked on the floor. Of course there are many more albums without a home but this case is cool.",
    "Seagull is the king of N.A. built, inexpensive, great sounding guitars. I have many acoustic guitars, but this is one of my favorites. No frills, but awesome sound and playability. This guitar has been replaced by the Coastline series, but they are little different. Best of all, it is not Asian built, which is hard to find in less expensivie guitars.",
    "I have tried many different rosins for my violin, but this one takes the cake (pun intended). The rosin is of excellent quality producing a clear tone and the wooden box makes it a clean addition to my violin case.",
    "This product would not work with my existing technology. But it may very well be a fine product, just not right for me.",
    "Cool product for a cool price.Very nice for begineers(included cds, extra strings, tuner)I am satisfied with the purchase",
    "this set is fantastic. the only down side is that you need like dj headphones to play in private. another fault is that the pads have a little sensor device so you have to hit the middle of the pad. Overall this is a great set for a starter or someone who just wants to travle and not bting a big acoustic.",
    "The only defense of this cartridge one can attest to is its resistance to skipping while doing turntable gymnastics. Comments about sound quality of the cartridge while using Serato Scratch or Traktor scratch are irrelevant and can confuse the newcomers. Sound quality of your music depends on the quality of your MP3, sound system, eq and processors. PERIOD!!!! The vinyl for DJ software is just a time code interface. So it makes ZERO difference what type of cartridge you use.Now, if you are using this for REAL 12 inch records or albums then the discussion is warranted and you will notice a big difference between these and some of the others.Just wanted to clear that up!",
    "High quality, although it is plastic. But my son LOVES this metronome. It really made a difference in motivating him to practice.",
    "I had my hopes really high for this recorder, and when I finally thought it came, it turns out they shipped it wrong so I got the cheaper pearwood one instead. I was extremely disappointed.",
    "As of 10/15/09 I have received all 12 picks. However, my 4 star rating is due to the fact I had to almost expect to be missing a few. The case was sent to me as a very flimsy blister wrap rectangular casing. The bubble wrap in the box prevented it from opening. It might be sturdy enough to ride in a big box as I can toss and throw it around without it popping open. (I probably looked like an idiot doing it but, it's all in the name of science!)Bottom line, if they are sending this blister wrap case to everyone then I think our concerns are over unless your ups guy plays destruction derby on his way to your house. And as always, I would use no other pick for my electric. 5 stars for the picks, 4 stars for past delivery fudge ups causing mistrust. Peace fellow guitarists!",
    "This is a great electric guitar.Pros:You can hear it pretty well even when the guitar isn't plugged into an amp.Barre chords and other chords are easy to play on this guitar.Easy to get to the high frets due to the famous shape of the sg.Looks great.AC/DC's lead guitarist Angus Young plays the same style and brand.Cons:When standing with the guitar, the guitar's neck tends to want to lean downward.I suggest buying this guitar to anyone, even a beginning guitarist.",
    "Lifetime warranty , the best connections and wiring in the business. The gold makes a huge difference. I now have converted every cable I own to monster. You simply cannot beat the lifetime warranty on these cables. They are worth every penny if you care about your tone.",
    "Got this case for my 8 year old sons 3/4 size guitar. It fits perfectly with plenty of wiggle room so that it's not stuffed in. The backpack straps are his favorite part. The pocket holds his folder, music, book and picks. Durable and excellent for the price. I highly recommend it. I think some of the negative reviews were from those who didn't realize that it's for a 3/4 size and their full size guitar didn't fit.",
    "The Pros: Fantastic quality of sound. Very sturdy, reliable. Those who say they break easily, apparently have failed to understand how to and what for to use them. No, they are not you pillow. Not your seat cushion either. I've had them for about two years now and they look, feel and sound like new.Very nice looking headphones, too.The Cons. Somewhat heavy, not very comfy (The Sennheiser HD555 are the most comfortable cans I've ever owned, but the Pioneers sound better). As it is common to all the closed type headphones, on rare occasions, when playing some abnormally low and powerful bass, the sound waves get trapped inside the cups and cause bad distortion. It happens very rarely, though. Overall excellent product.",
    "I'm a bass player, so the guitars I own are mostly wall decorations that my girlfriend uses every now and then. After snapping an E string on my Gibson, though, I had an opportunity to take these strings for a spin.I was pleasantly surprised with how crisp and bright the sound was. The first impression I got from re-stringing that broken E string had me wondering if I was using the same guitar. I did some picking on the strings, and they're a lot easier on the fingers than normal strings, even without using a spray.If you are looking for a mellow sound, these are not the strings for you. But if you want some bright pop out of your notes, you found your string set.",
    "Producto recomendado, cumplieron con la entrega a tiempo, excelente calidad. Fue empacado correctamente y de manera conveniente para el viaje.",
    "An excellent choice for me. Not quite as nice the Shure EC3s I have been using but a little less in cost and a lot more sturdy in construction. I had to return 2 pairs of Shure's due to breakdown and flimsy build. My one beef would be the selection of \"bungs\" that came with them. A softer, more flexible material would be better and more comfortable. Great sound, great isolation, I like the way the wires go over the ears to minimize cable knocking and maintain a secure fit. Another fine M-Audio product",
    "I bought this in early October, 2012. They changed the design and a problem, which was pointed out by Roger Harris and by Anibal Rodriguez, was gone. It works fine. I prefer the bar be a little longer.",
    "Good product for price. Would recommend to anyone who wants to leisurely play the bongos. Not professional level but very well made for amatuers",
    "These stands are awesome. This is my second one. They are incredibly easy to put together. It only takes a matter of seconds. They're easy to adjust, they can hold almost any style guitar, and so far I haven't had one break, bend, or fail.",
    "If you need a little neck stand to use while you are changing strings, this is exactly what you need.",
    "I have had a Yamaha pacifica guitar for 15 years that I just play without an amp. Just a headphone amp or no amp. I just keep it next to my chair and pluck away when I feel like it. I decided to pick up an amp but I didn't want to spend a lot of money. So based on the reviews at amazon and the price I figured to give this amp a try. I tried it out the other night and I am very pleased with the quality and sound from the amp. I actually expected a less quality and performance for $69, so I very happy with what I got. It has been 30 years since I have played an electric guitar with an amp and I forgot what fun it can be.",
    "I found a Casio keyboard at a local garage sale. I purchased this item to interface with my Garage Band software. The item has worked great.",
    "I am currently deployed to Afghanistan and was looking for a decent guitar that wasn't too expensive and would play reasonably well. I have a Washburn Rover travel guitar with me, but you can't play that above the 16th fret. There was a cheap Ibanez here that I restrung and was going to use, but it played terribly. Poor tone, crappy neck, so I stuck with the Rover until I ran across the Jasmine by Takamine S34C. I haven't been playing for 30 years and I'm not a beginner either, having played for approximately 2 1/2 years. Probably the best way to review this guitar is to compare it to some other guitars that I have played. I started with a Lyon by Washburn package ($100.00). The guitar looked good, in fact maybe a little better finished than the Jasmine. However, it the playability was no where near as good. I have a Takamine G-series version of this guitar back home and the Jasmine by Takamine's neck and low action feel exactly the same. In my opinion the neck and fretboard are extremely easy and comfortable to play (you can play to the 20th fret with the cutaway). The matte finish adds to the ability to move quickly up and down the neck. The fretboard has a little curve to it, similar to a Stratocaster, which makes it really easy to make chords, especially barre chords. From that aspect alone, this makes it the perfect beginner guitar, as learning chords, and especially barre chords is extremely frustrating on a chunky neck guitar with high action.The tone is very nice, not quite as good as my non-Jasmine Takamine (or the Lyon by Washburn for that matter), but it is a third of the price too! Chord playing is especially sweet sounding with a decent bass on the low strings.The bridge holds the pins well, the tuners maintain tune well and were nice and tight when I received it.You do need to change strings, mine were a little corroded, but not much worse than they would have been if I had been playing it for a couple of weeks. They were kind of stiff too. I tried some extra light D'Addarios (.10) but with the low action, I got some buzzing on the G and D strings at the first couple of frets that wasn't there with the stock strings, so I put the stock strings back on and ordered some .12's. You could get by with the stock stings for a while though.The neck is dead straight and with the stock strings, there was no buzz and no need to adjust the truss rod (the guitar does have a truss rod and you get an allen wrench with the guitar for adjustment. The pick guard has a Takamine sticker on, which I took off to go to a more classic plain black look. Finish-wise there are a couple of blemishes that look like the stain isn't even, one on the spruce top and a little on the fretboard. But considering how sweet this guitar plays for the price, not a big deal.If you are a beginner, I would look no farther than this guitar to start with. If you get some .12 strings to change out the stock ones, some picks and an electric tuner, you will be set to go pretty far before you would ever consider an upgrade. If you already have experience, this is an OK guitar if you don't feel like kicking out the bucks for a more expensive guitar or are looking for an extra at a second location, and you don't mind some of the individual string tone issues (see below).I was hesitant to buy a guitar that I didn't play first and was worried about how shipping it across the world, subjecting it to the military postal service and finally having is convoyed out to my location in a trailer behind a tactical vehicle would treat it. But, I didn't have much choice. It arrived completely undamaged from Austin Bizarre. You can see that most of the ratings really like this guitar and that helped me make the decision to try one out. You will need to spend at least two-three times the price to do better than the Jasmine by Takamine. My experience was that you literally can pull this guitar out of the box, tune it and play it with no set-up.ADDENDUM: Well, I have been playing this guitar for two months, and MOST of my initial review applies. It plays very easily and it best for chord playing music. The tuners stay in tune, but they are a little gritty when changing strings. The tone for individual strings as in playing melodies or solos has a bit too much booming base on the low E and A strings and is a bit tinny on the high E and B strings. So, if you can live with those short-comings, it's an excellent value. You certainly will be able to figure out whether you are going to stick with guitar on the Jasmine. For experienced guitarists, it depends on what you plan to play on it- you may want to spend the extra $$$ for the better tone on the individual strings.",
    "I've had many foot stools in the past and this one is by far is the best. It's easy to set up and put away, light enough to carry around in a backpack and it's very sturdy. The rubber top keeps your foot steady and it's not slippery at all. It does smell a little funky at first, but most rubber does. The smell fades fast, so it's really nothing to worry about. I highly recommend buying this item if you're looking for a good foot stool at a great price!",
    "This mic works great for our needs. We are able to ride horse around and give instructions and announcments so all spectaters can hear. We are impressed with this product.",
    "Although the picks were fine, the packaging was horrible. During shipping, it opened up and the picks were stuck inside the flaps of the big amazon box it was shipped in. I was able to recover most of them, but did not end up with 12.",
    "I was able to procure this little goody from a work bonus. At 60 bucks it is not going to break the bank. That said I will try to perform a fair comparison. It is not a $3000.00 benz micro cartridge. Of course I don't have a VPI turntable either. When compared to all the current carts in my arsenal I would consider this one to be the most listenable. I had a Grado blue cart for quite some time and the one is much more forgiving to aging vinyl. Side by side on a 180g vinyl it sounds much more transparent than the grado. Oh yeah and the grado is around 160 bucks. It out performed my previous audio technica PB33E. Much more midrange and treble clarity. Not all the noise my grado had either on less than perfect wax. After fitting the aforementioned AT cart with a shibata stylus the results were similar. Still yet this shure was less noisy consistently. I have a technics SL22 BD and a fisher MT-6330 direct drive table. I have also listened to this cart on a sumiko project debut III table as well. You will be pleased. Its not quite a V15 but its not expensive either. If you need a decent cart for the price and like listening to your vinyl then you can't go wrong here.",
    "Bought this music stand for my kids. It is easy to set up and easy for them to adjust to their height and comfort level. It fold up nice and small for easy storage. The stand is lightweight but seems to be made well.",
    "Okay, get this. I ordered this Pearl PCB6 Primero Cowbell and a cowbell beater (Meinl Cowbell Beater Ribbed Grip. I took the cowbell out of the box, picked up the beater, and gave it a test whack. Unfortunately, I was holding it at the base and pointing the open end upward toward my face. It is SO LOUD that I shocked myself. After that initial discovery, I had fun testing different tones while beating around this cowbell. Great price. I'm going to have fun with this.",
    "This product is great for the price. It functions well and is nice and portable.",
    "How much weight can this take? It looks really stable but I can't find a maximum weight on any description of this bench.",
    "A prompt delivery. The stand was sent well protected and arrived in perfect conditions. It is light, easy to manage and big enough to put on it big scores.",
    "I find myself returning to this e-string all the time. It matches well with many sets of G,D,A combinations (Dominant, Vision, Infeld Blue). It is clear and focused and does not squeak easily. The brilliance and clarity exist all the way up the fingerboard. The ringing overtones, power and clear focus brings me back to this string. It also seems to work well with every violin I own.",
    "Buyers BEWARE...do not buy this guitar. I purchased this guitar for my son and it has a very nasty odor to it. Smells like some strong chemical. I also bought a guitar for my daughter (pink baja) and it did not have this problem. I tried playing this guitar, but after 10 minutes I thought I was going to faint and my nose was burning so bad. I will be trashing this guitar and buying my son a different one. I do not need him to end up in the hospital with some kind of ventilation poisoning due to the chemicals used on this blue guitar (I'm thinking it is from the varnish). One more thing, this guitar is very cheaply made. I bought the pink baja and this one at a similar price. This blue guitar is a piece of junk that will be thrown away. Parents DO NOT buy this one for your kids...buy something else.",
    "This card has done wonders for the sound on my computer, even with my mediocre Altec-Lansing 5.1 speakers. I did have some difficulty with the install, but not because of any problems with the card or its drivers. However, conversations with M-Audio's tech support helped unravel a problem with how my HP Pavilion was configured and what it would take to fix the problem in spite of the rigid Windows XP configuration. I am enjoying this card, and I got it at a great price.",
    "great product. I don't find anything flat about it's response but I love it's clarity and what I can do with what it picks up! Perfect mic for the $. who knows, maybe it really sounds like that 10' up!Using as blend for live recording, I pick up the house sound with this mic and lay the soundboard signal on top of it; with the right eq on this mic it makes for a great rich, clear mix. Without the eq it sounds like it's in a tube.update on review: In looking back, I think the mic has a perfectly flat response and it did sound really different 10' up in our venue where I had the mic hanging. I love the mic, it is very directional which means you can point it in a manner that avoids feedback and you can choose what you pick up with it. Great mic for the money.",
    "The user interface on this beast is stellar. Easiest to use and most interactive. Nice sounds, features, flexibility.However, I have both an EMX-1 and ESX-1 and both relatively quickly developed data-knob jitter. Try to turn it up or down and it'll bounce the other direction intermittently. From some of the forums I find this is not uncommon. It's extremely frustrating and annoying. Korg will fix but they just replace the knob with another which will develop the same problem again. This is a serious flaw because it makes it unreliable for live performance. I do love this box but you'll have to hook up an external MIDI device to substitute for the data knob if you want to depend on it live. If it wasn't for that I'd give it a solid 5...",
    "I replaced a poor quality stool I bought locally with this bench. The stool was too small for my big keister and didn't last. This bench is well made and exceptionally sturdy. And this is a great price to boot. Buy this one; and stop looking for something better and less pricey. I don't think you'll find one better than this one.",
    "This is the best deal on these casters. They work perfectly just as the originals. My only complaint is that they smell like crap for a about two months, but the scent has decreased, or I've become immune to them.",
    "This is a great guitar, period. Inexpensive, but not \"cheap\" in looks, construction, playability or sound.Like everybody else who's bought one, I had to take a blind leap of faith -- the Agiles are only available by mail order, so unless a friend has one you can try, you're going by word of mouth.And when I was looking into getting an Epiphone LP, the reviews for the Agile AL series stood out. They were fanatical -- I've read maybe two reviews from customers who were disappointed.The only consistently negative reviews seem to be on Amazon, and if you read them, they seem to be from people who are against the Agiles on principle, not people who've owned them.The hundreds of others, in forums (one has the initials \"UG\") and in user reviews (over 50 at a site with the initials \"HC\"), are more than satisfied customers -- they're thrilled customers. Including myself.And I knew part of the reason why the second I unboxed mine and picked it up. These are SOLID instruments -- the set-in maple neck, headstock and mahogany body sure feel like one single piece of wood. And the sustain and variety of tones are there to back it up. Even with stock hardware.And wood is the most important part of a guitar. You can replace all of the hardware, and adjust every screw and the truss rod, but the neck and the body better be good out of the box -- 'cause it's a lot easier to replace the pickups than to replace the neck.Yes, the AL-3000 may be a better deal for you -- at twice the price (about $600) you're getting a single piece of mahogany instead of three for the body, a mahogany neck to match, a thicker maple top, and an ebony fretboard.But that by no means rules out the AL-2000 for anybody. The solid 3-piece mahogany body, the maple neck and (thinner) 1/16\" maple top, the rosewood fretboard -- not exactly unusual woods for quality instruments.The Agile AL-2000 feels like it would take ten Pete Townshends to smash one. Read reviews, and the word \"tank\" will come up over and over.I found two very small cosmetic flaws: A slight blemish about two inches below the tailpiece, which I have to really look for in the right light, and a tiny gap where the body, neck, binding and pickguard all meet, showing the slightest dollop of filler. A Q-tip and some gold paint would fix it right up, but its even less noticeable than the blemish.That said, no one has ever accused the Agiles of being ugly. These are beautiful works of craftsmanship -- and there is a huge variety of finish styles available. If I have one regret, it might be that I didn't roll the dice on a bookmatched spalted -- you may get a great one, you may get a good one, you may get a mediocre one, but you will never get one that looks just like anybody else's.This thing made its way from Korea to New Hampshire to Minneapolis, where the poor thing sat in 45F weather until I got home. No matter what the word of mouth was, I was planning on a pro setup, new strings and probably new pickups out of the box. I mean, it is a $220 guitar.Unpacked it, waited not-long-enough for it to warm up (C'mon! Would you?), and tuned it. Amazing. Every single string was almost exactly 1/2 step flat. I guess those Grover Tuners that come stock really are all that. And the 1-18 ratio made tuning precise and easy.Also amazing was the action. Super low and fast, with nary a fret buzz or dead spot to be found. Absolutely astounding was the intonation -- I'm very picky, and my usual method of open/12th harmonic/12th closed in fast triplets usually makes flaws stand out. Nope. Not on a single string.Even the strings were already decent. 10 to 46s, standard stuff, but I'll keep using those gauges on this guitar. So, that $40 setup I was planning on was already done so well at the shop it was like I'd told them what I wanted.It plays like a dream. It's heavy for some, but unchambered LPs feel heavy to a lot of folks. And it's beautifully balanced -- I let go, and the headstock doesn't take a dive. It stays right where I left it, with the weight on my center and left shoulder where it belongs. The neck is slightly slim and narrow compared to other LP-style guitars -- maybe a problem for thick fingers, but nice for speed. The jumbo frets, the incredibly smooth finish on the back of the neck, and the solid feel all add up to a musician's instrument.Finally, and most importantly, the sound is beyond reproach. Nope, I didn't replace those ceramic wax-potted PUPs after all. Les Paul's own sweet, mellow jazz sound; Cream-era Clapton's \"weeping woman\" tone, Steve Jones' full frontal buzzsaw assault, the history and huge variety of sounds a good LP is famous for -- it's all there.If you play this guitar with your hands, and listen to it with your ears, you will love it to death. If you look at it for its headstock, and turn your nose up at its price, you are missing out on a true prize, and possibly the best deal on an electric guitar available.",
    "This has got to be the best cymbal I have. It's like a crash and china in one. Very short decay. I only wish they made them in other sizes. That would be all I would use.",
    "Paiste 2002 Crash is a fantastic crash cymbal! Very explosive and versatile - I use it as an auxiliary ride at times. Had a friend play it as well and he uses it during solo's to ride on.Go to the store and be sure to try out this, the 18\" thin crash, and the 18\" medium crash. All EXCELLENT cymbals - see which is best for your drumming style.Always wack cymbals before you buy them. Paiste is always a good choice - excellent quality.",
    "I've tried the GE RF amplifier from Home Depot and it is pure garbage. The Walmart RCA flat antenna comes with an amplifier is recommend at the $30 price point.My Silicon Dust HDTV Tuner measures the antenna signal strength and signal QUALITY.So the measure measured (and visually confirmed) system consists of the larger $40 flat RCA antenna (that Walmart used to sell without an amplifier) and this 4 port HDTV amplifier.Both the signal quality and strength measure 10 points higher than the $30 Walmart combination. Superb engineering as the picture quality is crystal clear. I live about 25 miles from the broadcast antenna's and have the antenna and this splitter located up in the attic. My signal strength and QUALITY is typically in the high 90s!For best antenna positioning, my wife read the reading off for signal QUALITY using our cell phones while I positioned the antenna in the attic. A ten minute job while noticing that even a few inches can make a large difference.Incidentally I use the Dish PAL DVR and record the FREE Off-The-Air(OTA) broadcasts. No need to pay for cable, satellite, or Tivo subscriptions - just as it used to be during the analog broadcast days with VHS. Some innovative stations are even broadcasting HD movies, just like it used to be. Very pleased!",
    "Because I broke the original one that came with the mic, I needed a replacement that I was unsure if it was going to fit, however, it came in perfect condition and I was able to make magic again.",
    "My 3 year old daughter looks so professional behind this drum set. It works really well. Highly recommend this model.",
    "I bought these to give them a try, and they are great! I,m a beginner of the clarinet and they are working well for me!",
    "This is my second card. I bought my first one over ten years ago and it's still going strong in my old PC running XP! I use it with Sonar in my studio, and it is clean sounding, and easy to set up.",
    "Most disappointing purchase. The specs. sound right, but the sound, even after a year is horrible. Unfocused buzz-saw tone with wolf notes all over the place. I have had this violin professionally set up twice (tone bar adjustments, Zuex strings etc...) and the results never change. A bag of kittens thrown into a rusty wood chipper would sound more musical than this poor excuse for a stringed instrument. Last time I will ever order a music instrument over the internet. I wish I had spent a little more and bought an instrument that I could enjoy playing.",
    "I've been buying Fender guitar picks for over a year, and I only buy them after I realized how dependable they are. The medium gauges are the only ones I use, and they have a long lasting life before they get too worn out. I also like the ability to have different colors and designs, ya know, mix things up a bit.",
    "The make and feel of the Guitar is very good. The sound is loud and clear. Once tuned I did not hear the guitar going out of tune. I highly recommend it for beginners to intermediate guitar player. I am probably not the correct person to recommend it for pro since I lack the understanding of judging the instrument at that level.Overall I am very pleased with my decision to purchase the instrument at the price it was offered ($78) and having good time playing and learning with it.",
    "Or maybe the correct term for it is stylus? Either way, this item has done the trick to replace the needle on my vinyl-loving husband's record player. The sound is great, and it seems like it is built to last. Will know more later :)",
    "The concept behind this device is a good one, but it is built with shoddy components. Mine did not work out of the box (the microphone input plug fell apart (or was never together). I had to send it back.",
    "One of the best albums I have ever owned, I have played this over and over again since I bought it. Three very talented musicians still in their prime. Ageless and timeless as always, Cream will live on forever!",
    "6 mics, wires, & bag at such a great price! They all came as described and all work well. It's about two months of use now. At the inexpensive price, if one does malfunction I wouldn't hesitate to replace it with the same Nady mike. I would rate it 4.5 stars only because I can't rate it's durability yet. Once you EQ the mikes, their performance is equal to my Shure mikes!",
    "What can I say? It's a cable.However, from a practical point of view it was good quality for the money, no noticeable noise or crackling. I'm using it to connect a laptop computer to a piece of music studio recording equipment and I think it's just fine for that use. I wouldn't expect it to last long with frequent plug-ins/outs but being mostly stationary - it's solid, quiet, noise-free, and I'm pleased with it. Good price.I have one minor point I made in the \"Packaging Review\" for this order and that is that the cable was in a factory-packaged box (cardboard back, clear plastic bubble/shell) and that was cracked across the entire bottom of that shell. It appeared as-if it had been removed already and re-inserted. In spite of the cord being in fine condition I hope I didn't get an opened/re-stocked package as I technically paid for a new product.",
    "First off, this is not a $50 violin. If you really want to learn to play violin, you'll probably want to buy peg drops, a shoulder rest, new strings, and a new bridge -- the one it comes with is way too high. Otherwise, though, it's a fine instrument. The replacement strings are especially nice, as it's likely that you'll break one or two during the initial tuning. The rosin isn't great, but it works.The violin itself sounds fine. I'm an amateur musician (VERY amateur), but I've played with violinists before, and I'd say that no one would notice the difference in sound between this and a $500 violin, if you get your bridge placed and adjusted right. But I don't know that for a fact. If you are a classical musician or member of an orchestra, you can probably tell that this isn't quite up to par.My biggest complaint, apart from the bridge being monstrously huge and not curved enough, is that this violin just _looks_ cheap. The pegs have grunge around the pegholes that obviously weren't sanded, and the back of the neck isn't stained at all. I know, the neck is always left lighter, but this just looks bad.Overall I'm satisfied, but I do wonder if it could've hurt too badly to step it up another $50 or so and get the Cecilio or something. But this is fine for what it is.",
    "I bought these for an old beater acoustic that rides in my truck with hopes of the strings lasting a while and keeping a bright sound. The wound strings sound good as do the unwound B and E strings until they rust about a week after putting them on...and I mean cut your finger and give you tetnis rust. I guess the coating rubbed off the unwound strings some how; I'm fairly disappointed",
    "I bought these for a 13 year-old for Christmas. The package was impossible to open. I forgot batteries. When we got the batteries, we learned that you can only play drum with one stick, you have to play cymbals with the other. So you cannot use them to simply drum! They do not work at all if you use them to tap on a surface, so you must air drum. Also, one of the two sticks missed every third or fourth beat. This product is as disappointing as it could possibly be.",
    "With all of the great reviews here on these speakers, I decided to give them a go. I have $50,000 worth of recording gear and having multiple sets of different quality speakers is never a bad thing, when it comes to mastering and getting the sound you want across all spectrums of listening devices.The first problem arises when you want to hear any low end with these monitors. A 4\" woofer, just isnt enough on any level, to really hear any nuances in the low end of your music. Which is very important when judging what the piece will sound like on a very bottom heavy system with a sub. The second issue, is what others here have complained about, and that is noise. The cables that come with these speakers need immediately replaced with something better as they are cheap. There is never anything better you can do for your studio, than to buy high quality cables, as they are the difference between a good sounding piece and a great sounding piece... and should never be skimped on. Your sound quality is only as good as the lowest quality cable on input. So, dont be afraid to spend $100 on a cable, if you want to record and hear what is really happening in your mix.Third, these are not audiophile. DO not let M-Audios marketing department fool you into thinking these are high end... or even medium. These are glorified computer speakers and nothing more. They are not meant for a quality studio production. For about $100 more, you could go with the Alesis MKII's and save yourself a lot of heartache and headaches. While they arent the cream of the crop, you will get quality for your money. Which is something you dont get with these speakers.I have recorded many songs over the last 25 years and have done research into and have probably owned more studio gear than most music stores and studios. I have gone from the worst equipment, to the best equipment over the years and have learned from some of the best producers in the world, the ins and outs of the industry. As with cables, monitors are one of the most important investments you can make in your home studio. If you dont have the money for good monitors, save and wait. Otherwise, you will waste your money and still be wanting for more.By buying these monitors, you will be wasting $100+, that could have been put towards even good entry level, pro monitors. So, I beg of you... learn from my mistakes and stay clear of marketing gimmicks and hype. Learn from others mistakes and you will build a great studio, the first time... and save yourself the frustration of always wanting more and spending more money than you have to. Do it right the first time and you will never look back. Make the mistakes that I have and your road will be a long, frustrating one... until you finally build your perfect studio. :)I hope this helps.",
    "This is a great price for bass guitar strings and they sound great and i would recommend them to any bass guitar player",
    "The build quality of this pinspot overall is pretty good for the price. It comes with a nice length of power cord (3 prong edison male) and the transformer seems to be well mounted inside the casing. There is no fuse protection on the unit.As another reviewer mentioned, the bracket is not great. It's fairly thin steel which can be bent with just hands alone, and I doubt will last long if used in a mobile situation. The bracket screws are also a little tough to use; they are very small round knobs which don't provide a great deal of leverage to tighten and untighten. My final gripe with the bracket is that the hole drilled to accept a C-Clamp is only big enough for the small, flimsy clamps certain companies sell. If you want to use an industry standard clamp with these, your going to have to get the drill out and make that hole a little larger!There is a little rattle on the unit caused by a gap between the bulb and the screw cap. There doesn't seem to be a way to tighten the outer ring all the way down so that is secures the bulb and stops it from rattling around in the fixture, obviously leading to added vibration and possible bulb failure. I would imagine if you are using a plastic type color filter that this problem would go away.The worst thing about the Pinspot however is the bulb it's supplied with. I'm not sure which Chinese company supplied these, but you'll get a more consise beam reflecting a flashlight off some pots and pans strung to a chicken. There is no defined beam edges, with the beam looking like a large messy splodge of light with a few brighter patches closer to the center. It's may be fine for lighting a mirrorball at close range (&lt;6ft), but at 10ft, the beam is so messy, it's virtually unusable unless you're really looking for a random, spotchy effect.They would have been better off selling the unit for a little less without a bulb (replace it with a sealed beam GE or Osram and notice the huge difference).Overall though, good value for money... just don't expect them to last long and be prepared to replace the bulb.",
    "Great, heavy-duty stands which look as professional as the service they provide. These will be good to the user for years to come & more if they are treated with the kid gloves that they deserve. Pyle Pro gets 5 Stars for these stands & Amazon.com gets 5 stars for the price & Free delivery they offered me.",
    "I purchased this power adapter for a Casio LK-230. It worked perfectly without any issues. I purchased it through an Amazon featured merchant (Brook Mays). It was a really good price and I was afraid I'd get a knockoff/clone. This wasn't the case and I received a brand new Casio AD-5MR power adapter.",
    "This recorder has lovely deep tones and is a joy to hear! We use them for midevil and baroque music for a truly authentic sound.",
    "We are very happy with our Sour Green Apple Recorder and are planning to even order a second one. The price was low and the quality was high. My husband played flute in high school and is teaching our son to play recorder at home. He could not believe how good of a job the product did for the price. Also, I was not confused by the pictures. Amazon clearly stated one sour apple green recorder was being sold and not all three in the picture. I always read carefully before making a purchase and would recommend others to do the same.",
    "Kun is still the best shoulder rest. The old prejudices against this type of violin hardware are dying. It saves your neck, it frees your hand and arm, and it doesn't really dampen the tone, notwithstanding the old generation's concerns. There are copies out there that are pretty close; but at this price, why bother looking for a sub? I usedKun for all of my kids. Kids are tender. You can't play well when you're in pain.",
    "It does indeed take a lot of air to fill up both reeds - it's not a 10-hole diatonic. The wood comb gives it a nice traditional sound and the octave tuning gives it a full sound. It's not wet tremolo though and the scale is Weiner so it's missing some bottom notes. It's really easy to isolate single pitches on - even in the octave. It's the biggest of the Echo series though - nice, wide range. Very similar to playing the Comet but with the wooden comb and more reeds.Not so hot for blues wailing but it does nicely for the ethnic folk music it was intended to play. This isn't a choice for beginners and the price makes some others a pretty good pick over it. Remember, it's an octave harp and not a tremolo or blues-harp and it isn't scale-tuned like some of the Asian models.",
    "I purchased this for my grandson's 6th birthday, along with a keyboard. He loves it and it works perfectly for him. The only way it could've been better is if the seat lifted for storage. But this is a good buy, especially for the cost. Quick delivery, too!",
    "I originally bought this strap for myself and fell in love with it. I especially like the quick release aspect, with the clasp you don't have to unhook the strap from your guitar. When my mother put a guitar strap on her Christmas list I knew exactly which one to get for her, and she loved it. I highly recommend this strap. It is also extremely durable.",
    "This product is fantastic. Shipping was quick. It is a great quality. perfect for my son to tote back and forth on the bus to and from school. It is well constructed, feels really good to practice on and peaceful for others arround to not be bothered in the evenings. It's perfect!",
    "These speakers are incredible for the price and size. They are a little \"hefty\" for computer speakers but they sound great. Even when playing MP3 recordings (ripped from 1970s vinyl) they have wonderful separation and imaging (my description of a third dimension beyond stereo). And when you are sitting in front of your computer monitor for hours a day, you are sitting in exactly the correct position to hear the most from these speakers.I have a pair of Dahlquist monitors (no longer in production) in my living room and a pair of Sonus Faber bookshelf speakers in my family room. They both sound amazing when you sit in exactly the right position to listen to them (which I never do). My last pair of computer speakers were Klipsch ProMedia Ultra 2.0 PC Speakers which were great as well. They didn't last long due to a faulty volume switch.Enjoy these speakers.",
    "No regrets whatsoever. Holder works great but sure has a lot of tension on the spring. It's comfortable and has no problems like one I owned prior.Great seller too! I recommend both, the holder and seller.",
    "Pro: It worked as advertisedCon: After 2 minutes it decided to click at one speed no matter what setting.happy ending.. Got free app for android phone that has more settings.",
    "This guitar is a great starter for those just starting to learn the guitar. The nylon strings are very sturdy but I've liked to see all the strings to be nylon. They used steel strings for the 5ht and 6th strings. But the sounds is very clean and very deep. Lovely guitar, recommended to those who want start learning to play a guitar, but make sure you get it tuned correctly!",
    "It's exactly what I had hoped for. I couldn't have gotten a better kalimba. I'll never purchase any other brand--and the person I purchased it from took the time to describe exactly how I could re-tune the instrument to F and F#. He's a plethora of information and assistance.",
    "The quality of these tuners are as bad as the ones I wanted to replace. I'm very disappointed in the other reveiws that said these were good.",
    "Seems reasonably stable. Of course, if you bump the cello too hard you could knock it off, or if there was an earthquake, but it won't fall over on its own. The strength of the stand is that it's pretty inconspicuous, so when you walk into the room you see all cello instead of a cello on a stand. Reasonably priced and reasonably sturdy, but I'll point out that you can find these on sale at any Guitar Center. I have guitar stands and they have the exact same dimensions as this \"cello stand.\" In fact, if you ask me this really is nothing more than a guitar stand.",
    "I was pleasantly surprised by this toy harmonica. My kids have spent hours playing with it and the sound is surprisingly good. The quality is better than I expected too. A great buy!",
    "I've only had this pedal for about a month... so i write this without fully exploring all of it's potential.First thing's first... its a BOSS stomp box, so durability and design aren't really necessary to talk about. The only thing worth noting on that topic is that this pedal does eat batteries, even from just moderate use and leaving it unplugged when you arent playing. There are 3 solutions:1. Buy a power supply2. Remove the battery entirely when you arent playing3. Deal with it and keep buying batteries (right now, i've chosen this route)Aside from that, all i have to talk about is pure functionality and quality. Both of which this pedal excels at. The \"T. Arm\" mode is easily one of my favorite modes with this pedal. I treat it like a poor man's whammy pedal. It's cabable of pitching a note up or down 2 octaves and you can adjust its speed. For example, i've found if i set the pedal to pitch up 2 octaves very slowly then play some power chord up near the upper frets and jump that chord down the neck while \"throttling\" the pedal, it creates a *race car shifting gears* kinda sound. On the other end, its fun to set this function to pitch up 1 or two octaves very fast and just mix it in with some soloing. I've even tried this with some basic rhythm stuff which gives it a little more attitude.The Pitch Shifter mode is also very fun... i very quickly fell into the habit of keeping this mode set at one octave down with the orig/efx mix leaning toward the efx... this gives the guitar a very rich, bassy tone. Add a little wah to it and it gets even more interesting. The other three modes, i regret to say, i haven't toyed with very much. I'm the type of guitarist who likes effects that push the guitar sound to extremes. But the manual of course lists a few presets for these modes which i have tried and they sounded great; just as they were described... it's just personally they didnt inspire me very much.Another thing worth mentioning is that some of the functions for this pedal are very clearly suggested to only be used with single notes and not chords. So naturally i had to see what would happen if i played some chords on those settings... and sure enought weird stuff starts to happen. In the case of the T.Arm mode, if you play a chord and then pitch it up it starts to jump around a lot which i found to actually be kinda cool. Once i get that to happen i like to start bending the chord and it gets even more crazy.... add wah, feedback, delay..... you get my drift.Long story short... this is a pedal that you take out of the box and spend countless hours turning the dials every-which-way and trying anything you can imagine. It's LOADS of fun!",
    "Just amazing... there are no words to describe it.Very exciting concert.A concert that shows the rock and roll all times",
    "I have had one of these beat boxes for over a year and enjoy it. It's fairly easy to use and fun to perform on. It's not a \"serious\" instrument but it has capabilities that only a few years ago were costing much much more. The keyboard function is fairly limited and has no performance nuance like touch sensitivity, but it works in a pinch. It also has automated mixing and processing capabilities that took a lot of effort and time to execute a few years ago. It definitely allows non musicians (or non-keyboardists) to jam and create club music. Some of the grooves are very good, but most are pop and sure to sound dorky within a few years - but then again - retro gear will have its own appeal several years hence. Likewise, the effects are what are currently \"in\" in dance production. I like the ease with which effects can be sync-ed to the beat.As to use by pros - it might be a good addition to a DJ to spice up a mix. I am a guitarist, and I have used this unit as a drum machine with a small combo and it sounds fine through a PA. It's a fun jam box, and the price is right.",
    "I probably would have given this a 4.5 if that were an option only because it is a little heavier than expected. But compared to a large four-twelve cabinet, it's tiny an light!I have been playing for about twenty years. And, the sound is excellent to my ears. I am running an old Crate PowerBlock (150w) into this unit. I'm sure I could blow the speaker if I pushed it all the way. But I'm not a a loud player. I normally keep the volume below 90 db. If I was a loud player, I'd probably buy another to take up some of the power. Anyway, this is perfect for what I'm doing.",
    "My husband bought me this microphone to replace a broken mike for my Audiostream AS 222 karaoke machine.It works - badly, so I give it one star.You can't hear anything out of this mike - it's going back to whence it came from. Buh bye!",
    "Quick snap on and off. Sturdy. If it is not convenient, it won't be used. In this case, it is very convenient and easy to use, hence, your prized guitar will not drop to the floor by accident. Well worth the money spent!",
    "The quality control at this company is astoundingly bad. The guitar strings were extremely brittle. The E and B strings snapped the moment they became snug on the peg (not even tight enough yet to reach their respective tunings)! The packs of 2 strings are all labeled according to their supposed contents. The strings were all mixed up. The pack labeled 3rd G and 6th E actually had a 2nd A instead of the 6th E. Needless to say, the other packs also had incorrectly labeled contents. I haven't used Martin strings in many years and am surprised how badly they make these strings. That's what happens when you send your manufacturing dept. to 3rd world countries and exploit their people in the name of maximizing profit.",
    "When I realized my daughter enjoyed playing the recorder in school, I went in search of something a little more sophisticated, hoping to encourage her interest. If you are looking at this set for the same reason, you won't be disappointed. Since she seemed very responsible for her age, I decided to indulge both of us with better recorders than the usual one suggested in school. I gave several to her as a Christmas gift. As a gift, it went over very well. Now I see you can buy them as a set. If you can't afford the entire set, at least consider the sopranino in addition to the one required in class. It is a lovely instrument. And, stick with the Yamaha brand for whatever recorders you buy.At school she caught the eye of another teacher who put together a quartet of youngsters and they would play for fun after school. When my daughter practiced at home, I heard pleasant sounds from her room. She felt special because she was able to stand out from the crowd.Im happy that she's stayed interested in musical instruments. I believe the recorder set helped that to happen. This is well worth the price. She went on to play the clarinet--first chair. And the recorders are still in use.",
    "I bought these because I replaced the woofers in an old set of Sony speakers and they were blowin' away the stock paper mids.These perform quite well. They have an excellent response considering the price point. They get within 98% off much more expensive speakers.Just 1 note that I think applies to all discount speakers. Break them in! Only manufacturers of truly outrageously expensive speakers do a break in.If you don't know what I mean. I will explain.1. Hook your speakers up and set the volume to about 10 to 15% of total volume.2. Let them play for atleast 4hrs preferably 8hrs.3. Don't turn them up to jam level for at least 7days of atleast 2hrs of use each day after break in.4. Once broken in you'll find that any speaker you buy will sound better and last longer than an improperly or unbroken in set.5. The speaker is an important part of the \"motor\" of your sound system. So break them in just like you would a replacement engine in your car slow and easy before mashing the loud petal.6. Never over or under watt speakers and expect them tolerate that kind of abuse. Always choose something with power requirements that match your setup.In closing I'd like to say I only gave this 4 stars Because that's the best your ever gonna get in this price/quality range. Don't delude yourself that anything in this price and or quality range is a 5 star item they're just not. That's okay though. Most of us just don't have the means to acquire 2% better sound for an 800 to 2000% increase in price. Well that's my 2 1/2 cents worth.",
    "I love this drum. We discovered it in my son's baby music class and it is easily the best toy we got him this year for Christmas. The size is perfect for him to crawl up to, or even on. The sound quality is nice and not irritating - like many of the high pitched, play drums. It is even big enough for my husband and I to play while my son holds on to feel the vibrations. The included drumsticks were an added bonus. If you are considering buying a drum for your child, I highly recommend this for any child.",
    "I really do. Love it. Now, if I can just get it to play through my Yamaha DD-65 Digital Drums, I'll be happy with it. However, . . .. . . The Point!!! . . .. . . As for older drivers, if you're using Vista, stop. Upgrade to Windows 7 (which is really Windows 6.1.xxxx). Don't buy Windows 8 (unless running \"ver\" from a DOS window tells you that Windows 8 is really Windows 7.1.xxxx). Microsoft goes through a process of releasing new operating systems. First, they test new concepts, new implementations \"in-house\", using an \"alpha\" version, or an \"in-house test\" version.Then, they often release an \"official\" \"beta\" \"test\" version.Then, they release the actual test version which is version \"x.0\" (where x is the actual version number). This isn't labeled a \"test\" version, but, in reality, it is.This process has occurred starting with Windows 3.0 (which was almost un-useable. Windows 1.0 would only crash. Windows 2.0 never ran well enough to be released in a \"beta-test\" version.). Microsoft doesn't tell us this, but, they allow us--the users--to do the actual \"beta-test\"-ing of their newest operating systems while paying them for the \"privilege\"! Windows 3.0, 4.0, 5.0, 6.0, and now 7.0 (the probable version number of \"Windows 8\") are all, in reality, test-versions that resulted in later, working releases of Windows.Windows 3.1 and--more importantly--Windows for Workgroups (WIN 3.11) were the first working non-test versions--the \"bug-fixed\" versions--the working versions--of Windows 3.0. The same was true with Windows 95 (WIN 4.0--\"public test\" version) and Windows 98 (WIN 4.1, working version) (from memory, I may have made amistake here or there), and Windows Millenium (WIN 5.0 public test version) and Windows XP (WIN 5.1 working version). Microsoft does not tell the public that versions like Vista and 8 are test-versions. But, many software- and driver-writers know this. So, M-Audio probably stopped attempting to develop a driver for problem-plagued-Vista (WIN 6.0) when they got the specifications for Windows 7 (WIN 6.1) and started writing a Windows 7 driver.The moral of the above story is: don't blame M-Audio when it's Microsoft's fault. 'Parenthetically: Microsoft is largely responsible for the present, popular, politically-correct but semantically--incorrect use of \"issue\" when \"problem\" is the proper word--issues and problems often occur with a one-to-one correspondence, but, an issue is something you discuss whereas a problem is something you fix. This MS-attitude (MSN=Microsoft Not Working) goes back at least to when Microsoft refused to fix their problems with WIN 4.0 (Windows 95) making WordPerfect 6.0 run improperly until after they made sure that Office worked properly on WIN 4.0 (with the result the WordPerfect lost a lot of sales and Microsoft gained a lot of sales). Per Microsoft's behavior: it was \"WordPerfect's 'issue', not Microsoft's problem!. My first recollection of the misuse of \"issue\" for \"problem\" was in Visual Studio 6.0 (circa, approx', 1998) documentation.",
    "I'm a novice at using notation software, and I've found Finale to be very easy to use! I just sat down and got started, and within moments was successfully creating music and having fun. I may not be a professional engraver, but my needs were many, somewhat unusual, quite specific, and I'm VERY particular. Even if I didn't immediately find what I needed, it didn't take long once I turned to the thorough on-screen guide. The one time I did seek assistance from Finale support, the guidance I received was fast, thoroughly helpful, and completely professional. I'm VERY pleased with this product!",
    "I would recommend these to anyone who owns a QChord. It really enhances the experience. EAsy to use and easy to play along with.",
    "I just received this alto saxophone today and played for awhile. It has a beautiful tone! I have been playing soprano saxophone for years, so I have some experience with saxes. This alto sax seems to have good workmanship combined with a beautiful appearance. I did a lot of research before buying -- I didn't want to spend too much but didn't want to waste money on junk. I think this horn was a really good choice.",
    "I bought the Hum-X a couple of weeks ago as I had a buzz in my keyboard set up. It did cut it down, but it was not drastic. Recently, our mid-life crisis Chicago Tribute band was playing a function in a hotel banquet room. I turned on the monitor power amp and had a really bad 60 cycle buzz. I pulled the Hum-X from keyboard power strip and put it on the power amp plug and the speakers were silent. Buzz completely gone. Well worth the money. I'd love to see them come out with a power strip (multiple plugs, perhaps 6 or 8) that performed the same function."
]