[
    "I got this magnetic base along with a separate dial indicator here on Amazon because I needed to tune up my table saw. I didn't want to spend a ton of money because I didn't see myself using this set of tools all that often. However I didn't pick the cheapest model either, because I wanted something decent. I normally don't write reviews, but my frustration with this product has pushed me to it... so here goesWhen I opened the package everything looked OK for the most part. I should mention that no instructions are included, which might be a problem for someone who hasn't used one of these before.As soon as I set the base up I noticed that the main post was loose and wobbled around quite a bit. No problem there, just tighten the nut at the base of the post, which i did, then noticed that the post was slightly bent. It may have been banged about during shipping a bit, but I wasn't too worried at this point because it didn't wobble any more even though it was a little crooked.Next I got my dial indicator attached to its mounting post and played around with a bit, rotating it this way and that. The swivels on the unit move well enough but they don't tighten down smoothly. Basically things slip around up until the point they are completely tightened. This can be a pain because it makes it hard to make fine adjustments with the base attached to the work surface and the indicator in place.Anyway at this point I got my saw taken apart, set up the base and indicator, got everything aligned and attempted to tighten down the knob on the main post. The weight of the indicator kept causing the collar to slip down the post, so I kept incrementally tightening it. Before it was tight enough to hold the weight of the indicator and extension arm assembly the collar fell apart. The bolt had completely stripped out. Now I have no idea what kind of steel they used for this particular bolt, but it died on the very first use, and I hadn't even tightened it enough to hold the dial in place. Needless to say I will be sending this back.Amazon is great for so many things, but sometimes you need to be able to hold a product in your hands before you purchase it, especially when it comes to tools. It really seems like tools are made to be disposable these days, and this particular item isn't even good for a single use. Since I wasn't able to use it I'll have to make the 2 hour drive to the closest place where I can get another magnetic base so I can finish my project. At least this way I can check the quality before buying it.",
    "I do a large amount of kitchen cabinet work. This tool is superb for setting cabints at the right heighth. Verry easy to use. Too bad it was made in China",
    "Unfortunately (or fortunately, depending on how you look at it) I needed to use this brand-new plunger the very day I received it. I was pleasantly surprised by how easy it plunged, as my old one required a lot of muscle to operate. After the plunger had done its job, I was really appreciative of the self-opening and closing storage pod. No muss, no fuss...just how I like it!!",
    "I made a target backstop for back yard plinking with air rifles. To keep the neighbors from complaining I needed to shoot towards my house. I stared with a 3/4 in ply wood but it was not enough for my mid powered rifles. Next I went with a double layer of plywood which was ok, but I wanted something more. So I purchased this item and mounted behind the plywood. It was easy to drill the screw holes. It is plenty thick enough. Now I think my back stop could handle .22lr from 25 yards. I can't really test this thou with out having the police knocking at my door.This stuff is thick enough for air gun silloute and field targets.",
    "This lightweight, easy to push vacuum is the best. We're had others, good quality vacuums, but they were too heavy for us. The Oreck was recommended by a sales man at a store which sold some vacuums, but did not have this one to demonstrate.",
    "I bought this caliper hoping to measure in inches OR millimeters.... (isn't that what it was supposed to do??) Well, it does measure inches, BUT if you want to get an accurate measurement in millimeters FORGET ABOUT IT. The metric scale is there but the dial is not calibrated - and the needle is not geared - for use with the metric system. 1.125 inches - no problem ; 28.45 millimeters - good luck!",
    "Nylon Flat Washers, what else can I say? They are flat made of nylon and have a hole in the middle.......",
    "What a bargain? This product allows me to make high resolution measurements in multiple directions. It has a digital readout that switches from US to Metric redouts, and is very durable stainless steel fro an excellent price.",
    "came quickly in great condition. My husband loves it. I got it for him for Christmas and he never leaves home without them. Uses them for work.",
    "I was looking for a quick release pin for a special project to be used on my Motorcyle. I've done several searches for products from various vendors/companies that make this stuff. There are just so many choices and sizes. Jergens just happens to make the sizes I wanted in stainless and aluminum without me needing to do a custom order. Got these in and they blew me away with their quality. I've bought some other quick lock pins in the past but they could not hold up to the applications I was using them in. These do a great job and also look good as well. A little pricey but worth it. For my application their strength is more than sufficient and everything else is a bonus. I ordered 2 and it looked like they came from different vendors since the packaging was completely different, but the items in the packaging were identical. Recommended if this size fits your application.",
    "Well made, not super heavy duty, but will do the job I bought them for, specifically tree felling and other chores around the homestead. Worth the price and I expect them to last for quite a long time. Which is why I bought two of these. The fact that they are made in the US played an important part of the decision.",
    "I, like many others liked the price. I own 8 Zip Wall poles and figured the 3rd Hand product would come in handy should I need more poles to create a barrier. I must state that my main reason for purchasing the 3rd Hand contractor pack was to aid me in a crown-molding job. I liked what I read about these units and it seemed like they would fit the bill with the square feet and all.I will start by saying that the company must have had many complaints with the poles being used to put up plastic barriers. The box that mine came in show several different uses for the poles in line drawing form. The picture of the poles being used for plastic barriers was covered up suggesting the possibility that they received some grief from Zip Wall, or customers frustrated by the attempt to use them in place of Zip Walls.Personally I find the 3rd hand product quite heavy and cumbersome to use for supporting plastic sheets. Especially when trying to get them up to 9 & foot ceilings! I had to use duct tape to get the plastic that high. Second, after I jacked the pole up onto the main tee and moved onto the second pole, the first pole came crashing down behind me as I jacked the second pole a little too much causing loss of tension on the first. OK so the 3rd Hand failed to please me on plastic barriers on tall metal grid ceilings. Onto the next project.For crown molding, the 3rd Hand is just that. They performed as expected. The slanting feet and square top plate kept the poles where I placed them. Laying the crown molding on top of the poles was a learning experience. When installing a 16' length of crown, you must place your ladder in the middle of the length so that you don't tip the center pole over or as in my first attempt, the 2 middle poles. Very noisy when they hit the floor. Once that lesson was behind me the rest of my 3rd Hand experience was non eventful.Back to grid ceilings, the poles are nice for jacking up the grids to help in leveling and also holding fluorescent fixtures while replacing grid work on wall relocations. I also used all four poles to raise the ceiling enough to slide a completely dry walled section to a new location 4 feet away without getting hung up on the ceiling grid. Just had to be careful the all the poles had the same tension on them.I agree with most other posters about the button problem. Very difficult to get them pushed in to raise or lower the pole. Raise the pole too high and you can't reach the jack handle. The solution there was to turn to pole upside down just to avoid readjustment with those button locks.The weight of all four poles in the bag is amazingly heavy. 8 Zip Wall poles are half the weight and being all aluminum well balanced. The tension mechanism on the Zip Wall units is a pleasure to use over the 3rd Hand unit. In all fairness, Zip Wall poles are not very good to use for crown molding and too light to use for holding grid ceilings up. Each of these poles has their place. Used on a regular basis it is best to use what each one was designed for, or be aggravated by the lack of compatibility that each system exhibits.I too have the same complaints about the storage bag being a few inches too small and lastly, would somebody please tell me what all the different bushings on the large plates are for? I'm still trying to figure out how the large feet attach. O NO! Not the directions!!! Still confused, I love my Zip Wall poles.",
    "This glove is made rugged and very durable. For a winter glove it keeps your hands toasty even in the coldest Pennsylvania winters. I have owned many other brands including some of the more expensive military work gloves, with varied and limited satisfaction, however the Youngstown Winter Plus glove, has for it's affordable price and quality far surpassed my expectations! I LOVE THESE GLOVES!! Most the guys in my troop have these gloves and are very pleased with the performance, wear and durability. An A+++ in my book!Frank",
    "After reading the other reviews, I was torn as to what to do. Was this a genuine product or a knock-off that wouldn't work well with my Oreck. Having only a few days to finalize preparations for a house full of Thanksgiving guests and having used my last vacuum bag, I simply chose to \"take a chance.\" As with everything I purchase from Amazon, the bags arrived very quickly; and to my delight, they were exactly as described. They were perfect, fit the vacuum, and were of substantial price reduction from other sources.",
    "excellent price and good delivery. the item will be used to seal pyrex glass tubes used for a solar boiler to create steam.",
    "Not bad quality overall, but having a conical point on the end defeats the function of a true bottoming tap in a blind hole.",
    "I can't find a single thing to complain about. Hoses fit snugly enough that a couple turns on a hose clamp is all you need to form a good seat, but not so tightly that you can't get the hoses back off without feeling like you're going to rip them apart.Very good adapter for those having tools with the 1-1/4\" dust ports.",
    "I really like this product. I looked for it or something similar and could not find something in the local stores. It arrived promptly and was even better than I expected.",
    "I recently bought two sets of these from two different company's. Both sets are junk and are going back.The quality of these are not the Brown and Sharpe of the past. The advertised (Parallel within +/-0.0002\" - paired +/-0.0002\") is not true. The 1.5\" pair has deburred edges that has been done with what looks like a deburring buffing wheel. This has left the locating surfaces with rounded over edges. Also the the height difference betweenthe two is .020\"(this is not a typo) and not +/- .0002\". I can by cheap China made stuff that is a lot better.Do not waste your money.",
    "I have 2 of these large shower caddy's in each bathroon. One I can put up high to keep my kids out of so they will quit wasting my shampoo and one lower for them. We moved and they were easy to remove and take to our new house. Another great thing, if it gets a lot of soap build up you can remove it from the hooks and is safe for the top shelf of the dishwasher. They have lasted me years, think I've had mine for at least 6 years and they have never fallen, not one of them, and I put our family size shampoo and conditioner bottles on them, one on each side. They have survived my children so I think they are great.",
    "No problems so far, everything was as described! I'd definitely recommend it to anyone! The price was good too! Definitely a good buy!",
    "The gripper grabs the top of sheet goods as promised and has a comfortable grip. Unfortunately it is still easier to carry a sheet from the bottom with a $7 Stanley panel carrier.",
    "I ordered this to replace a piece of aluminium which was corroding badly due to the environment it was in, I have cut a piece off, painted it white and put it into service ... We'll know how corrosion resistant it is in a few years !",
    "I use this with a small room fan - it lets you \"dim\" a fan instead of a lamp - works well. The control is not as fine as with other (older) westek dimmers that I have - guess they don't build 'em like they used to. But this is half the price of those older gizmos and it does the job.",
    "I ordered this Maxwell caliper - at a very good price from an Amazon proprietor - to replace a flawed but higher priced Frankford Arsenal caliber. The previous device, even when calibrated, consistently had overestimated known .30 and .40 caliber diameters by more than 2/1000's, no small mistake for my needs. This item appears to be the same product, battery compartment cover and all, as the Frankfort. The difference - this works perfectly and accurately; complete with an installed battery and a spare. It is tight, easy to use and read - perfect for reloading.",
    "it's kind of cheap because it mostly plastic but it definitely is a good purchase for the price . Works well for purpose.",
    "This Dual Lock creates a great bond for even heavy things. I was using it on my guitar pedalboard with decent success. One warning though: the little mushroom / fingers are VERY easily bent just by pressing on them with your finger (for example: trying to stick down the adhesive to a surface). They deform and don't move back into place. If your application isn't semi-permanent, you are better off with another type of (more durable) velcro.",
    "The thing works spectacularly, I couldn't believe how little shavings there were on my work table because of the dust collector. I was shocked because the planer was attached to about 10' of 4\" hose on a 1 hp dust collector, so my expectations were pretty modest. Instead of having to sweep up half a trash can of shavings they were all in my dust collector! There were a few shavings that kicked back on the infeed side of the planer but that was all!My only complaint was the directions, or lack there of! There was nothing in my box other than the dust collector chute and two knobs, absolutely no directions. I went to the web-site and that was fruitless. I tried several options to install the dust chute and nothing seemed to make sense. Until I removed the plate over the cutter blades and realized that the dust chute replaces that cover and allows for dust collection. It took seconds to install once I made this discovery. The point is they could have had a simple one page direction and possibly the red letter warning lable about the cutter blades that is on the factory plate. But then I would have had to rate the tool as a 6 on the five point scale! If you own a dust collector and a 22-560 planer this accessory is a must!",
    "These rollers were an exact fit for the worn out rollers on my 1960's era glass sliding shower door. They work great.",
    "Alpha particles tend to seep through the gaps, so buy two rolls and overlap it quite a bit for a good radiation-free seal.",
    "For an inexpensive refractometer, this tool has worked very well for me so far. I would recommend this piece of equipment to any home brewer.",
    "i had one ''hot room'' in my house. we have hot water baseboard convectors to heat each room. i used this product to tape some of the convector covers in the hot room. this procedure effectively solves the problem of the hot room and it makes my heating system run a little more efficiently as well! i am comforted that this item will not produce any safety concern as it is designed for hot applications. finally this product is good because it is easy to work with and the glue on the tape is just right!",
    "These were a total waste of money, and they were NOT cheap either! I re-decorated my son's bedroom as a surprise. Since we had just spackled and painted his room, I didn't want to put a lot of nails back in the wall to hang things. I was so thrilled when I found these; however, they did not work AT ALL. We tried hanging VERY light things(using mulitple hooks, mind you)without any success for more than a day. After multiple attemps, I said forget it because I knew that something I was attempting to hang was going to end up falling and getting broken with these useless hooks. Furthermore, when they fell off, they took the new paint with it! Not only did they not work, but they were NOT damage free. I ended up using small hanging nails in the end, which was what I was trying to avoid in the first place by buying these. These were a complete waste of time and money, and also damaged my freshly painted walls! NOT HAPPY!",
    "I found this product while searching for something to organize my phone headset and the USB cables for my cameras, phone, etc. I stuck several of them to the side of my desk and everything now hangs neatly without getting tangled. When I wanted to move one, it came off really easily after I read the instructions.",
    "haven't really had a chance to use them very much but they seem to do an ok job cutting glass.",
    "Strands will loose their shape quickly, should be shorter or better quality.",
    "This is great for sealing molding after painting for a professional, finished look. Unfortunately, my local hardware stores have stopped supplying it in the store. Thankfully I can order on-line and have stocked up for my next projects.The handheld can allows for better precision and application. What a great product.",
    "Works great especially for the price. Chews through my oak cabinet doors in seconds. I done about 20 doors and it is still tearing it up.",
    "The Moto Foot Pedal is a efficient complement for Dremel rotary tools.Precise and well manufatured. Good buy.",
    "Ordered the Starrett straight edge for the quality and from Amazon for the good price and free shipping. I will be using this to setup guitar necks and frets and other straight edge duties as needed.Delivered in perfect condition and in three days!I would purchase this item again if I ruin this, and as anyone who works with close tolerance tools , drop it once and back to the store for a new one!",
    "Was not hard to install and it stopped my 2000 lb wench from playing out when under load.",
    "Its very handy to have Canister Vaccum cleaner.It so good looking and very good in cleaning the hard surfaces and woden floors.As my house is wooden floor one i feel this is great tool to have.The look is good and so is the performance.I like that way the cord pulls iteslf in.The power cord is big and is very handy to move around the house.I feel the sound is bit more,but that is okay with me when compared to the other Vac's I have used earlier.It think this is a geat value for the price.",
    "Works ok for some items, but not for others. You have to be careful because if the product does not hold up (i.e. holds up for a while but eventually falls down) you can damage whatever it is you're hanging.Thankfully, I hung my stuff up on a carpeted area so my frame was not damaged when it fell overnight while I was sleeping.Can't really recommend since it does not perform consistently. Might as well put a nail in the wall and dry plaster over it if you want to be sure. Otherwise, you may find wall hangings permanently damaged.",
    "I was very pleased and satisfied with the price,availability of the product,the ease of ordering and the efficiency of arrival. I will continue to order from this company!!",
    "The screws worked fine... as good as the ones Kreg sent when I bought the pocket hole jig stuff. The price is seriously better than if you bought atthe big-box store!",
    "I have given up on all other countersink bits besides the three-cutter Wolfcraft jobs with the tapered pilot bit (shown here). Used separately as a pilot, or in combination with the countersink, these are precise, don't \"walk\", stay sharp, and the countersink part is easily re-sharpened with a stone for added mileage. Great tool at a great price.",
    "If you work with electronics this is something that's great to have around, this stuff works very well and holds like no other even metal to metal on wires. It still allows current to go through the wiring as well, and I haven't had any problems with it smoking and smelling weird with current going through like I have other cheap glues.",
    "I've had this brace for a year and while it's worked for me I don't believe it was worth the cost. I'm not saying it's poorly made. It is actually quite sturdy and beefy. But I've used Stanley braces that are $25.00 cheaper and they are just as good if not better. On the whole it is a quality tool just a little pricey.",
    "Length:: 0:51 MinsI needed more space in my shower but I didn't like the ones that hang in front. Chrome types usually leave nasty rust marks so I decided to go with this one after the great reviews. I haven't needed to change the strips yet.",
    "Waited a year and half to review this vacuum cleaner.Works well enough for stairs and cars. There are better units out there.",
    "I bought this to remove a screw from a door. I'd tried lubricants, heat, manual removal, electric screwdriver and nothing worked. This liittle tool removed it in a few seconds - I couldn't believe how easy it was.",
    "I wanted a shoulder strap for my weedeater and leaf blower, and I decieded on trying this one. Fully extended, it is the perfect length for me. However, I'm 6ft., and if I was a little taller I dont think the strap would have been long enough.",
    "received in a timely manner.pice was right. ready to start all my projects. will do business with this vendor again.",
    "I bought this set for the range of sizes that it covers and the increments of sizes.It should cover any size that I need and comes in a compact set. Easy to include in your driver set for those unusual applications.Well worth the few dollars to know that you are prepared.",
    "Glad I found this here, I looked everywhere locally and was not able to find anything similar. Great product.",
    "I purchased this set because I needed a bold extractor set. Problem is that I've tried to use it now on a half-dozen occasions - all were unsuccessful. All it did was make the worn out screws involved having a bigger gapping hole. This set has not worked for me at all - but you don't know until you try it.",
    "These are great and really hard to find at any local hardware store. Now I don't have to cut off any more extensions! :-)",
    "I purchased these for myself because I spend so much time in my shop working on woodworking projects. I sand a lot with a hand held sander and the vibrations are very hard on my hands. These gloves have helped very little and lasted about 2 hours before the seams started opening up. I would never purchase them again. Very unhappy with their performance.",
    "These are basic, Made-in-China Forstner Bits. I agree with the others: they do the job...not great, but certainly serviceable, especially at today's price of ~$15.I have uploaded a few photos since there were none before. Worth noting:Pros: a nice plastic case and assortment of sizesCon: the low quality of manufacturing [see pitted cutting surface]Overall rating: a decent buy for general use...not for the high-end work, though.",
    "Have used the gloves about three times in the yard, cutting and pulling pines and shrubs. Gloves worked great. Some of the growth hard thorns like rasberry bushes and I was able to grab and pull out by the root without and problems. Also made it easy to get a good grip allowing me to pull out by the root more than just cut at the root.",
    "The drill bits appear of reasonable quality except for the fact that a good number are not well aligned with the hexagonal base - there is a very annoying wobble in at least 5 of the bits I received in this set.",
    "I only received the calipers a couple days ago but already they have proven to be a great investment.The entire unit feels sturdy and well made. I can't tell if it's steel or another hardened metal but it does not feel like aluminum. The display is very easy to read w/ large numbers. My only complaint is the display is constantly flashing the numbers while it's active/powered, which is slightly annoying at first. Otherwise, all of the button options (scale/zero) work wellThe plastic case is great for protection when not in use. The only issue was I had to trim out a slight corner of foam to get the calipers to fit properly.I am certainly glad I went with the 12\" versus the 6\" Avenger. You never know when the extra capacity will help.Overall - GREAT DEAL!",
    "I am a Radiology student and needed a skeleton for studying anatomy. This skeleton is great, it has very fine detail on all the bones. It's a nice height / size, would highly recommend.",
    "Since the grab bar keeps sliding off, I found this awkward to use. I purchased the higher end Milkwaukee 49-22-8510 right angle tool instead, and that one has a grab bar that is much more secure and practical to use. Although this one is smaller for the super right spots.",
    "Heavy gauge chrome plated tool to accept a 1/2 \" breaker bar. Very useful PROVIDING the four holes are the proper indexing for the vehicle on which it's to be used. For $10., 'ya couldn't make one for that. A word of caution: this tool will ONLY FIT the EARLY 1.6 engines. Will NOT work, nor can it be made to work on the later 1.8 engines.",
    "We are using this product in my class. We count them and sort them and the kids just enjoy playing with these bugs! Sturdy and yet not hard. Really bright in color.",
    "This capacitor is one of the best capacitors I've ever had. My dog Lassie fell in a well and the Packerd Capacitor - 25 MFD at 370V was there right away to pull her out. Another time Packerd pulled 14 nuns out of a burning school bus. Highly recommend!",
    "This is by far, the worst forstner I have ever owned, It dulled immediately and diamond hones fail to bring it back.",
    "Mitutoyo 505-675-66 0-6 Dial Caliper .0010 .100 #I am very satisfied with the usability and being able to read the dial.",
    "I used this to make custom cooling air ducting for home entertainment devices in a hot cabinet. The plastic scores easily with a utility knife and after a few passes with the knife you can break it for a clean, straight edge. Straight edges are critical for butt joints. I used Ambroid ProWeld to join all parts, and after they set for a few hours I had cooling ducts that looked and held together like they came from a factory and belonged on the devices the were cooling. Highly recommended!",
    "With the winter approaching, I knew I needed something to seal those drafts around the window. I didn't want to cover them with plastic insulation as it doesn't look nice. I decided to try this instead. I was so impressed with the ease of use. went around several windows where I felt drafts. No more drafts and it isn't even noticeable.",
    "I listened to the other reviews and ordered large size instead of my normal medium... Glad I did! Large fits me great, and these gloves feel right. Not too bulky, but sturdy and flexible.",
    "I just found a container of this that I used a few years ago stashed away in a toolbox. It still hasn't dried out and the lid came right off like it was a new container. It's definitely worth getting this over the cheap stuff.I would easily recommend this if you're sick of using a tube of super glue once and then not being able to use it again.",
    "These gloves are perfect for use on the farm. All my research for the best winter work glove paid off with this purchase. I bought another pair as a gift. I'll be recommending these gloves to anyone who works in cold wet conditions and wants to keep there hands safe and warm.",
    "these are very high quality bits, they are sharp and they stay sharp. I notice they have a very steep angle to them which means that they attack the material rather rapidly.",
    "These bits were fine for utility work but when used for any finish work.. (i.e. mounting hardware or trying to drill w/o going all the way through) they are too hungry for the wood. The larger bits don't actually drill through the wood so much as drill into it like a screw. Even when being extra careful to apply light pressure the drill was twisted out of my hand as the bit tore through my workpiece. while drilling through some Maple Plywood drawer fronts the bit pulled the workpiece up off the table and out of my hand leaving a large chipped out area of veneer on the face of my piece. I also wasn't impressed with the pilot point, the bit still walked. Nothing beats an awl or center punch for accurate drilling",
    "This lift was a lifesaver for me. Used it to set 4 stone caps on columns, and I simply could not have done this without the lift, or three helpers. The long ram hydraulic lift has way more vertical range than I expected, and the winch added a lot of fine adjustment, too. Heavy duty, good quality, appears to me more flexible than the ones I saw at Harbor Freight.",
    "Well constructed, complete kit and easy tool to work with for mounting our sunscreens. We recommend this to attach your shades.",
    "This is a nice bit set all except the quick lock for the impact driver only worked well for about a week and now it is sticking and not locking the bits in even after lubricating it.",
    "I've had this thing for 4 years now, using it as sort of a central vac for my garage. Works well enough, but the motor burned out after a couple of years and luckily it was still under warranty.I'm not sure if I'd buy it again.",
    "These will wear out........soon.The tips of the fingers wear out faster than I you'd expect on these gloves. They should make the finger tip material more durable, but that might hinder the good dexterity that these gloves have. And the fit is better than most.I also like that the palm is free of needless layers of \"protection\" and cushiony stuff. The grip panels on other gloves actually make it harder to get a good tight grip on tools and handles. A thin clutter free palm is best.The cuff is also too short........my wrist bone sicks out just above the edge of the cuff, just another 1/2 inch would make a difference, but another inch of cuff would be a great addition to this standard line of gloves.I like the all black/monotone......the big white logo version is too gimmicky.",
    "I used this after re-flowing Xbox 360s and Playstation 3 consoles and I will say that it is of very good quality.",
    "This was perfect, and at a great price. I drilled it to accept sheet metal screws to attach my ground radials. Excellent.",
    "The item broke after 3 uses. It seems to be quite fragile...needs to be made of a stronger material.",
    "I picked this up for a broken strap on my laptop bag.I like the padded portion but the strap is too bulky.It would be better if the connectors could swivel, but they don't so it makes it a little too awkward to use.Had to get a different one after about two months.",
    "Granted that handling prunings from fruit trees is a stress application for a work glove, but I was still disappointed that a seam in a finger failed on the third use. Nice fit, very comfortable, but I'm not going to buy another pair.",
    "Well, I don't know what I did differently, but I bought this one and the larger version (with the soap are in the middle) and the larger one started to \"lean\"... though it didn't fall off the wall. This one has worked perfectly so far, but I'm betting if I put even a little more weight in it, it might start doing what the other one did.very convenient though, and there's really nothing else like it",
    "Coverage was superb. We did not follow all the directions, such as patching the concrete, we just painted the divets. We're in an apartment and just flooded, and really didn't care about the gouges. Just needed a floor replacement and this was faster than what the apartment manager wanted to do for us.We ripped up carpeting to put this down, so there was considerable work involved, but it only took about 6 or 7 hours total from start to finish, not including dry time. This is a latex-type paint and does peel around the edges if it sticks to the tape at all, so use a razor blade when removing tape from the baseboards.Coverage was great. We opted not to use the paint chips as we thought it was a bit too 'desert cammo' looking for a bedroom. We waited the full 24 hours after final application to move furniture back into the room, but even being incredibly careful, we still scuffed the floor in a couple of places. Thankfully it's a scuff and not wanting to peel more like the baseboard areas are.I would use this product again, however, if I were needing something in a pinch.",
    "Fantastic and inexpensive way to clean your espresso machine. Will last forever. Just keep it dry and cool.",
    "I'm a little concerned about the quality of this hand drill, but I haven't really put it to the test yet. It's definitely not up to the standards of my grandfather's, but that's the way things are any more. For the price, it's probably a pretty good value. I'll update when I give it a good workout.",
    "UPDATE: After almost 2 years, we had a septic pumped this a.m. No problems re fat/grease or anything else that could be attributed to a disposal. In fact, there was a problem w too much liquid in the tank. The septic man said it would rectified by rinsing the septic filters every 6 mos. SO I say the InSinkerator passes muster! Definitely keeping the 5 star rating. The only thing that I wonder about is that the BioCharge does not go down very much and we've had same bottle in for 4 mos+. We replaced the one before it because I thought there might be something wrong w the container since that one was going down at such a slow rate, too. Anyone else have this same experience w BioCharge? It seems to be adding just it needs to dissolve or act on the fats/solids though because, as I said, there was no problem reported, and it had been TWO years since we last pumped.When we remodeled our kitchen a year ago we had the Insinkerator Evolution Septic Assist installed. We had lived 20 years without a disposal because of being on a septic system. Unfortunately, we did not read the instructions to the disposal and did not realize we had to replace the BioCharge - I didn't even know there was anything to replace. So last week we ended up on a Saturday having to call the septic pump people because of a clog in the pipe. The guy showed me all the grease and food gunk causing the problem and said a disposal cannot be used w a septic system So we decided we'd been sold a bill of goods and were not going to use the disposal anymore. Then, I thought I might as well look at the instructions for the heck of it and now have ended up here. After reading the positive reviews of other septic system homeowners, I am ordering 4 BioCharges, with plans to use them over the year, then have the septic yearly pump-out and see the results. 'Sure don't want to end up having to pay $500 to get unclogged again.I will post again after the year has passed with the outcome.A question: I was wondering if you who have had good experience follow the directions exactly on putting the food into the disposal - ie running cold water first, then slowly feeding food in, then running more cold water, etc?PS Because I had to rate this to submit my review, I gave it a 5* based on others reviews w similar situations to mine.",
    "I just finished a 700 sq. ft. tongue 'n groove ceiling project, and used multiple boxes/grits of the Mirka product. Much cheaper than the typical DIY home store pricing, and if you have a large project like I did, you'll save big bucks. These are high quality disks that get the job done.",
    "I had purchased 8 of these hard inverted mantles from American Mantle, but when I tried to replace 2 old mantles I had in my outdoor gaslamp, 1 of the new ones I just purchased crumbled when I took it out of the box and another would only light on one side. I have ordered from this vendor before and of the six I had previously bought, 1 would not light at all for some reason. I don't know if this company's stock is too old, not being stored/handled properly, or just lacking in quality control, but caveat emptor.",
    "First time I used this type of drill. It drilled through SS sheet metal like butter. I am very impressed for sheet metal work, no wandering, very smooth cut and fast.",
    "Overall great product, sealed cracks and is working great. Easy to apply and use. Only drawback was that I was expecting a deeper tone with the Almond color. Possible that my color scale is different but was expecting something a little darker in tone (outside of an almond) then this product (inside of an almond).",
    "I thought I would never get the stains out of my carpets and upholstery,that the kids and pets had left behind. Well I was wrong! Thank you C&D.",
    "My Dad had one of these. I borrowed it so much I finaly bought my own. This little shop vac has lots of power.The only thing I don't like about it, it has no bag. It can be messy when you empty it.",
    "These things rock. If you off road/camp and want to mount your Shovels,axes, tools, whatever to your racks or bumpers these take care of it. The grips hold on tight. The material is very strong.",
    "I guess most people would use a drill press cross vice for their drill press. I decided to buy the parrot vice and adapt it to my drill press because my press is radical and has many ways to make adjustments. The parrot vice is somewhat unique and I bolted to my drill table and turned it on its side to get more room between the bit and the vice. I would recommed this as a vice I don't think you should hammer on the jaws but it is a good lighter duty vice and it would be good to also use for woodworking.",
    "Truly great gloves used them right away to test them out,flexibility etc. These are great and if they wear out I'll be back for more. Plus a sweat wipe are on the thumb area of the glove truly awesome",
    "I am a construction contractor who gets paid by the project. This very inexpensive tool is well worth its value. The ease of driving and speed of reloading had it paid for by the end of the first 10x10 room I drywalled. I am a tough man who enjoys working hard, but driving only one screw at a time over and over is too mundain and costly for me.",
    "WE USE THE WATER RESISTANT STRIPS TO HOLD LIGHT WEIGHT THINGS IN OUR SHOWER. THE FIRST SET WE BOUGHT STAYED ON THE WALL FOR FOUR (4)YEARS. TO BE IN WATER I THOUGHT THAT WAS AMAZING!",
    "I like my Shop-Vac #9254510 a 10 Gallon Wet or Dry vacuum. However I wish the ad would have told me that the unit had a 2 1/2\" hose set-up rather then a 1 1/4\". Could have saved me some $$$. Also if the unit had a drain valve on the bottom of the tank, it would have been nice!!!Thanks.",
    "My son has used these before and they are great. This particular model was a bit misleading as it only comes with one container of gel so you have to purchase two to use the connection tubes.",
    "Well my son will be 2 in a few days. I got this when he was about 22 months old. He has found alot of ways to use this WITHOUT the board. He stacks them together to see how much he can stack, he rolls them, and he throws them. No problem with me. At his age, he still has alot of experimenting and exploring to do. I point out the colors of the pegs to him also. So this item could be used in many ways. My 7 year old daughter now, she actually uses the board. She made a table, and she made a few letters. The peg board comes with an activity sheet with different things you can do with your kids like sorting, color recognition, patterning, counting, addtion/subtraction, memory games, and making your own designs. I'd say its a pretty good investment.",
    "Order a size bigger if the unlined fit you snug. The lining takes up some space, especially in the fingertips.",
    "I have been looking for this for years! Finally, the perfect thing to put in the trunk of my '64 Chevy Malibu!",
    "These are the gloves I like best for outdoor work. They fit well - and are not clumsy like some older style gloves are. The one disadvantage that I have noticed of knit-fabric gloves like these is that thorns (like from rose or citrus trees) can go right through them (ouch!) if you are not careful.",
    "the gloves were very useful for about a month then they slowly ripped at the fingers and just constantly got worse from there, all i was doing was planting flowers and placing mulch.",
    "This skeleton is very detailed for such a small model. Its a great buy for this price and it was much better than I had expected.",
    "Needed the wrist cuff to keep debris out along with an adjustablewrist strap for snug fit and easy-on, easy off.Wanted a fabric like leather for duribility and comfort withtextured grip palm pads for better grip, extra wear and durabilityAlso, needed the half finger design for complete fingertip dexterity.",
    "Playtex is one of the very few companies that makes reasonably priced rubber gloves in a size small. I bought my first pair of these gloves at a Walmart several years ago. They lasted me until earlier this year when my shepherd mutt puppy got a hold of them. (They probably would have lasted many more years otherwise.) I looked everywhere for these gloves and finally bought them on Amazon. They came in perfect condition and have been well used since. They fit perfectly, and the interior is lined with sort of a soft fabric. They make all of my cleaning much easier.",
    "These self centering hinge bits are great for installing hinges. The nightmare is that by using a regular drill bit, it jumps and makes a hole that is not truly centered. When installing the tapered head hinge screw, it stands up above the flat of the hinge. Then you can't close the hinge properly. The Solution: Get the General Tools self centering hinge bit. The tip is a cup fit, so you are sure to get a perfectly centered hole with the included drill bit. Their are two different popular sizes, and for this kind of money, it pays to get both.Great tool for the money. Highly recommended.",
    "I have used these many,many times in furn production with excellent results.I was surprised at how fast these arrived...excellent price...great product that REALLY works I'm so glad AMAZON CARRIES THESE NOW",
    "We live in a small condominium, without adequate space to hang damp clothes. This handy device has been placed in a bath tub stall. It doesn't depend upon spring tension to hold it in place, but rather a screw extension system. It leaves no marks when removed and easily holds a whole load of damp clothes without slipping or bending.",
    "This Stuff Works Great To Tape On Things Without Leaving Alot Of Resadue Behind. You Can Take The Tape Up And There Isnt Anything Left Unlike Grey Electrical Tape For Example",
    "Works great will buy again. Its not cheap tape that tends to melt n gets all sticky, its pretty thick too",
    "Good weight and easy to change out blades. Was very happy with the heft and feel of the handle. Easy to clean.",
    "My star rating is 3 since it seems like a nice product, however it only works with fans rated 120 V Max 5 Amps. Since I have the 2400 which is 13.8 A it won't work. The installation instructions are very complete and easy to understand. Just doesn't support my model.",
    "My boyfriend and I moved to our new house and saved a ton of money moving everything ourselves thanks to this product. Moving the major appliances was easy. I would have given it five stars if there was some sort of non-slip padding around the shoulders. I found quite a few times during the move, the shoulder parts crept close to my neck and it was a bit uncomfortable.",
    "I am new to welding and checked the previous reviews about these gloves. All I know is during my practice welding session I was holding a piece of flat iron in my hands for quite some time and then set it down. I looked and noticed it was glowing red (I was not holding it at the red portion but just below it). I felt NO heat in my hand. These gloves are durable and protect your hands amazingly well.Pros:+ comfortable+ fits mid size to large hands well+ quality construction+ made in the USACons: (minor)- color comes off easily on the finger tips with alot of use.Overall these gloves are perfect for your welding jobs.Thanks for reading my review.",
    "I was surprised at the quality when I received the caliper. It is sturdy and very easy to use. The digital display is easy to read and it seems to be very accurate. The extra battery is nice also.",
    "Very well made gloves hold up well for just about anything.The knuckle guards are a big help in tight spaces and can kinda double as a fingernail.klein always makes good hand tools at about double the price they are worth,nice if you've got the money but if your hands aren't constantly bleeding you don't need these.",
    "While I needed protection to prune and weed between my Pink Fairy Roses, I really bought these gloves to use for clipping my barberry shrubs. I was easily able to pick up the barberry remnants from the ground and did not get pricked by the barbs once. There is enough movement through the fingers to easily pick things up. These gloves do run small and I was glad to have read the review pointing me to buy the large size.",
    "Great price and value for original Shop Vac accessory. Shipping was free and very timely. I highly recommend this item and supplier to anybody looking for accessories for their Shop Vac. I got my Shop Vac for Christmas and will look here for future needs.",
    "I have to move small boxes of medium weight around the house, and being a senior with moderate lumbar spinal stenosis, noted the worst part of this work was picking up, carrying, then setting down these boxes. This \"personal hand cart\" is ideal for this job. It comes completely assembled: remove from shipping carton, open and start using.It is only for small jobs....personal items only. You won't use it for loading a moving van. It is compact, and will fit in that cranny between the refrigerator and the wall, or will stand alone inconspicuously if you don't prefer to collapse it. The side bars collapse into each other when you squeeze the top handles. It is very easy to use. Pull \"up\" on the bottom support, and the wheels rotate inward to close for storage. All in all a nifty gadget.",
    "Great item, get as many as you want online vs local store with minimum stock. Just as described, with good metal construction and ball bearing swivel.",
    "Exactly what I was looking for!! Fit my pegboard perfectly! Nice size nice shape! All pegs were identical and perfectly made! Would order these again when i need more!",
    "My wife wears them when she works in the garden, and she is very pleased with them. They are getting a realy workout..",
    "We use this for homeschooling to enhance our geography and history lessons - my 8 year old daughter runs to the globe after learning about a particular country or city, grabs the interactive pen and spins the globe to locate the location corresponding to our studies. She then listens to the countries language, capital city, National anthem, current population, current ruler and currancy etc. and enthusiastically enjoys the process! We keep it updated and current by connecting the pen via USB cable to the internet which allows the pen to upload the current statistics.We are not sorry we bought it and we have not encountered any problems or difficulties using it.",
    "Just got the tool today and it is junk! Did not work out of the box. Changed the battery like the instructions stated and the zeros on the display. Instruction stated to pull the cover, but nothing as to how to pull the cover without breaking it. This tool will be in the dumpster.",
    "We have 14 affordable housing apartments sites and our maintenance men are constantly moving large and applicances and furniture. These straps have not only made their jobs easier they have cut down on back strain and employees out of work",
    "Until know I did not use this drill set but on the box are missing some drills. I do not remember if is 4 ou 5. Because that I give 3 star.Remember that this stuff was made on China.WagnerBaltimore-MD",
    "This fine sanding screen does a great job at not only removing the spackling, but it also does not leave any scratches.",
    "This set is as you'd expect. Everything works as advertised.The case isn't a nice as I hoped, but hey, I didn't buy the set for the case.",
    "I was surprised to have so much flute on this drill bit. I think it's fantastic, it will last a very long time after sharpening and re-sharpening with so much flute. Drill bits usually don't come with any extra even for the length. I'm very pleased. It runs true which I was pleasantly surprised!",
    "We got this item to do some major housecleaning and after a few minutes of use, steam and hot water came out of every seam of the handle, not to mention the handle became too hot to handle. This company is just asking for a law suit, I would hate to see what happened if someone tried cleaning their drapes and had hot steam and water come down on them after 10 minutes. You're better off cleaning the \"old fashioned way\" than to use this piece of [junk].",
    "Seals like a champ. Although, trying to get in a well ventilated area while you are trying to seal everything is a bit hard. And believe me, you NEED to be in a well ventilated area!",
    "The name of this product, Maasdam Pow'R Pull 8050 Wire Grip, is self explanatory. However, I was impressed with how solidly this tool is built. My guess is that it will handle forces well beyond its ton and a half specifications. Amazon's pricing was the best I could find anywhere.",
    "What with the nuclear arms race in Iran and all the other woes our world faces today, one can't have too much uranium stored away for the future. Here, it's a pretty affordable price, so I don't have to put up with price-gouging from black-market sellers anymore. Thank you for such a quality product at such a reasonable price!",
    "Bought the wife a Roomba Pro Elite for Christmas ( I'm the romantic type!) She's letting me play with it. First reactions: It's a high tech toy, not bad for a first generation product. Cheaply constructed, so I question it's longevity. Doesn't run very long on a charge and charging time is long. So I think it's good to invest in a separate charger and extra battery if you can spare the bucks. Small capacity particle bin so needs frequent emptying. Needs a fairly clean room to begin with. Surprising how much it can pick up in a supposedly clean room. Best on hard floors, but can handle short-nap rugs but not fringe. Doesn't get stuck as much as I thought it would. Overall it does the job and I like it.",
    "I rarely comment on the tools that I buy, as I try to buy the best and expect them to be good. I use tools every day in my remodeling and cabinet business and this set really surprised me with its' quality and thoughtful layout. It is easy to see that someone put a lot of thought into how these bits and drivers were laid out in the superb case. The whole set feels and looks like the highest quality of steel and construction was used throughout. The case holds all of the pieces firmly but not so firmly that they can't be taken out and used easily. The case is compact and has the feel that it will last a long time.Now to the selection of bits and drivers. There seems to be exactly what is needed for the drilling and driving of screws and hex fastners. The quick connects are of superb quality and work easily and with positive action. There is a great set of hex drill bits that go from 1/16\" to 1/4\" by 32nds to 1/8\" and 16ths up to 1/4\". Included is a tool to drive screws in difficult places that looks to be very usefull. A more than adequate selection of phillips and flat bits are supplied and arranged to be really easy to use. The pictures of this set ,while good, can't relay the quality feel of it all. I can't recommend this highly enough. You can spend your money knowing that you will get great value for it.",
    "This device seems to be fairly well constructed and works perfectly. I connect two monitors to one CPU and for this, it is exactly what I need.",
    "This folding cart is just what I needed to help me bring my wares in and out of craft fairs. It's easy to use and folds for storage. I used to drag a heavy duty dolly for the same purpose but this makes the job much easier. I especially like the retractable handle. This is a great item for anyone needing a helping hand for light weight things. Recommended.",
    "Perfect replacement for the shop-vac 6060. Much more heavy-duty than the dry only filter. Appears to be just like the original (and maybe even better).",
    "great product even the can its in is for my convenienance! i can see if i need moor.",
    "These screws are fine for diverse household works on wood using to drive them a powertool. They sufficiently meet what you demand and the price is low.",
    "This kit is great for the handyman. Has most of the bits you will need for general work.",
    "We recently completed our dream kitchen remodel, which included carrara marble slab countertops. The stone yard that did the fabrication and installation promised that the stone had been sealed prior to install but within a week of getting our new counters we had several large oil stains. Needless to say, we were pretty irritated. We ordered this, left it on for 48 hours, and all the stains are GONE. We then resealed them withStoneTech BPSS12-32 BulletProof Stone Sealer, 1-Quartand since then have had zero problems. So relieved we were able to restore our expensive marble and protect it from future damage. This brand may cost more than some sold at big-box hardware stores but it is SO worth it.",
    "It held big wreaths on the stucco wall throughout the Christmas season and now holds up my coat in my office.",
    "Now this is a great tool and the price was less than any other I checked out....works great.....",
    "I bought a pair of these gloves a year ago and wore them out, went back to where I got them and they no longer carried them. I went online and found them here, too bad they don't ship to Canada, but I have a brother in the States where they were shipped to. Best work gloves I've ever had.",
    "Got these today arrive on time and in perfect condition. BUT be advised these are like a brad point bit which makes me doubt the ability to work in metal, but time will tell if they will cut metal well, especially if it is more than 1/16\" thick, Will revise this after I have used them. But for wood they look great, easpeciallt for the $9 they cost after discounts and free shipping............",
    "This is a good light duty winch. I mainly use it on the travel trailers when I need some extra oomph to get something up on the trailer, so save your back some stress and spend the money on a portable wench like this one.",
    "If you have a convertible or two, you need to get a roll of this stuff. When your top gets cut, it may be a day or two till you can get it fixed. This stuff will keep the rain off of the take-out.",
    "Great quality sandpaper, the paper backing holds up well, when you flex or fold the sandpaper it doesn't crack or tear easily. I buy in 50 bulk packs to save money.",
    "I just ordered this, and while the receiver is made in the USA, the d-ring is stamped China (the Amazon photo shows a USA stamped d-ring). I called Warn to verify, and they state that all of their d-rings are now made in China.For the price it would be nice to see a full USA made shackle bracket, but the quality of this is still better than the previous CSI shackle I had.",
    "Agree with previous reviewer (Samuel). Current gloves are the Black/Grey/Yellow ones, instead of the Black/Grey/White as pictured. Gloves work very well with the silicon gel pads. Palm pads are sized to not *frumple* up when the hand is balled into a fist. Been using the gloves chipping and scraping concrete on concrete with SDS-max rotary hammer with a bull-point and 3 inch wide chipper. Helps greatly in reducing vibration fatigue in the hands and arms. Outside the silicon gel pads, the gloves have very limited protection against hard bumps and bruises from smacking hard, solid things like bricks and wooden posts.Purchased this more for the anti-vibration function and not sure how sturdy it is when cleaning up concrete debris. Using this pair as a tool glove rather than a cleanup glove. Just feel that true pigskin can handle scruffs, slashes, and stabs much better than non mil-spec composite materials.",
    "Since I am not a \"tool user\" so much, I asked my fiance what he thought of these, and he absolutely LOVES this kit! He thinks I paid much more than I did, this is a must for any \"handy\" guy!! Great deal, and highly recommended!!",
    "its easy to use and easy to clean. It is also safe for my teen to use. Simple and effective.",
    "There are nicer versions of these and you can definitely tell the difference in quality. However, this model will do the job just fine and at a fraction of the price.",
    "I have not recieved This meter (Astatic 600 --5000 watt swr/power meter)--so I can't say much at all,jus send it to me",
    "This magnet, though very strong, is too small to cover much ground. I wanted to use it where old lumber with nails had been burned in a pretty large pile. I should have paid more attention to the dimensions given for the product than I did to the pictures. It is difficult to remove small pieces of steel from the magnet because of how strong it is. I should have bought a larger magnet than this one. I feel sure that this magnet would work fine for uses other than mine.",
    "Very good quality filter....I use this to vacuum out our wood-stove, and it has held up very well. It still works, even after it is clogged. If you blow it out, or throw it around outside, you can re-use it over-and-over.",
    "If you use dowels for woodworking, these are as good as anything you might find elsewhere. If not, you won't care.",
    "I bought this foil tape to do some duct repair on my HVAC system. It seals the ducts perfectly and is very easy to apply. The foil tape is paper backed, so all you have to do is peel off the backing and apply. A Great product!",
    "Ordered on the 21st of March......placed in back-ordered status the 23rd.....due April 1st.....Should have gone to Home DepotShop elsewhere",
    "they are excaclly what i wanted. i practice playing quad rugby its a wheelchair sport and we need a good strong rubber coted gloves to push our chairs and we go thew them alot and these worked out perfect for me.. i can see them workn for many purposes big thanks to the sender",
    "Bought these considering Nicholson a quality American made product - Received them and they are made in China. As I will be using these professionally, we'll see how they hold up. Can't give them a bad rating just made in China alone, but if quality falters - I will adjust accordingly!",
    "I used these in our camper, and even though the wallboard is slightly textured, these Command Hooks seem to have a strong bond. I allowed the adhesive to set for 24 hours as directed before adding the hook. I've had my belts hanging on them for a few weeks and they've held up perfectly, even with the temperatures rising over 100 degrees inside the camper when it's not being used. The only problem to be aware of is that the hook is only as strong as your wall covering...it will adhere to the paint or wallpaper, but if that paint or wallpaper happens to not have a strong bond with the underlying wall, it will pull off.",
    "My son asked for these gloves since he often bikes to work and Seattle is wet! He was delighted to get them.",
    "Now I'm not an expert because I used it once. It pulled my chain link fence together and that is why I bought it. I should've gotten (or made) a fence stretcher bar to do this job right. It did the job. The price is why I bought this model as it beat out most others on that feature. I may never need to use this thing again but if I do just a few more times it has already payed for itself. I had one job to do and didn't want to spend much so this one did the trick. It was easy to use following the included instructions. It seems a solid piece of equipment. Made in China, isn't everything?",
    "One of the legs was stripped an took a lot of the excitement out of this product. Grandson wanted to use it right away but due to the poor quality of the legs, he could not try it out. It was quite a disappointment.",
    "I bought this 35mm boring bit to increase the depth of the hinge holes in my cabinet doors for a new set of Euro Style hinges I bought. I was able to use this boring bit with my DeWalt hand power drill without any problems.",
    "I bought several of these hooks with hope that they would be able to support the weight of two large wreaths (approximately 10 pounds each). We had just remodeled our office and could no longer use the over the door hangers we'd been using for years. We were hesitant to use these hooks because we did not know if they would mar the new finishes in our newly remodeled office...we had no choice, so we risked it. And I am happy to tell you that two of these hooks mounted three inches apart held a holiday wreath up for five weeks on both a finely-finished, walnut plank mounted on marble and also on brick veneer mounted above a fireplace. I removed the hooks last week and they did not mar either surface...BRAVO One note, follow the install and removal instructions to the letter, they are spot-on.",
    "I bought these gloves for mountain biking. They work well and fit great. Knuckle pads are awesome. Only problem for me is they are thick so they take away a little of the fast finger mobility needed for braking and shifting on the bike. I'm sure they'll work awesome in the cold riding but during summer its a bit much; but not enough to make me stop using them.",
    "I work as a metal artist and there are many times that I need to mark a piece of metal stock to cut or rivet and I do not want to use Dykem for any one of a number of reasons. The problem I have had with the 'regular' masking tape is getting it to stick reliably to the metal I need to mark. The 2060 adheres wonderfully to my metal, staying fixed until I take it off. It sticks so well that I am able to tape large parts of a project together before I start assembly making sure parts fit as they should.Every shop would benefit greatly from having a roll or two of this around - a very easy product to recommend.",
    "The items was original Powerwinch item, not all marine retail locations that sell the winch sell this item,This review is more about how great Amazon is than the item, the item is great, I found it on Amazon and it was shipped to my door in a few days.I had to replace the original item when I used the handle to assist the winch motor and realized to late the handle contacted the plug and cracked it.",
    "Just be aware that this thermometer is ONLY for monitoring the internal temperature of your BBQ or smoker, NOT of the items being cooked.I failed to read the \"fine print\" and had to return it. It probably works well for that limited function although Maverick, historically, has a problem with the cables of their meat probes not withstanding BBQ heat.",
    "Most workgloves are not very flexible or if they are than they are not tough at all. This one is made from a special material, which is flexible, breathes but at the same time is flexible. If one is working with potentially hazardous materials or power equipment, saws, paint sprayers, etc., this is a great value in an insurance policy of sorts. This is an excellent product at a most reasonable price.",
    "The glue dries up too quickly. I purchased them for my mother who makes jewelry and I purchased about 5 of them and by the time she got to the second one (about 4 months later, the other tubes were dried out, We have found another product that does not dry out and works very well.",
    "I have a couple of these. They are great to keep in my vehicle for all those times I used to wish I had a dolly with me. It's light duty, and I have definitely pushed it's limits and it did okay. Very happy to have this tool in my vehicle.",
    "I loved these gloves, they fit my XXL hands just fine and provided good flexiblity and protection. I recently used up my last pair and ordered a bunch more only to find out they have been extensively redesigned.If you liked the Orginals these are no longer them. For one thing they fit much tighter and I would be surprised if they actually sized much more than a XL even though they are selling them as XXL. The long and short of it is that I returned them due to sizing issues. Based on the XXL sixing I would say to order a size up if you want a good fit.Other changes include changed closure and fabric around the thumb and index finger. I do not know if these changes are good or bad as I have not used them but feel the changes to the closure which is now much thicker plastic are bad.Can someone recommend a good glove in XXL to replace this brand.",
    "I use this to seal gaps in the a/c unit outdoors and it is absolutely the cat's meow! Looks good too when applied.",
    "I got this set for $19.99 plus free shipping. This is worth every penny and the bag alone is probably worth $20. Great quality set and bag.",
    "For a fast and clean hole, these bits are truly a pleasure to use. I bought these as replacement bits after my other Irwin Speebor Max Spade Bits went out on permanent loan. :) I am a repeat, happily satisfied customer of these long lasting bits.",
    "The shop-vac I purchased is one of the smaller ones for little jobs around the house. I believe it came with a one inch diameter hose and attachments. Well I soon found out that I was unable to handle the bigger jobs around the house because every time I tried to vac up leaves and stuff, the darn hose would get all clogged up?So, I bought the Shop-Vac 2.5 inch deluxe accessory kit and now I couldn't be happier! I can now do the bigger jobs around the house without always having to stop and unclog the hose. It also helps shorten the amount of time it takes me to do these jobs since the shop-vac can pickup more stuff quicker since the hose is bigger!Now that I have the perfect Shop-Vac accessory kit, I really need to purchase a larger capacity shop-vac so I don't have to stop working so many times to empty out the shop-vac. Oh well, live & learn....lol",
    "You might think finding a double-pully would be easy with Lowes, Home Depot and a host of smaller hardware stores in/around Philadelphia. It isn't.The company shipped the pullies rather quickly, with normal shipping.This item has a 400lb capacity and works really well for block and tackle configurations (you'll obviously need 2 or more to set up a block and tackle). I used these pullies to hang boats/kayaks from the ceiling of my garage. The pullies are well constructed, rugged and have lubricated bearings.",
    "I purchased 2 of these storage caddies for both of my showers off of Amazon (I searched all my local stores, and they didn't carry these). I read the reviews before I purchased it and was pleased to see all the positive feedback on this shower caddy. I think it's the perfect size shower caddy. Mine also came with an extra hook for holding your washcloth, or body wash poof. Instalation was easy. You need to let the tape set a day before installing the caddy to it. I've owned this now for about a month and haven't had any problems with it. I highly recommend this!!!!UPDATE: I have now had these up for 2 YEARS & They are still holding on strong! :) I highly recommend these shower caddies for extra storage room in your shower! GREAT BUY! Don't waste your money on the suction cup versions!",
    "basically the drill bits were slow to burr through 1/2 inch plywood and then a doug fir 2 / 4, and two of them snapped without much effort. At least they were cheap",
    "These boots are sturdy and perfect for outdoor activities like gardening in the Pacific Northwest...Not stylish necesarily, but met and even exceeded my needs. Delivery was quick and besides the initial \"rubber\" smell (which dissipates with time), I am completely happy with my purchse.",
    "we live in earthquake country, so we were looking for something that worked and was easy to install. the Quakehold did both and we are very pleased and hope we really don't have to use.",
    "came with a case, dropper, wipe, and the calibration tool and best of all it has a Brix % reading!!!!!!!!!",
    "Large washers with small holes like this product are handy to mount thing to a wall where the location has to be adjusted. It provides a margin for error.",
    "This thing holds quite a lot of weight. I own this model and the other, slightly smaller one, and they both reside in my shower. I really like this and recommend it highly!",
    "OK.. Lets face it. A broken bolt or screw is a pretty bad place to start out. I bought this set along with a more expensive bolt remover design. Neither this set nor the more expensive bolt remover design did the trick. I was able to remove the bolt the old fashion way... by drilling through the entire bolt which takes time, effort and patience. Had i just started out with this remedy in mind, i would have saved money, time and wasted expectations. While the design of these tools may work well enough on paper... they certainly did not work on the metal embedded bolt.",
    "I have used similar Norton disks before and decided to try these because it looked like a good deal. However, while these Mirka are slightly cheaper than Norton, they are no-where near the quality --- Norton last 5 times longer than Mirka.",
    "I used this stuff to water-proof some outdoor, low-voltage electrical connections that really were not supposed to be outdoors. It's been about 5 years now and everything still works fine and is sealed just fine.",
    "I've bought all the sizes of these 3m command hooks and none of them have let me down. I used these to hang small belts in a wardrobe, and small picture frames on the wall.",
    "I will buy it again. I use it all the time and would recommend it to other woodworkers. I like the pre marked cut lines on the back of the sandpaper.",
    "1/8\" bits are used for all sorts of jobs and we go through them a lot. This is a good pack to have in the truck. They don't walk and work well in metal at slow speed or soft or hard woods. Individually priced too expensive this pack makes a great cost saver.",
    "The sizing is labeled 5-8 years old and made of solid cotton, no plastic tips for the fingers. They will be just fine for my girls to help me with the vegetable garden. I recommend this product.",
    "I read a lot of reviews before purchasing this and even though it had a broken clavicle (one end that was glued came unglued) it was still worth the money. Helped me make an A in kinesiology and anatomy college courses.",
    "I bought it to use on my dashboard in the car. I'm in the Seattle area, not a terribly warm climate and any of the velcro exposed to direct sunlight on any given day just wrecks any sticking ability it had. It just makes a mess of things. Need to get something better for this use. Used indoors works as it should.",
    "My wife wanted a Rubbermaid scraper just like the old wooden handle scraper she has because the old one is a bit worn. It took awhile doing research online but I think this is the same product except for the handle. The lowest temperature rating gives the most flexibility and that was what she wanted. So this product worked for me; actually my wife. She wanted 6 of them and would have prefered that I had gotten different sizes but I didn't find out about the size thing until after the fact. Of course it was my fault because I forgot to ask. Oh well... In 10 years after these wear out I'll try to remember to get different sizes. :)",
    "This shop vac works great. I find it somewhat difficult to change the attachments, but that I had the same problem with my Kenmore.I like this shopvac better thannmy Kenmore. It has more attachments and does a better job.I highly recommend this product.",
    "As this has no insulation it is obviously not intended for extended winter use. It does have a little cushioning in it but not enough to get excited about. I know this sounds lack luster so far but I have used these gloves for two or three weeks with no complaints. They seem to be sturdy, durable, and fit as well as a leather glove of this type should be expected to. If you're looking for something that is going to fit you like a second skin, this isn't the type of work glove you need to be looking at. If you're looking a good all pupose glove then these will do.(UPDATE) I have had and used these gloves almost daily for months now and they have held together while doing everything from chopping/stacking wood to carrying stone to simply raking and shoveling. I stand by my original recomendation, for the price you're getting a great pair of gloves.",
    "I had a tiught time trying to purchase traffic cones from local stores and wasted an afternoon at this task. The two cones purchased through Amazon are outstanding in every way and were priced right.",
    "I have purchased two of these so far, they break really easy if you do not close the lid just right. The igloo cooler is top notch but the latch, they need to go back to the drawing board",
    "***EDIT 7/9/12 12:00 PM***Well, I posted this review a couple of hours ago, and also notified Amazon about the issue. Within about fifteen minutes, they issued a refund on the shipping charges, escalated the issue immediately with their shipping department and have a representative monitoring my order until it arrives on my doorstep. All I can say is, WOW! That was definitely not the response I expected, and was very impressed!***Original Review***This is the first time that I've used the expedited shipping option to update my shipping option from 2-day Prime shipping to 1-day shipping, with an additional upcharge. I ordered this product pretty early (08:27 AM Pacific Time) on the morning of Thursday, July 5th, so that it would be delivered by Saturday afternoon at the latest. Here's the actual tracking history (with local cities removed for privacy)July 9, 2012 07:52:00 AM XXXXXXX CA US Out for deliveryJuly 9, 2012 07:48:00 AM XXXXXXX CA US Arrival ScanJuly 7, 2012 05:01:00 AM XXXXXXXXXX CA US Arrival ScanJuly 7, 2012 03:35:00 AM Memphis TN US Departure ScanJuly 6, 2012 01:14:00 AM Memphis TN US Arrival ScanJuly 6, 2012 01:07:00 AM Indianapolis IN US Departure ScanJuly 5, 2012 10:03:00 PM Indianapolis IN US Arrival ScanJuly 5, 2012 09:47:00 PM Indianapolis IN US Departure ScanJuly 5, 2012 07:26:00 PM Indianapolis IN US Shipment received by carrierJuly 5, 2012 09:50:50 PM --- Shipment has left seller facility and is in transitAnd details of the order:Date: Thu, 05 Jul 2012 08:27:01 -0700 11 of 127From: \"auto-confirm@amazon.com\" &lt;auto-confirm@amazon.com>Subject: Your Order with Amazon.comShipping Details : (order will arrive in 1 shipment)Order #: xxx-xxxxxxx-xxxxxxxShipping Method: One-Day ShippingItems: $12.12Shipping & Handling: $3.99------Total Before Tax: $16.11Estimated Tax To Be Collected: $0.00------Order Total: $16.11Delivery estimate: July 6, 2012 1 \"Cold Rolled Steel A513 Drawn Over Mandrel Round Tubing, ASTM A513, 0.75\" ID, 1.25\" OD, 1/4\" Wall, 12\" Length\"Misc.; $12.12In StockSold by: Amazon.comI'm actually really disappointed, and pretty irritated that I paid extra for what is now four days (not including that actual order date) waiting for delivery on a 1-day shipping item. Granted, this is the first time that I have had any issues with an Amazon stocked item, but four days for next day shipping is definitely not OK. This was a rush shipment and it actually arrived at a shipping facility note once, but twice in the early AM and sat there over night before it was processed again.",
    "This is a great all leather sandal. Very comfortable and perfect fit by size.",
    "My brothers had mohawks in school (early 1960's)and I had alwayswanted one but being a girl my parents didn't see any light in that request. 40 years later and going through chemo I finally got the chance to fulfill my long inquisitive desire. I had an old wig which I cut from front to back, trimmed it, sprayed it and there it was, my mohawk. Now I had to have something that would adhere to the wig and my scalp without irritation, would not leave a sticky residue, would not tear my wig or my scalp up, and at the same time be comfortable. I tried two sided tape, scotch tape, electrical tape, packing tape, you name it. Then I saw the duct tape by the A/C unit and bingo, I had my mohawk. Not only am I enjoying this but family, friends, co-workers, and complete strangers are enjoying it as much if not more. Thanks to DT",
    "I just wanted to comment on this \"not-walking\" tip that it advertises. I just think about that frequently while the bit is walking around.",
    "I have searched far and wide for these replacement strips. I love the 3M hooks so I use a lot of them. It's always a problem to find replacements because stores either don't carry them or they are expensive. I was really happy to find this package on amazon!",
    "perfect quality.not enough quanity for me but you have too order te grits seperatly if its a big project.",
    "Lighter weight than the metal. Will never rust. Easier for the servicemen to empty. They are neater to use and transport to service areas. Four uses per month and greatly appreciated by all.",
    "I bought them for work on my boat. They are useless you can't even drill a hole in aluminum... Sorry a returner...",
    "I left my bike chained in the rain for a few days. Unsurprisingly the lock to the chain began to rust on the inside. This caused it to be extremely difficult for me to unlock my bike. I read online that 3 in 1 oil can help fix my problem. So I applied and a generous amount onto the lock and let it sit overnight. And voila! The next morning it worked like new. Great product",
    "PURELL Sanitizing Hand Wipes Individually Wrapped 100-ct. BoxGreat product, everything arrived ahead of scheduled. Great will definitely to business again.",
    "Worked great and smelled even better. Used on my wool carpets and wool couch; dried quickly and left no residue. Also left my carpets nice & soft.",
    "These calipers are cheap but well constructed. I use them for measuring proportions while sculpting maquettes between 5\" and 1'. For this purpose I have been quite pleased. While I wish the action was faster than the knob allows - it's quite rugged and for the price - a solid buy.",
    "was a really nice replacement strap, i use it on my valpak suitcase. it is good, strong sturdy material, and the clips seem well made too.if it were to break i would get it again, no complaints",
    "While this is a very powerful vacuum it has a design defect verified by the service representative. The wheels on this vacuum - and the replacement vacuum we received - do not turn on their own. Only when you physically move them will they work. This is a wonderful product if you wish to utilize the shoulder strap and carry it. Otherwise this becomes a very recalcitrant puppy that you have to drag along and scratch your wood floors. This is best on a carpet as there is no problem dragging it. We would suggest its cousin for less money the Eureka which we understand from the service center does not have this design defect. If you opt for the professional product the service center suggested placing large heavy duty rubber bands on the wheels - which did work well. We suggest purchasing a large amount of these rubber bands as they do not last long. Happy cleaning!",
    "These brass balls make the best presents! Buy a few today and make those difficult gift giving occasions easy. I'm not kidding. Seriously folks. I was skeptical at first so I only ordered a few. When they arrived I could hardly contain myself. These are without a doubt some of the finest brass metal balls I've seen! I was so impressed I ordered a ten pack that day. These make great presents for all occasions, birthdays, Christmas, Father's Day, anniversaries. Make your special day all the more special with a brass ball, or two!",
    "I had difficulty finding one to hold my y shape ironing board. This was works perfectly over the laundry door to help keep it organized.",
    "I wont say these are the best drill bits in the world, but they are good and get the job done. I have found another brand of bits that are perhaps a little better and somewhat cheaper, but this set makes a nice addition to my collection, and the carry case is well made and offers great protection to the bits and easy bit storage.",
    "I'm so glad you have this to sell! I can't find it in stores in my area any more. It works great on floors and in laundry and our family seems to have healthier winters when we use it. Please keep making and selling this product!!!",
    "This is a nice hand cart for light loads on flat surfaces. I tried using this to move some medium weight boxes up the stairs to my car but found it flimsy & too small. The wheels are so small I had to jerk it up each stair. It was easier to carry the boxes individually. Good thing I didn't get rid of my standard size hand truck even though it takes up too much space in my hallway. I would not recommend this hand truck for people who need to seriously moves things up & down stairs.",
    "This cleaner is great for freud blades and any other blade with a coating. I used to use simple green on my blades, but after a while, the red freud coating was wearing off because of it, with this cleaner that no longer happens. Will buy again soon!",
    "I have parrots and it was a lifesaver for cleaning cages. It broke after 4 months! The electrical just stopped working. I would not recommend for this reason. It did get me hooked on using steam or vapor and I wish I had bought a larger more expensive cleaner. I wish I hadn't wasted $100 on something that lasted 4 months.",
    "I don't know how I am going to get this crap off the table top and laminate. It doesn't make the laminate stick to the table - you know, the whole point of contact cement...Flour and water paste would work at least as well as this crap...",
    "MSA makes these filters to go on their masks which keeps particulates out of your respiratory tract. The are three general levels of filtering: N95, R95 and P100. The latter keeps 99.97% of all particulate aerosols out. Notice that these are the P100's.Elsewhere on the 'net, you can find these filters for $3-$5 for a 2 pack. This pair costs over $5000. But I can tell the difference between these and the lower priced pair because I think they have aluminum foil or a plastic bag in them to keep any air from passing thru the filter. This keeps air and thus, any bad stuff from entering your lungs. You just have to take the mask off frequently to breathe. Make sure that you run to a safe place before you breathe tho.Additionally, these filters come with a welder in a gray sweatshirt and green suspenders to tackle any welding projects that you may have. He's most comfortable with metal tubing. Be advised that you have to supply the welding machine and rods.Overall, I'm happy with my purchase. Just know that these filters don't last forever and you will have to replace them eventually. That goes for the welder, too.",
    "the pad fit perfect on my sander and I been using it with no problems i will recommend it who ever needs the same pad.",
    "I purchased this tape in both silver-white and blue versions, 2 in x 15 ft. This tape is very easy to cut to shape & size with a scissors, peel the backing off, and stick to items you want to be more visible at night. Adhesion is very strong.This material is prismatic retroreflective sheeting, which is superior to the older technology of tiny glass beads (like what you see in Scotchlite material). The older glass-beaded material is good, but this prismatic stuff is newer technology and is much brighter at night. It is made with tiny pyramid-shaped prisms manufactured into the sheeting that reflect light back to the source at night. Great for visibility to car drivers at night. Prismatic sheeting is the kind of material most states and cities are now specifying for brand-new highway signs these days.I am a bicycle commuter and wanted to enhance my low-light visibility for safety. I cut strips of this tape and applied them to my bike and my bicycle helmet. It worked out great. The silver-white is really bright when light shines on it at night. The blue is also quite visible, but not as loud as the white. My bike is primarily blue, so I used both blue and silver on it. Rolls of 2 in x 15 ft go a long way for this kind of project - I got my bike and helmet outlined like I wanted with the two rolls and still had leftover tape in both colors.",
    "These are the only gloves I'll buy. It's hard to find them other than online, but I was stoked to find them here. I work outdoors events which means I'm lifting a lot of things (plywood, boxes, whatever) and these things are very durable and cushioned in all the right places.",
    "This product really \"takes the weight off\"! You can movethe heaviest, most awkward items easily and protect yourback and body from injury. Try it you'll like it!",
    "Out of the box of 5 belts, 2 had failed within a few minutes of use (tape holding the belt together came apart) Contacting 3M resulted in a fast reply but they just passed the buck to Amazon.comAmazon.com did nothing to help me other than to waste my time discussing the problem on the phone. I will never buy 3M sanding belts in the future as I need quality/reliable sanding belts",
    "I use these for basically everything that requires gloves, i have 6 or so pairs of these and they are all amazing",
    "The drill bits were an excellant buy. Finding this size locally was difficult but Amazon had them.",
    "If you expect it to be shipped when you place the order, don't bother. Although the product was what I expected, it took nearly a week to be shipped after the order was placed.",
    "After going to school for Strategic Studies and Political Science, I knew I was destined to become a World Leader. What I also knew was that the amount of pot smoking I have done in the past would certainly come up in some CIA file. After looking over some old college papers I remembered a way I could become a world leader without having to do so in the US. I thought about taking over a small South American country and knew all I needed was a small army to do so. But there is only one catch, I couldn't find the funding! I knew if I could find an item like my brothers in Iran, to blackmail the world that I could be in an better position to fulfill my dream. Thats where the \"Uranium Ore\" comes in. The ore is sent in a very pleasant packaging that is easily transported throughout the world. In fact I had an entire shipping container filled with the \"Uranium Ore\" sent to me from a very friendly operator. Their customer service understood my plight, making it a point to follow through with a call three weeks after the \"Uranium Ore\" arrived to insure its success! My investment in my dream was affordable like nothing I had ever seen.While getting a shipping container filled with \"Uranium Ore's\" may not get you to have your own country, what you can bank on is that your uranium will be Top Notch. I ordered it, and now I am sitting pretty laundering American drug money in my South American banks. I have also taken the advise of my friends in Bolivia and will be allowing farmers to grow coke plants legally. Then I will be able to funnel the drugs to the US, all the while creating a network of Private Rehab facilities, in order to profit from the influx of my drugs. While the US will be unable to come into my country because of my container of \"Uranium Ore's\" I will be sitting pretty being driven in my motorcade of Bentley's with spinning rims and women in G-String bikinis. Maybe I will even get a picture with former US President Bill Clinton...",
    "I ordered these because I use Krazy glue quite a bit and it's getting expensive, so I figured I save a few bucks! Well, you get what you pay for........... Two of the five tubes were almost empty when I opened them, only 2-3 drops in each. So, I ended up opening a third tube to finish the job I was working on. There was plenty of glue in this tube. However, the glue is SO thing/watery that when I turned the tube down towards my project the glue just poured out everywhere without even squeezing the tube! It ruined my project and ended up all over the place including my fingers. What a disappointment and a mess. The only good thing I have to say about this purchase is the glue works very well - it took over an hour to get it off my fingers",
    "PROs:- Great overall protection for my hands during Airsoft games- Good Design- Awesome padded protections in critical areasCONs:- The color is in khaki and NOT Cayote Brown as advertise!!- Quality of the velcro is not MIL-SPEC in my opinion, doesn't provide a very secure lock.- The same size (8) \"Mechanix Original Glove\" fits my hands much better compare to this one.",
    "This caliper is adequate for occasional use, but I would not use it for anything requiring \"professional\" level of use. It's worth the price I paid for it at Amazon.com. Note that it is SAE only and does not show any metric markings.",
    "Can't really complain or rave about a shim but just so people know these do the job. I guess some shims can be flimsy and splinter but these are sturdy. Unfortunately I didn't notice how short they are. My last batch were something like 12-14\" long, these are 8\" -as it clearly states- but I was in a hurry. Oh well, I used them for my cork flooring install and my kitchen cabinets. No problems.",
    "Bought these to use with my Milwaukee 6021-21 Random Orbit Palm Sander. These sanding pads work great and last a long time.",
    "I purchased a 4 oz. bottle at my local hardware chain store. I used it for two repairs at one sitting. It did not hold a slightly separated sole on a pair of sneakers. I thought this would be a simple job but the \"gorilla\" was more like a little pet monkey. However, the glue did work well in the other repair. I understand that no product is made to perform its best on all surfaces so I give it an average grade for performance since my admittedly limited experience yielded 50/50 results.My problem lies in the extremely short shelf life. After just the one use described above, I sealed the bottle per the instructions by squeezing out all of the air before tightening the cap down. When I tried to use the bottle for another repair 2 months later, the entire contents had hardened. I called customer service and they told me I should repeat the same process of removing the air before tightly capping the bottle but this time, I should store the bottle upside down so that any possible hardening would remain at the bottom of the bottle and the useable glue would be accessible at the tip. Thinking this was a fluke, I bought another bottle but this time it was the 2 oz. size. It sat in the original box, upside down on my home office desk. When I needed it about 10 weeks later I opened it only to find another useless hardened mass. The factory seal had never even been broken yet Gorilla Glue had screwed me again.I reluctantly give it even a one star rating. I don't care how good the glue MAY be if it dries up so fast that you only get one use per bottle or in the case of my 2nd attempt NO USE AT ALL? Unless you plan to use the entire contents (or at least a good portion of it) within a couple of weeks of purchasing it AND at one sitting, don't waste your money! I've already thrown out two bottles of Gorilla Glue and one was never even touched. I won't be buying a 3rd.",
    "After sliciong the end of a little finger off, will not let this happen again. Ordered two different pairs to try, these were one of them. I like them both. Keep a pair in my camping box, and in my home kitchen.",
    "I've used this product for years, but am having difficulty finding it in local stores. I just took the mildew off my entire stucco house with only 6 gallons and saved allot of money. If you can stand the smell, it's fun to watch the mildew fade in seconds right before your eyes.",
    "This product is of very good quality and was very helpful in moving furniture to a new location. I received it quickly and would recommend it to others.",
    "These are truly the best work gloves I have ever used! I have pretty small hands (size 6 1/2), and the size small gloves fit perfectly. I love that they are so thin, they allow me to have good dexterity while still providing protection and warmth for my hands. Provided, they are not the warmest gloves, I would recommend adding fingerless gloves over these gloves if you are working in freezing temperatures. I have several pairs of these gloves and I regularly get them very dirty. I just put them in the washer and dryer like all the rest of my work clothes and they clean up great! Pretty durable too, I've had my first pair for a couple years now and although they have some wear, they still work.",
    "These set screws were impossible to find at local big box stores, and even at local hardware stores, but (of course) they were easy to find on Amazon. They are of good quality, with nicely formed threads and a uniform black oxide coating. Note that they have a 1/16\" hex key socket in the head.",
    "The gloves arrived quickly and I put them to work right away. They seem to work fine for work around the house. So far so good. Worth the price.",
    "Did not work for what I was trying to do with my furniture. I am sure there is a use for them, but this was not it.",
    "my husband got this for his shop and he loves it. the little locks are great and work very well. would buy again.",
    "This is the only glue to use. We are always reaching for this glue over the others. You just have to watch out how much you use, because of it expanding. You use less of this glue versus others.",
    "The one I got the pieces that attached the lid to the bottom broke off so now the garbage man flings the lid where ever he wants when throws the can down. Something extra to have to pick up now.I called Rubbermaid customer service and they were less than sympathetic, basically said tough luck, yea my luck is tough but the plastic they use sure isn't. AVOID!",
    "I find Moen products a very high quality. I am very happy with this purchase. Holder is a solid matierial and the bronze color is consistent throughout",
    "These are great pen holders. We use them throughout our plant and have been very happy with them. We have purchased more than 100 of them, not all from Amazon, but have not had any problems with them.",
    "When I unpacked this little sucker,it looked fairly sturdy, as this was one of the reasons for me to get it. What disappointment, when the floor attachment immediately broke off at he elbow that attaches to the pipe.Fortunately I had the attachments of my old europro canister saved and they fit ( to my surprise), which saved me a return shipment and the hazzle.Would I purchase it again? Probably not.",
    "This lighter worked great for a while then began losing its spark. It is pretty easy to blow out (no wind resistance at all - which I expected) but then having it be difficult to relight is a pain. Seems like there is no more spark.After writing this original review, I took the lighter out and tinkered with it a bit. It seems that the small igniter (the wire that shots the spark onto the burner) got pushed down into the lighter somehow [not sure how, I pretty much always leave the little cap on] - anyway that was the cause of the misfires. After nudging it back up above the burner, I get a light almost every time. Leaving the setting a 4 though - cause I cannot figure out how this may have happened to cause the misfires in the first place.",
    "These are excellent cutting wheels. I'm using them with a Dremel 8220 and have used only 1 wheel for several jobs with the speed ranging from lowest to highest. I will buy these again (if the ones I have ever need to be replaced.) Amazing quality for such a low price!",
    "I needed to drill a 1/4 inch hole in heavy, thick 10 gauge steel. On a medium speed using a hand drill these bits made short work of it. Very sharp, very clean hole. I was quite impressed - the right tool for the job.",
    "Our citric acid arrived on-time and in great condition. I completely understand the argument about the cheap bag--it is flimsy and of poor quality. However, they apparently learned their lesson. Ours had a second bag over the outside to add a little bit more tear resistance. It might still not be able to stand up to a great deal of abuse, but it was apparently enough to make it to our house unscathed.",
    "Unpacked Sweeper, charged battery for 22 hours per instructions and Sweeper worked for one hour and quit. Now it keeps saying battery needs charging and I have charged it several times and it still does not operate. Lights flash but sweeper does not operate at all. Very disappointed to say the least.Manning",
    "I had it for 2 weeks when I had to tape the tubes together. went nuts trying to get bags for it. The bags are too small, have to keep changing them. Thats fine for a tagalong but you are carrying it on your back it means you have to keep taking it off! not designed for what a backpack is designed for.",
    "Though rather expensive I did like the fact that it is a very wide painter's tape. Us sloppy painter's can use the extra \"protection zone\". I am rather neurotic and use scissors to cut the tape rather than rip it ... that always leaves a totally straight end cut.It held up well for my purposes, no bleed through (after making sure enough pressure was placed upon the tape when sticking it up), worked well around windows, trim and walls. It even can be used as a \"Post It\" type note ... meaning if you want to stick up a to do list without leaving heavy residue this tape works fine.Overall, in the competitive painter's tape market as far as performance goes I give it a thumbs up.",
    "Really there is not much to be said. Mitutoyo is a great product. I have been a using a 0-1\" Mic for years now I had the need for a bigger one. Smooth accurate Mitutoyo is a great measuring tool. Daily machining or the weekend worrior. Everything will come out perfect using this product.",
    "this is a handy helper for wood or rugs. easy to clean .No broom or dust pan necessary. Picks up great and does not mar the wood floor",
    "The Sweeper does an excellent job but....it died after 4-5 uses, I called customer service (India) and they gave me a step by step hocus pocus routine to \"reactivate\" the machine and assured me that would work after recharging for 24 hours. That didn't work, called again they said they would send a new battery...three weeks later no battery, called India again and was told the battery was on back order and it would be three more weeks....to be continued.....",
    "The quality of this dropper is much, much nicer than I had expected. It's a pretty thick glass and slightly bigger than I thought it would be. Quality item!Sometimes I stop wearing earrings for a week or two and for some reason when I put earrings back in my ears after the first day wearing them, my piercings hurt. When I was a kid, my mom used to put peroxide in a dropper and use it to clean the pierce holes. That is what I got the dropper for...Norma >^..^&lt;",
    "I do energy audits and teach BPI courses. This is the only metal tape I could find rated for 600F. Most other tapes that most people use are not rated for the high temperature that a flue can reach, especially oil appliances.",
    "Waterproof butterbeans are what we used to call them when I was a tech. They are not waterproof, but resistant. These are imported unfortunately, but I couldn't find any made in the USA when I needed them. They work fine but don't do what the youngsters do and strip the insulation before you crimp them. By the way, if you do not have the proper crimping tool, use the serrated portion of your diagonal pliers just behind the cutting head inside the handles to press them-this will insure a firm bond. The crimping pliers sold with this item are not suitable for crimping these connectors. The only down side to this product other than being imported is it cost as much to ship as to buy them. Source them from the USA and make them a Prime item and they will be a 5 star item.",
    "Purchased to have more options for my Dremel with glass and ceramics.Good value.Work well.Per other reviews, keep them cool if working on glass and ceramic.",
    "I read various reviews, most positive, some saying the reflective quality was no good. We used this tape on signs for our business and when headlights hit it, it really shines back at you. Worth the price.",
    "This product worked super. I did my homework on what to use on a motor home for sealing the roof before using rubber roof and this was the number one suggestion. I used it along with some that was self leveling and I am quite happy with the results. I am female.. and 60 years old so getting on the roof of a motor home was a challenge but hay.. I did it myself.. and am proud of that. I keep some of this in the motor home now \"just in case\" because it worked great.",
    "These screw jacks are heavy compared to Simplex brand screw jacks. If you are working in a crawl space a few pounds can mean a lot. The jacks were made in China. I found a set of 12 ton screw jacks made by Simplex which were lighter, easier to use and US made. The price was comparable if not cheaper. At the time, the Simplex jacks were not sold by Amazon.com. If you need screw jacks and can't find used ones then I would perform an internet search and find the Simplex jacks.",
    "I found 3m low profile inter-locking loops to have little holding power. A five inch strip was tested by less than 8 oz of meter on a flat solid surface. The adhesive is not the problem with this product. It is the low profile loops have insufficient holding power.",
    "If you live in a suburb, you may never need a winch (come along). Other wise, you need one and this is a good choice. I like the way it breaks down and can be boxed for easy carry and storage. Even in the suburbs it will surprise you how many ways this comes in handy and sometimes is a necessity.",
    "I think the mini-hang-up is great. It is very small but I live in an apartment so it's perfect. I actually needed it to suck a pearl earring out of the bathroom drain. I couldn't even see the earring anymore but it popped right out (along with some other gross stuff) from just holding the hose over the drain. I emptied it and changed the filter and then sucked up a ton of cat hair along the baseboards in the hallway---and I just vacuumed with the regular vac yesterday. You will need an extension cord if you plan on moving around at all.",
    "wearing XL the fit is good and I can handle small parts, keys, tools, put my hands in my pockets, etc. Good for driving. I can see these would be good for shooting. About twenty bucks well spent. I'm getting another pair because one wants to live in my truck, the other around the yard. Good padding without being bulky, and well ventilated without feeling flimsy. The gloves are light and pack well too. Soft backs are not going to keep out all thorns, etc. but overall good protection. Great for a glove without Kevlar.",
    "Milwaukee always represents quality and this set is no exception. Well worth the expenditure.",
    "If you need that little extra reach, this tool has give it too you. they seem wit be working great and work well with my drill and survive my impact driver in usage. Definitely a must if you do anything that you need a reach to access. they fit sockets and other extensions snug enough that they work but not too tight that its hard to get the tool off. overall an effective tool.",
    "Not a bad drum dolly for the price. The metal is heavy and it fits the drum well. The wheels are a little stiff when it comes to rotating in the frame which makes it a bit hard to roll at times. I have this on a drum filled with floor dry in my garage with a a smooth painted floor.",
    "I was disappointed that it made the circle just fine but then it was not very effect in drilling the hole very deep. The center hole was OK but the in between just didn't drill out very good at all?",
    "I expected it to be more hard but it is a flexible tube that folds easily. Since i was running it inside the wall to drain the AC condensation, did not want to take a chance and returned it.",
    "Pros:-Really tough glue-More flexible than super glue-Waterproof-Works on many surfaces, metals, wood, ceramics, some plastics, etc. Best for wood applications.Cons:-It expands, drips and produce tiny bubbles during the drying process. Definitely not for repairing your Lladros or others applications that require hairline precision.-Glue is not clear but yellow. Very noticeable, not good if you really want a clean finish.-Make sure you really clean the tip of the bottle or it will be hard to open and use it the next time-Not cheap",
    "I purchased this vac to use it while removing the old carpet in two rooms in preparation for hardwood floors installation. The price was right and the vac did the job I got it for. It has very good suction power. On the negative, a 4-gallon volume is actually not that much. It is sufficient for cleaning one room at a time only and then you have to take the container out and clean the dust. I didn't use one of those special dust bags - I'm sure it would've helped. Cleaning is a bit of a chore: you need to brush off the filter, but unless you use the vac regularly, I didn't think it was a big deal. Bottom line for me: the vac is suitable for DIY projects and certainly not for the pros.",
    "good set with decent selection of sizes, but why would you mark the sizes on the side the belt thingie is on? Almost there guys",
    "This was the last of four bits I wanted for my Hitachi H65. I expected to pay around $50 for it so was very pleased when it turned out to be less than half that. The clay spade attachment is beautifully made, with a large spade area sharpened to a nice ground leading edge. It weighs 12 lbs. so altogether with the H65 the tool weighs 52 lbs. The overall weight benefits the clay cutting action and I found it worked great for loosening the tight clay subsoils here in Michigan. Unless you have a bulldozer or Bobcat, this tool will permit the easy separation and subsequent hand shoveling of tightly compacted clays.",
    "I ordered this micrometer especially because of the .0001 (ten-thousanth) range. When I opened the Amazon box, the Brown-Sharpe box label on the outside said it was a .0001 micrometer. When I opened the wooden box, the first thing I did was start reading the instructions, which said the micrometer would measure to .001! What, that can't be right? I looked at the body of the micrometer and sure enough, no ten-thousanth vernier scale on it.I can't blame Amazon for all of this because the outside of the Brown-Sharpe box indicates the micrometer's range as .0001. It's a pretty nice mic otherwise - if you want to live with the .001 graduation. But that's not what I ordered or paid for so the micrometer is right back in the box to be returned tomorrow.",
    "We use a lot of WD-40 in our house and small business. This spray lubricant has so many uses, from oiling our kid's bike chains to fixing squeaky hinges, it is amazing how many things we find to use it on.Some reviewers have reported issues with the attached straw, but it worked perfectly for me.This is a great product, made even better by the clever spray control \"Smart Straw\"!Recommended!CFH",
    "Probably a third of the eyelets bent. That being said I was putting them in .06 kydex so I should have been using 3/16 not 5/32 eyelets. Overall though they did there job and I made 3 new sheaths with them. BUT if you are wanting to thread 550 paracord through it get larger ones, as it only fits 1 through once they are expanded.",
    "Granted, its easy enough to find replacement instructions online, I just feel that if an item is in the product's description, it should be included in the received product. Watched a couple how-to videos on youtube and installation went great. Screen is good, very bright; however it had one dead pixel on arrival.",
    "We have a 4 gallon shop vac and a old sears 16 gallon shop vac. The area we live in comes with plenty of blowing dirt. Using this cloth filter and a foam filter in combination makes our filter system on the vacs totally cleanable by simply rinsing in water. With all the dust and dirt we pick up, it is nice not to have to buy new filters all the time.",
    "I would not consider myself to have large facial features, but i think the large size would fit me better than a medium. After wearing this for a couple of hours the bridge of my nose is very sore, it still hurts the next day. Maybe I have it too tight, but I couldn't get a good seal without tightening it. Oterwise it works great, I like the lightweight filters as compared to my other dust mask (MSA i think)MSA Safety Works 817663 Multi-Purpose Respiratorwith the large plastic filters that hang out a ways. But even with the heavier filters on my other mask, it isn't uncomfortable to wear all day. I would suggest getting a large if you have any doubt as to the fit.",
    "The detail in this poster is amazing. Its just as good as I thought it would be. As an anatomy and physiology student this poster helped me a lot!",
    "This worked great as an eyewash station. I installed it on the existing faucet in 10 of our janitors closets to meet OSHA regulations. It was extremely easy to install and is a bargain compared to stand alone eyewash stations.",
    "I almost didn't order this due to the bad reviews on this product. But I am so glad I tried it!! The packaging was wonderful!! I ordered 5 lbs and it came in 2 bags of 2 1/2 lbs each. They were nicely packaged in very heavy foily bags, the reason being for freshness. I appreciated them thinking of that. I make fizzy bath bombs with this and you need your product fresh you get good fizz. Am so glad I found a good company to order this from when I need it!!",
    "It took me a long time to find a shower caddy that does what it is supposed to do! I have had this caddy (I ordered 2) for several months now and have had no problems whatsoever with it. If you are familiar with the 3M Command method, it will be simple to install. Otherwise, just read the directions.",
    "I bought this to fix the bond between my cooling fans and the motherboard on my desktop. it works more efficiently now that the bond is better.",
    "Used these nozzles to make a snowmaker due to the unseasonably dry and warm winter we're having. They work OK but have a very low water flow rate. That severely limits their effectiveness.",
    "Use on a core i5 750, the temp are at idle 30-34 and a full use 40-42 more or less. Great value, good performance",
    "I used some silicone that didn't cure right, and soaked into the granite, leaving dark stains all over the place. Ordered this stuff and have completely removed it. It even pulled out the stain from the more polished surfaces. Awesome!This stuff smells like orange deliciousness too - fumes probably aren't good for you, but smell great.",
    "I use this little gadget to tow my grocery cart behind me. Before I got it, my wrist sometimes hurt because of the angle they were in while towing heavy loads. Now, my wrists are just fine. And I get lots of questions about it, many folks want to know where to get it. Very handy device!",
    "Everything is AOK. 1/32\" HS Import Jobber Drill Bits pack of 12 arrived on time. I am pleased, I will reccommend this to anyone. I will do business with this company again. Thanks for your great service.",
    "I have been using Techni-Tool tweezers for 18 years and they are of the best quality. Among all of their tweezers, this type 4 tweezer is my favorite.I need to handle very tiny samples and this tweezer has very sharp point, yet still have two perfectly matching flat faces to grab anything: 10-25 micrometer diameter gold/platinum wires, tiny single crystals, ...This tweezer has the lowest spring constant thus you can feel how good grip you have on your samples and wires, so you won't over-force and break the wire or pop (and lose) the sample. When this tweezer closes, not only the flat surfaces match well, two faces also close together with an overlapping length of 1-2cm. Other tweezers only close at the tip and you need to apply much greater forces to make it \"fully\" close.Techni-tool's type 5 or 5A tweezers may have a sharper tip, but they do not have better flat surface to grab things, so I recommend type 4 tweezers for the most delicate jobs.Cons: I used to have type 4A tweezers and they were even better than type 4. They stopped producing type 4A. 10 years ago I could find type M4A, which was slightly shorter than 4A and was as perfect. A few years ago, the student in our lab ordered M4A and found out it's way too short and has a lousy tip (too big).",
    "if the pictures shows a case of water bottles and two paper boxes, i'm sure the boxes are empty! this cart does not do well with weight, but is usefull for bulky items like 3 light boxes. careful for those over 6 foot tall, you may hunch over as it does not extend enough for the vertically gifted.",
    "Out of every oil currently being sold, I endorse this one for the avid knife collector simply because it does what says. I bought it on amazon where for a comparable price you can get good honing oil that is crap... when it comes to lubricating spring assisted open folding knives. This stuff also cleans and preserves your carbon steel blades. As an amazon prime member I get free shipping so this was a great value. I have around thirty different size knives and this stuff lasted a month! Next time I'll go for the bigger one with better value. I just bought this to see if it did all it said it could and it does. 8)",
    "This product is full of design flaws. When asking Oreck for repair am told over and over that the part is not covered under the warranty.",
    "FYI-I work in nutrition and this fat model is no deal. Most of the fat models that I have come across in catalogs and nutrition resources are new and run between $70-85.",
    "bought some motorcycle clutch and break controls that had an untapped hole for the mirrors. The descriptions didn't tell me that. I guess you have to get mirrors that were designed to be through bolted. Well this fixed it pretty quick. The controls were aluminum so I didn't exactly push it to the limit but I would expect this manufacture to a mid grade tap. If you've never used a tap before I'd watch a few how to videos. When I was in tech school for machining a busted a good quality tap in 3/4\" aluminum because I didn't break the chip. I thought, \"I've done this all day long on different grade of steel I'll just cram this right through this aluminum!\" and then I learn how to dig out my first tap. There's just a slight trick to it but easy to pick up.",
    "Generally, I have a hard time finding an issue with this device. It is well constructed. It came with clear instructions. The 'notch-by-notch' let down system works great. It works as it should. I would recommend lubricating it before your first use, it could use a little more lubricant to help with the pulling of the steel cable out. Further, this is a device with which you really should READ THE INSTRUCTIONS. I recently used it to move a car shell (rolling chassis, about 1,500 lbs.) onto an auto-transport rented from U-Haul. It worked wonderfully. Allowed me to ease it up and ensure great alignment as well as kept the car moving nice and steady.",
    "Quality products and good service will always be important to me when buying any tool. Central Tool has never let me down, with anything I have ever purchased. When I need good quality tools, this is where I always go.",
    "Excellent thermometer for either BBQ or regular Kitchen Oven usage. The main rule to follow is to avoid making sharp bends in the probe cable. If you do make sharp bends, either in storage or in use, you may damage the cable and render it useless. The probe tip mounts easily in the included \"foot mount\" and the probe tip should be placed near the item being cooked. If using it in the oven, you can close the oven door on the cable without causing any damage but just be sure that this does not cause any \"kinks\" in the cable. For storage, it will be safer to coil up the cable rather than storing it in the \"bowtie\" fashion that it was originally packaged with. I use this unit for both Kitchen oven and outdoor BBQ grills and it works great in both applications. Be aware, however, that your oven will have a fluctuating temperature. For example,if you set it for 350 degrees, the actual temperature in the oven will likely cycle up to about 375 and then shut off until the temperature drops to about 325. The OT-03BBQ thermometer display will rise and fall throughout these cycles, so you will need to take this into consideration.My experience over many examples, however, is that the temperatures displayed (or selected)by most residential ovens are usually not accurate but some will have the capability for you to \"adjust\" the temperature setting. This capability, used in conjunction with the BBQ thermometer, will allow you to more accurately adjust your oven settings.Another caution: Do not leave the cable in the oven when using the \"oven cleaning\" function. The extreme heat from this cleaning operation will likely ruin the BBQ probe.",
    "This is the tape used to mark all sorts of things, including fire and rescue equipment. This is the tape you want, if you want quality and ultra high strength adhesive, that survives the unbelievable.",
    "My husband has large hands, and had a hard time finding work gloves that fit well. These are just the perfect fit, and allow him to work with dexterity.",
    "Don't use this on painted surfaces of any kind. You will end up with numerous holes and just have to paint over again.",
    "Put it in a dance studio. Great product and parents are glad to see we are concerned with keeping germs and sickness out. A must for any crowd gathering places.",
    "Received winch but nothing on said it was from viper, box just said made in China. Instructions were worthless. Used winch twice before it went up in smoke. I dont believe its made for any serious off road use.",
    "Easy to work with, and highly reflective. If you are considering purchasing this product, read the description carefully. The tape does NOT come with any adhesive; you have to come up with your own way to mount it. For my project, this was ideal, because I intended to glue the reflective tape onto nylon fabric, which requires a different adhesive than the kind that comes on sticky-backed tape. I used Eclectic E6000 Multi-Purpose Adhesive (http://www.amazon.com/Eclectic-E6000-Multi-Purpose-Adhesive-3-7-Ounce/dp/B0053TO0JK/ref=cm_cr_pr_product_top) with great results. YMMV.",
    "gloves feel very warm - haven't tested waterproofing yet, but the appear to be high quality - I ordered large and they run somewhat small",
    "ORDERED CALIPERS ON 3MAY12 RECEIVED THEM 17MAY12 DAMAGED. CASE WAS CRACKED-I CAN LIVE WITH THAT-AND INSTALLED LR-44,1.5VDC BATTERY WAS DEAD. THE EXTRA BATTERY WAS OKAY HOWEVER. CALIPERS SEEM TO WORK OKAY SO FAR.THE CALIPER MANUFACTURER OWES ME ANOTHER LR-44 BATTERY--PLEASE SHIP. THANKS",
    "I recently rediscovered my love for gardening, which I had had as a child. I delved headfirst into it about a year ago. However, not heeding advice right away, I worked mainly barehanded and have suffered here and there for it, with dirty hands and nails, thorn pricks all over, etc. I needed to try something that would help me get the job done in a less messy, productive, and safer way. So I looked into professional style gardening gloves.Of all the gloves I looked at, the Bionic Men's Elite Gardening Gloves stood out amongst the others. I liked the appearance, and the description sounded awesome. These seemed to be exactly what I needed. They are considerably more expensive than the cheap run-of-the-mill throw-away cloth gloves you can get at any local hardware store, but so well worth it.My first concern was the glove's size. I'm 6'6\" with big hands. I opted for the (rarely seen) XXX-Large size. I then worried if it would be overkill, but no. When the gloves arrived, I feared for a moment that they might not fit, but indeed they fit... \"like a glove.\" Snug, but went on and felt great.The fingers have natural bending points built in, with subtle curves to help the fingers do their nimble work. The exterior is tough, with extra padding in certain spots, to prevent thorn punctures. There is also an adjustable velcro wrist-wrap to keep the gloves on without slipping off. And the look of these gloves has that race car driver appearance.Overall, I love the Bionic Men's Elite Gardening Gloves. I'm also glad that it comes in such large sizes. I'm very glad I purchased them, and they definitely have made my gardening chores much easier, cleaner, and safer (when working with thorns or certain plant saps). Excellent product.",
    "I used this product to drill (10) through holes in 14\"-thick concrete stem wall (we used the milwaukee extension bar and center piece). It works perfect! no water needed. In few holes, we encountered 1/2\" rebars and the core bit (carbide) cut them. You do stop every ~3-in at a time to clear the concrete. We used the small milwaukee 1\" hammer drill to drive the core bit (remember you are only cutting a thin curf so you can core 2-1/2\" dia using a 1\" rated hammer drill). Hope this was helpful.",
    "Used it this week to move a heavy hutch and made the job so easy best money spent. If you got to move items that are heavy or bulky well worth buying.",
    "This makes my 2nd set of these. If they last as long as the 1st set - it will be another couple years of hard abuse before they need replaced. Don't know why they outlast the others; but they do. They're 4\" grinding wheels are of same great quality i.e. cut fast, long lasting. Now if Amazon would only stock them again and put on a special!",
    "The lining of these gloves comes out of the fingers when you remove your hand. When I tried to put them on again, it took me a couple of minutes to straighten everything out--NOT what I need when trying to get things done. Too bad, because the gloves are well-constructed and seemed like they'd be great. Donated after two wears.",
    "These are very high quality bits at a good price. If you can't quite tell from the pics, the drill bits come in a nice vinyl pouch which is nice for keeping them organized.",
    "I got this for my friend who is going to school so I will let her write this review. I am pleased with my Skeleton. He came to me unbroken and easy to put together. He's very helpful in my Anatomy and potioning class for Radiology. The only thing that I would have liked different is to have his joints move a bit more freely and to be able to take him apart to visulize the different sections better. Over all I'm pleased that I chose this one over some that I looked at before choosing this one.",
    "The sanding screen pretty much does what you'd expect. I've had no problems with it. The price was pretty decent, in line with the brick and mortar home improvement stores. I agree with other reviewer that using this with vac system sure beats the heck out of straight up sanding.",
    "I ordered the 1/2\" x 1/4\" x 36\" brass bar. They sent a 1/2\" x 3/16\" x 36\" bar instead. This isn't just my measurement - the bar is clearly marked as .1875 x .50",
    "These drill bits are top notch. I was able to drill a hole through a piece of metal in no time.I tried a cheaper drill bit that supposedly worked and it broke but not these ones !",
    "These hooks get the job done. It's important not to exceed the weight limit, and to follow the installation instructions (clean off the surface, press hard on the hook for several seconds until it sets up properly, etc.). If you do that, these hooks should stay up exactly as long as you need them to.",
    "I had planned to keep this fine product safely sequestered in the wine cellar. Unfortunately I forgot to latch the door and my particularly clever cat played his combination soccer/hockey game with the canister. Although he undoubtedly spent one or more of his 9 lives I no longer have need for a night light of any sort as Fluffy follows me wherever I roam. Highly recommended!",
    "It's durable, accurate and easy to read, one bad thing about this item which is ((its box)) too big for little caliper.Mitutoyo Japanese trademark but the caliper made in Brazil.",
    "This tool is a very handy,easy to use and sturdy tool, I think that every door installers should have one especially if you are using a hinge mortising template with a router.I was quite skeptical about buying this tool but after I received it and used it I am so happy I invested in this product.Very good design.Craig",
    "I can use my shop vac again! I had stopped using my shop vac because the paper filter was useless - it only re-distributed the dirt that it picked up. I had started using the paper bag in addition to the paper filter over the foam, this proved passable but a hassle, and expensive. The Clean Stream is great, I can go from dry to wet pick up with no change in filter, I can also simply dump the vac without the hassle of the paper bag. The only minor annoyance is the float doesn't work for wet pick up, so if you fill the vac with water and then shut it off water will run out the hose until it reaches a level below the hose connection (not a big deal for all the benefits).",
    "Al llegar estaba muy contento, compre el taladro denali con todo el pack completo... lo use bastante, la bateria dejo de funcionar a los dos meses y las mechas se me oxidaron horrible al igual que los punteros...Para resolver una situacion rapida, funciona... a largo plazo, olvidalo.",
    "sanding discs have worked well and I am happy with purchase.However, the order was missing one disc which no doubt can happen with modern technology counting. Still a good bargain compared to the products sold at the big box stores.",
    "Wheels are of good quality, roll well over bumpy surfaces, and have so far not gotten chewed up by the road.",
    "The simplistic roll-up case actually works pretty good. I've only drilled a couple holes so far, so I don't know how long these will hold an edge. But fine in pine for now.",
    "I've had my Delta 50-850 for a few years. It worked pretty well until I moved into my new shop. I attached it to my metal ductwork and it just doesn't have the power I now need. Also, I bought a remote transmitter which saves alot of time going back and forth to the machine. The only problem is that when the remote is pushed, about half the time the breaker trips. Because of the problems I'm having, I've just purchased a new Oneida Dust Gorilla. It's a cyclone dust collector and hopefully will have the power I need.",
    "I have had ShopVac vacuums before and they never disappoint me. This one it's not the exception. When I received the package I thought it was too small, but as soon as I put it to work it was really up to the task. I vacuum my house and cars with this little marvel and it's enough! Great adquisition for the price and size! However I have not used it for wet spills, just dry and regular dirt and dust at home, carpet, curtains, sofas, etc. All in all great purchase!",
    "I needed a caliper in a hurry and didn't want to spend the money on an expensive metal one. I naturally presumed that this plastic model would be less accurate, and would drift further off with larger measurements.I was wrong.The precision on this device is tight. Set the needle adjustment at 0 inches and then test it yourself. As you expand inch after inch, the needle repeatedly hits dead on 0. Would a more expensive metal one be more precise and more rugged? I'm sure it would. But this unit is sure to surprise you with its great performance.",
    "Works as described. I carry it with me when I travel so I can test the bottled water I buy when I can't find the brand I love.",
    "IRONCLAD ? WHAT ELSE DO YOU NEED TO SAY .... THE ONLY GLOVES MY MEN WILL WEAR.",
    "As with everything I have owned that is made by Starrett these too are exceptionally well made. They work very well. All the sizes are extremely accurate. The knurl appears to be coated in a black oxide finish. There very easy to hold and keep steady. Keep them lightly oiled and they will last a life time.",
    "Not much to say--Bosch invented the SDS system and makes awesome bits for it. You can't go wrong with Bosch SDS bits.",
    "I got these little packets for my first aid kits. I keep one in the car, one in each of our back packs, in my purse and also around the house. These little one \"serving\" packs are much less expensive than buying the bigger ointments that will just make a mess in my kits. Love them.",
    "I have a 12 gallon shop vac with this same filter. This comes with a replacement retainer thing as well. Fit perfect and replaced my nasty old filter that stunk up the shop every time I used the vacuum. Easy-schmesy.",
    "The Goop products have always been great and I bought these in bulk to save a bundle over the individual ones you buy in the store.",
    "This is a very useful, hard-to-find product, especially for model builders. It came carefully packaged and in excellent condition. My only caveat is that the actual thickiness of the product that I received was 0.036 inches, not the 0.030 inches advertised. But even this was great for me because I was actually looking for a sheet 0.038 inches thick and this was nearly perfect for my application.",
    "well this die worked fine but its kinda of expensive.i onlyed needed it to clean threads. one time use but now i have one in case i ever need one again.",
    "What more can I say, other than they do what they are supposed to. I bought them because I'd read some good reviews about them, and they did not lie. These belts are exceptionaly well made and will hold up until the bitter end. I really have nothing at all bad to say about them, so take from that what you will.",
    "I have found Mirka brand sanding discs to be first-rate. I have no reason to try another brand.RPK",
    "These nuts really fit the bill. They were just the right size and actually fit the bolt I was using them on. What a great product. I would buy them again in a heartbeat!",
    "I have to say overall these gloves have treated me well. Great quality and fit great, especially since I have big hands. I use them at the range, on my car or anything where I might need some gloves. I am very pleased with these gloves, great quality at a good price. A must buy for people who are avid shooters or just need gloves for work.",
    "I love Command Strips. I have been using them for years, mostly for posters and framed art. They are strong and come off clean.",
    "Product as advertised but the ad does not say that it is best used on glass shelves, not on wood. I needed it for the latter so I haven't used it.",
    "I thought this would be handy, but I found I use it a lot more than I expected. It holds cords, wires, anything you want to hold in place by fixing it in place to something else. Telephone cords, computer cords, anything with a cord stays in place and out of the way. Great way to hang hoses, extension cords. Just wrap it up with Fastwrap. You can even velcro your kids to the chair to keep them out of your hair! (I haven't personally tried this)",
    "This is a high quality product that looks great on the wall and it takes about 2 seconds to change the paper.",
    "I have only used one bit from this set so far, to hang blinds. Did the job and fit my small wireless driver/drill.",
    "I bought this to move around some file cabinets and heavy boxes. It certainly is compact and light, and, while I would be hesitant to lift the 150 lbs. it claims, it does the job. The one thing I don't like about it is that it flexes quite a bit before it actually lifts. This give the impression that it is flimsy, but it really isn't. I love that fact that it takes up much less space and weighs less than a conventional two-wheeler.",
    "I use this to replace the bungee rope that is common on toddler trampolines. The OEM replacement is ~$25 for ~25' of rope. This is 3x the rope for the same cost. Unfortunately the design of these trampolines is such that the use will create wear points and ultimately cause the ropes to fail, leading to the need to replace them. This bulk quantity makes is more acceptable to to, especially as my sons get older (and heavier). Of course my sons won't be albe to use this trampoline forever, but for now it's a good indoor energy burn!",
    "These are good quality work gloves. They're comfortable and I feel good working in them. I don't expect them to last forever, but at the price, I can buy several pairs for the same as I might for a pair of more expensive deer-skin ones.",
    "I will probably repeat some other reviewers, but I have similar experience. Other sets are cheaper, so you go for them, but you end up frustrated. That's what happened to me as well. This is the best set on the market for general woodworking and furniture building (I am not including specialized bits and screws professional cabinet makers use). The drills are sharp and longer than competing sets, which gives you added flexibility to adjust depth. The collar has multiple cutters (BTW, Hitachi collars have just 1!) and 2 (not one!) screws to hold the collar in place without slipping. The end result is that you can make clean, precise cut every time, without splinters, without fear that the collar will slip. If I had to do it all over again, I would have bought this set right away. Other sets will only waste your money and you will eventually end up buying this set anyway.",
    "Perfect for turning an impact into a lug nut removing machine. with the quick in and out I dont have to worry about other tools",
    "I've had a pair of these for three years now and HIGHLY reccomend them. I am an avid outdoorsman... fishing, working in the yard, and a hell of alot of hunting in the fall and winter... These things are tough as nails while still allowing a decent amount of dexterity...enough to eaily and accurately re-load any firearm. They aren't warm, but they protect your hands better than any glove I have ever worn...3 years and going strong.BY FAR THE BEST WORK GLOVE ON THE MARKET",
    "within 2 months of wearing them, the glue that holds the leather top to the sandle wore down and it's not too late to exchange them....better off buying rainbows",
    "The shoulder dolly did the job!!!! Just like the picture shows, I was able to carry a huge tv down two flights of stairs and up three with little to no effort. It was great for the sofa and dressers, bookcases and desks. We even used it for the heavy bed mattress. This product made moving enjoyable. The shoulder dolly was easy to adjust and use even with people of different sizes and strengths on each side.",
    "Got these to keep the racoons out of our cooler while camping. They are exactly what we needed. Would recommend.",
    "Even though I do mostly electrical, buying this kit was beneficial because it includes all but one bit that I needed, which I purchased separately. Extra center self feed bits are included to replace the primary ones if you should somehow break or wear one done. Although that hasn't happened to me yet. The case is great to keep the bits organized, clean, and most importantly dry.",
    "Sturdy and reliable. I only wish the bungee cords that were supplied had wider hooks to more easily anchor onto the crossbars. But a great value for the money. I've hauled many heavy boxes and love the compact size when folded. After owning other rickety hand trucks, the solidity of this one is great.",
    "Cheap, rough wood with lots of visible flaws and wood filler. Luckily, I did not need it for finishing purposes.",
    "This works great and is so easy to clean. I was going to just replace the one I had with what had come in it, but after coming across this one I just couldnt pass it up. Now I can vacuum wet as much as I like and just rinse when Im done. This will probably outlast the shopvac!",
    "Decided to try out this vacuum bag on my Vacmaster 6 gallon VQ607SFD even though it is sold as for Shop-Vac. In the picture it looked similar to the bag that was provided with my Vacmaster vacuum. Works very well and fits perfectly.",
    "This was a good-sized bag of steel hooks and other devices to use on a 1/8&#34; hole diameter pegboard. The welds seem good, but the parts alignment was not always perfect. Plating looks OK. A few pieces were missing the red plastic tips to cover the protruding ends; other pieces had them. Small plastic &#34;locks&#34; are included to help hold the hooks in position. For the price, they're OK. NOTE: Amazon shows these as an accessory for the Wall Control organizer panels. In practice they do not work very well for this because the Wall Control pegboards have 1/4&#34; holes. So the Stanley hardware fits loosely and wobbles, even with the &#34;locks&#34; installed. My fault for not realizing this before purchasing. If you have 1/8&#34; pegboard (hardboard or plastic) panels, you will be happier with this hardware. I don't recommend them for the Wall Control panels.",
    "Lid is too thin. It bends when you sit on it. I'm afraid it will crack after it has been used for a while.",
    "I followed the directions exactly and nowhere was it thick at all and waited the 24hours. I took a shower then before I left I checked out the tub and the caulk was flaking off. Maybe I didn't wait long enough? I removed everything, cleaned it up, applied it and waited one week. After the first shower the stuff was flaking off again. Completely worthless and a waste of time.",
    "I wanted a magnifier to do repair work on music boxes. Since I had eye surgery in October, my reading vision went horrible so I really needed something that got me close up and clear.These do the trick. They are lightweight, have an adjustable headband and flip up when not in use. They have a lightly padded front band that helps it to not dig into your forehead.I use reading glasses but take them off when using this and I still have a clear view.I would recommend these for casual hobbyist use.",
    "These hooks are quick, convenient and do not require commitment. When you're moving or have decided you don't want the hook there any more, they're easy to remove and do not leave residue. We've added hooks on the inside of kitchen cabinets for oven mitts, in the garage for flashlights and umbrellas, inside of bathroom cabinets for mirrors, and inside closets for belts. They come in three sizes, but we've found that medium is the best all-around size.",
    "Not much to say other than I ordered Oreck bags and received what I ordered. New as billed and in new unopened packages.",
    "This is my first canister vac in many years, so I don't have much basis for comparison to other canister vacs.It works nicely on hard surfaces like tile and vinyl floors, and (with the attachments) it can do the dusting, too, except around small items that could get sucked up.But it's just another canister vac when it comes to carpets. It doesn't come close to what an upright vac with beater bar can do on carpet. And I found the connection between the hose and the upper extension doesn't have enough friction, so there's an annoying tendency for it to come apart as I'm vacuuming (the extension part falls to the floor with a clatter, and I have to pick it up again and put it back on).",
    "Gardner Bender GGS-1032HCN Hex-Head Ground Screw, 100-PackActually, these cost about twice as much as 100 slot-drive ground screws at our local electrical supply house. However, these Gardner Bender screws have a combination slot drive / Phillips drive head that greatly speeds electrical work. I use an impact driver with a long Phillips bit to drive these in quickly, which makes them worth the extra cost.These are good quality and worth buying, in a nice plastic container with a closing lid...",
    "I didn't realize when I purchased this that it was on a slider that extended the organizer out from underneath the shelf, which was actually a very handy feature. The product installs very easily and looks nice.",
    "It's now on sale at Sears for $27.77 and the regular non-sale price is $32.99.",
    "Finaly, a compact electronics cleaner (for my sewing room)!!! - and at a reasonable price. This thing really works well, has a seemingly powerful suction and perfect for getting underneath the bobbins and needle plates for cleaning.",
    "Very good quality tap with the proper sized number drill. I use a lot of tap and die tools for metal projects and it pays to get the better quality ones as they last longer.",
    "It takes a second to figure out how to apply these, but once you do you're good. Great for hanging relatively heavy things (though use common sense) in a snap. I used them on glass to hang a bunch of pictures (my office has glass walls, long story). Highly recommended, especially for the price.",
    "These guys deliver quick, really quick with the standard shipping. And the belts are good, too. I'm very happy with the whole deal here..",
    "As all the other reviewers mention, these are awesome. I use'em for grilling/smoking and couldn't ask for them to be any better. I did try the redneck test and picked up a smoldering piece of burning hardwood charcoal to see how long you can hold it...note to self: don't do that, haha. So, short of grabbing smoldering hot pieces of flaming charcoal, these are awesome. Oh, and to anyone worrying about the color, if you use'em to BBQ, they won't stay electric blue for very long if you're using them right.",
    "I have been using this respirator forever it seems... It works well for me and I have recommended it to all my workers. It is light, tight, adjustable, washable and durable. It'll take a variety of cartridges and it has become a must have for numerous work situations. It also came in very handy when we had forest fires in my area. I have not found anything better in its category.",
    "to the person who couldn't get this to work, did you try the little known trick of twisting the knob (clockwise)to get sound?",
    "I got this for an 8 yr old as I was giving her a bow and arrow set. Although I don't understand the physics of it, somehow the arrow shot back and hit her right on the googles, aligned with her right eye. This woulda been bad, but the goggles (and my niece) lived through it without a scratch.",
    "I started looking around for some 3-inch braking, swiveling casters for a tool stand and couldn't believe how expensive they were. Then I found these at a fraction of the price of others I've seen and based on all the positive reviews decided to give them a try. Well I just have to add my own positive review - they are exactly as described. Sturdy construction, the brakes completely lock down my stand and the swivel wheels make moving across a rough garage floor easy. I used a 7/16-inch drill bit to drill a hole into the wood stand for the caster thread and it was a perfect fit - the caster screwed in easily but wasn't loose.",
    "my ps3 got ylod (yellowlightofdeath) and i had to do something about it, so i decided to try and fix it on my own, i ordered this arctic silver 5 since i heard this was the better type of thermal compound to use, i dont know much about all this stuff, but i opened it and reflowed the soder on the gpu and cpu and applied the thermal compound, its been about 1 month since then and my ps3 is working like a champ, ive been watching showes all day and playing oblivion and skyrim and the ps3s fan barley even runs hard like hardley ever so this stuff is prolly pretty damn good lol over all it worked awesome for me",
    "This Bit worked for the first hole I drilled. Then snapped in half for the next. The Quality Import bit really lived up to its Quality import name.",
    "I have had no issues with my septic tank while using this product. The operator who completes my routine maintenance could not tell we had a garbage disposal. I purchased in bulk and took advantage of the free shipping-this was favorite part of my purcahase. Many other sites offer the BIO-CG cartridges but their shipping fees are ridiculous.",
    "I like this one better than the larger one. Easier to apply and looked much neater. Still need to wait for it to cure, but works.",
    "Have used this to bring a load of packages to the post office, and other odds and ends. Stores very small, opens with one hand by releasing the hand lock and kicking the bottom plate down. Sturdy within it's weight limit. Glad I got it. Well worth the price I paid.",
    "I searched for a better designed fitting for my boats, but could not find any others than the Perko. I purchased and installed two of these fittings in the stern, and they are plumbed to each engine so I can flush them with fresh water after a day of boating. Received both fittings packaged well and undamaged. This metal fitting has a good feel to it, and seems to be well built and sturdy. The hose attaches to the fitting very easily, no problem with the threading. But the weakest link using this fitting for an engine flush system is the black plastic plug/cap. I'm rating the product at only 4 stars because some bean counter decided they could save a few pennies by using a plastic cap instead of metal cap. At $ 69, there's obviously enough profit available to include a metal cap.Using this fitting to flush your engines is risky in the long term because a plastic plug/cap will eventually fail due to the effects of pressure from the water cooling system in the boat, time, sun and weather. When it does finally crack or get brittle, it will allow air into the flush lines while operating the engine, which will increase engine temps. Meaning, a solid metal plug/cap to match the fitting would avoid problems like this in the future. Rather than deal with that issue in a couple years, I have to buy find and buy metal plugs/caps. This is just typical of manufacturing today, everything is measured to the penny and they'll cut corners when they can. C'est la vie I suppose.If you're simply using this fitting for a washdown pump or other non-critical function on your boat, they're fine, just crazy expensive.",
    "The bagless Shop-Vac lurked beneath the stairs,Helpless to remove our five dogs' hairsHow sad to see an implement in painFor want of an accessory so plainBut then arrived not only one but five!Immediately our vacuum came alive!Rejoice! For now with rattle and with clunkIt once again cleans up all kinds of junk!",
    "I bought two of these to help me and my girlfriend carry sheetrock upstairs on a remodeling project. Although you can carry the sheetrock using this tool with only one person, having someone else at the other end carrying it upstairs prevents from dragging on the stairs because of the angle, but I was able to carry one by myself. The first time I carried sheetrock upstairs without using this tool my shoulders reminded me of the event for the next week or so. Even though I am six feet four, I would need longer arms to grab the bottom and the top at the same time, but with this tool you have longer hands because it grabs the bottom with the tool and you hold the tool at a higher level giving the ability to stabilize and carry the board. We were able to carry four panels of sheetrock, one at a time upstairs without breaking a sweat and breaking our backs. It's definetely worth the money and I highly recommended it unless you like to bust your chops.",
    "When I investigated a septic system disposal, I saw that it needed these special bottles to help break down disposal waste. As I can't imagine life with out a disposal, I hunted for these little bottles. As we live out in the country, it's a ride into town!Amazon not only saved me $ on the unit but also on the gas to drive into town which is 40 miles away. Thanks, Amazon, for your prompt service! I plan on purchasing more of my needs here.Thx,DM Pine Mt Ga.",
    "Great for keeping your gloves dry all season and keep them from getting smelly from being wet all the time. Also keeps the leather from drying out by drying them in the dryer.",
    "Great power for such a small Vac. Easy to move around and store. Longer hose would be nice. Hanging bracket is good",
    "I wouldn't waste any money on this item. Due to the poor quality, I was unable to complete the job I was doing. All the stone and half the other bits are destroyed. I wouldn't pay more then $5 for this set. The cases and bag is nice and that is about it.",
    "really like these gloves, very sharp looking, lots of useful features and a good fit! can do lots of tasks with them on that i would normally take a glove off to do! my only complaint is they offer very little warmth at all!",
    "GREAT SCOTT!! This product is amazing! But please, whatever you do, DO NOT expose this product to 1.21 Gigawatts. The future of mankind depends on it!",
    "This is my first time trying this brand of glove and I'm comparing it to Mechanix brand(which my last pair I had, split OPEN from the inseam down to the wrist). Really bad flaw that I've seen other reviers note! Anyway, The only Size that was available when I ordered was Lrg and XLrg... I was hesitant because I'm accustomed to Med, but the Lrg is not much different except the fingertips are slightly longer. Other than that, nice and snug. Padding is great on the knuckles, top of the hand and reinforced palms and top parts of the thumb, forefinger and middle finger. The general feel is a little bulkier than the thin Mechanix Fast Fit's thin, light feel, but I prefer this in the cold weather. There's even a sewn loop on the inside wrists if you'd like to run lanyards or cord through to setup handy carrying. Happy with my purchase.",
    "I use the one tooth hole saws by Lenox in my plumbing/heating business almost daily. I've tried them all, and this one saves time, goes through wood fast, easy to remove plug, andstays sharp. It also has no problems cutting nails. If you have the kit, there is a diamond file to re-sharpen point, to extend the life. I could get a over a years worth of use with them.You do however need a good right angle drill to use with them.",
    "I used this remove the paint and rust from my truck before I found the wagner paint eater attachment. It does rock for removing rust.",
    "The bit is fine but the vendor is worthless. The first shipment was lost and I had to wait a long time before Amazon would admit it and send another.",
    "Well, in general I have liked 3M's Commander series of products. I use them on the backs of many household doors to provide a hook for jackets, robes, etc. So I was happy to try the Poster Strips.I can't say I am impressed with this product. I used this product to mount a monthly calendar to my office wall. After about 6 months, I went to change the calendar.3 of 4 strips removed the paint from the wall.Their product advertising states, \"the mounting solution that holds on strongly, comes off cleanly! 3M's patented stretch release technology offers strong holding power and damage-free removal. The innovation - forget about nails, screws, tacks or messy adhesives that damage your walls. Revolutionary Command Adhesive works great on painted surfaces, wood, tile and more. Comes off cleanly leaving no holes, marks, sticky residue or stains.\"I supposed that's partly true, it did not leave residue. It also did not leave the paint on the wall.Sorry, this one is a FAIL.",
    "This bit chatters like crazy when used in wood/metal and makes rough countersinks in an octegon shape. It chatters some when used with a drill press, but is aweful when used with a handheld drill. If you're in a pinch or using it for construction work, then it will give you semi-adequate countersinks. But if you are doing fine woodwork and need pretty countersinks, then this tool is not the one to use.I used this with a handheld drill for holes I made in a piece of steel sheet metal. This bit chattered like crazy and made terrible countersinks. It was so bad that I had to file the holes smooth again. It may work better in a dril press, but I have other countersinks that work better with a handheld drill than this one.",
    "The reading are inaccurate. I've checked them against a calibrated sphygmomanometer and the reading aren't even close. I cannot reccommend this product.",
    "Ordered a set of these because the selection of sizes was just what was needed for various DIY projects and the prices were well below what hardware stores charge. Very satisfied with this product.",
    "Great quality. Homemade iron. Very simple but real iron you can bend/tweak a bit. Nice for hanging any thin long item like spear, bow or sword",
    "These disks come without a paper backing! Instead, some idiot decided that they should be continuously joined with a 2\" wide strip of plastic . Incredibly poor idea. So dust get all over the unused ones, or, as I tried, I put them in a zip-lock, which just made the last one, the one you want, stick to the bag. Awful, awful, awful!!!",
    "I am so happy with this toilet seat. They are harder and harder to find. This one was the exact color and shape that I needed and I just love it. The price was perfect as well. I hope when this one wears out I can find it again from the same seller at a similar price!",
    "Thease are quality straps. I work at a home improvment store and bought thease from Amazon as I did not like the ones we had in stock. I am glad I did as thease are heavy duty. I am on now to see if they have any longer than 6' as I would like to have 8' or 10' as well.",
    "I bought this gloves for a variety of work, but most of the time they are using for building performance stages. We are handling metal, wood and various rusty bolts. These gloves provide a good amount of dexterity and I like the neoprene feel. After about 7 months of moderate on and off use a noticed a hole in one of the fingers after I washed them. I followed all the instructions such as air drying them. Normally I wouldn't wash gloves, but they started to smell really bad from sweat. I gave Youngstown a call and told me 7 months is a bit past warranty, but would replace them anyway.Now 4-5 months later with my replacement pair I have discovered a hole developing in another one of the fingers....again. I didn't even wash them this time. I believe I was simply putting a bolt on a screw when I noticed the rip. Nothing that is too strenuous to the glove. That said I probably won't be ordering anymore Youngstown gloves anymore. I like these gloves, but they just seem to rip or wear too easily. Even before the rip I noticed the stitching in the glove was starting to fray and I hadn't even used them that long!",
    "Definitely the shoulder dolly helps you lift heavy and bulky objects with ease. But don't think you can lift objects heavier than what you're used to- including with your partner. It won't make you and your partner stronger.It can be improved though. The straps around the neck can be improved to avoid burning the skin around the neck during lifting. Also, there should be a better solution for the long lifting strap. If the lifted object is not that wide, there is a lot of strap hanging, making it very dangerous because one can trip over it.Overall, I'm satisfied with the purchase. My husband was skeptic about it. He is one of those who doesn't like to lift things, but the shoulder dolly definitely has his approval.",
    "This handle is very industrial. It is probably more than I need at my house but should last forever. Works great.",
    "THESE SANDING DISC ARE REALLY TOP OF THE LINE. THE ADHESION IS GREAT AND THEY REALLY GET THE JOB DONE FAST. YOU CAN'T BEAT THE QUALITY OR THE PRICE.",
    "Love the fact that it swivels however I needed a heavy duty hanger. I bought a different one since this one had a weight limit of 7 lbs.",
    "One of the better heat coumpounds on the markey today. Go for it. It works great!!! Greasy stuff. Hard to get off your fingers LOL",
    "It is ok but fust a little loose. When you go by the setting you have made and need to come back there is too much play.",
    "I needed a ball for my new wall mounted flag. The one inch acrylic ball is great. I sanded a spot flat with my dremel and drilled a hole in the ball, cemented it on thin plastic stick I had left over from the flag for my scooter, dripped gorilla glue in the flag mast tube and stuck the thinner stick in it. Now I am getting silver metalic spray can to paint the ball.Next time I would get a 1-1/2 ball however. But I want this ready for memorial day.",
    "I find this soap to be a bit expensive, but I have not found any other soap that is as gentle as this product. I get severe eczema on my hands, and every other brand of soap that I have tried seems to increase the irritation to my hands. This soap does not bother them at all. If I use another brand of soap for even a few days I start to have irritation to my hands and I immediately go back to the Dove liquid hand soap. Within a few days, the problem is starting to clear up (note: this soap does not medicate my eczema, but it IS gentle enough that it does not contribute as an irritant).If you have problems with eczema or if you have to do frequent hand-washing, I would highly recommend this product. I have found the expense is worth the benefit to me!",
    "I have a 10 inch version of what we call Texas Tweezers for cooking - turning bacon, meats etc. This 12 inch tweezer is great for removing clogs in shower drains or places that are hard reach. Also they can help with a clog in the vacume line, grip a wet paper towel to clean the inside of a humming bird feeder bottle - there are innumerable uses for these tweezers. I have had them for well over a decade and they look and work like new.",
    "I use one of those industrial upright vacuum cleaners and every so often something (usually someone cleaning up a mess of shredded paper) gets trapped down by the brushes.I bought these knowing they were a foot long to clean out those nasty vacuum clogs.",
    "I like it. Not sure how well it compares to other similar products. It does its job. No complaints. Fits well on the grinder.",
    "We converted a set of twin mattresses to a king. This strap worked out perfectly. Kept everything tight and in place.",
    "I wanted to get some heavy duty hooks for 1/4 thick peg board. I didn't want the dual thickness hooks which are much thinner material. These fit the bill. It provides a nice assortment for general purpose items.The only drawback I have is that some tools, when removed, can loosen or even take the hook off. It just takes some extra precaution when removing tools. After I get all the tools into the appropriate spots, I plan to put a little adhesive on that lower peg to make them more secure.",
    "I have 6 of these on a DIY table saw mobile base. Work great. Table does not move at all when locked down. The wheel and the swivel lock wich is a feature I have only found on these.",
    "highly recommend I use these lil guys on everything from doing my own nails to using on my unpolished rocks to shape them and to make tiny holes in pendants etc....love this",
    "This product was \"paired\" with the SKIL 2364-02 7.2-Volt Lithium-Ion Drill/Driver that I ordered. However, the \"quick release\" piece will not fit this drill. It is just a hint too big. Needless to say I was a bit disappointed. All the drill bits fit fine though.",
    "I bought this magnet to mount on the under side of my motorcycle to trip the red lights. There are products on the market called \"Red Light Changers\" that are specifically made for motorcycles. They are nothing more than a powerful magnet and cost 3 to 4 times of what I paid for this one. This one has an eye loop in the center which can be unscrewed and the same hole can be used to bolt this to your motorcycle. It works! Whenever I approach a red light, the magnet sends a signal to the magnetic loop in the street and the light changes. I suppose it would work great as a retrieval magnet also, but that's not why I bought it.",
    "Actually we used Loctite 310. but this is the stuff to put your rear view mirror back on your windshield. We tried 3 different adhesives supposedly for windshields and rear view mirrors available from Discount Auto and Walmart and none worked. We even gave them overnight to set up. Loctite 310, an epoxy, worked in 1 minute.",
    "Needed this drill bit when installing frame bolt-in connectors. This drill bit drilled holes into frame crossmembers without a problem. According to the paperwork included with the drill bit, it showed that the drill bit was made in the USA. Nice to see considering the flood of Chinese tools on the market.",
    "I bought these to use with my Senco screw gun and have worked flawlessly. The 2\" depth gives a stronger hold and for the price you can't go wrong.",
    "Once you go 3M, you never go back! Honestly, once you try them, all others will seem either too stiff, too soft, too wide, too narrow, too sticky or not sticky enough... Well, well, well, this is it then!This is perfect for heavy duty jobs. For every-day stuff I use3M Scotch Super 33+ Vinyl Electrical Tape, .75-Inch by 66-Feet.Don't think twice, don't look at other crappy tape, and don't bark at the price - you'll get a hefty roll with plenty of tape for the price, but most importantly you'll enjoy every time you use it :) Have fun...",
    "inexpensive set, but seem to go up in smoke in even soft wood. great as a second set for backup.",
    "Bought these for my Dad, so he wouldn't come in from gardening with scratched up hands... These are comfortable, fit very well, are soft, but tough too.",
    "Pro-Mask tape performed excellently. The tape stuck to floor, window, painted wood, and painted sheetrock. No adhesive residue and the tape stayed during the period I needed it to (approx. four hours). I would definitely buy again and I definitely recommend!All the best,Jay",
    "it is worth every penny. helped me carry 50 sheets of 1/2 inch drywall into the basment by myself. I couldnt have done it with out this. panels slip a little if not held tightly but overcame with addition of 2 side tape and piece of 280 grit sandpaper.",
    "Great if your doing asset management and viewing link lights at the back of computers or trying to view a port numbers in tight places without moving users desks. Can also be used to check for bombs under toy cars.Cons: Doesn't hold the mirror well when its horizontal and fully extended.",
    "I bought this for working in aquariums, but i have found many uses for it since I've bought it. It's holding up pretty well.",
    "Had vise in my shop for over two years, used and abused.This vise is a Beast, also no problems with pipe jaws holding pipe for threading. Very happy with vise",
    "I loved this steamer at first. It was great for cleaning in hard to reach corners and the crack between the counter and stove. The problem was that it quite working after only about 4 months. Steam stopped coming out of the hose assembly, and shortly after that the ready light stopped coming on. It doesn't do anything when I plug it in, and Euro-pro is impossible to deal with!",
    "I bought two of these. I followed the directions carefully and mounted both. Both seemed fine. One fell down and the other stayed up. Can't tell you why it fell, but I lost confidence in these and decided to go a different route.",
    "Seam on outside of right hand was poorly sewn and unraveled on the third day. Having repaired this myself with my wife's sewing machine the seam on the right middle finger split open. The quality control on these gloves is very poor.",
    "These are some of the best bits I've ever used for rough electrical boring in wood frame construction. They last much longer than spade bits and are easier to handle than a traditional auger which tends to bind up pretty bad and give your wrist a twist when the drill is not perfectly straight. The larger sizes should be used in a corded drill with a handle, but unless you're drilling through butter that's a requirement of any bit larger than 1/2\" anyway.These bits won't cut a nail, but they also won't be destroyed by it like a spade bit. You can touch up the bit with a file or dremel to extend the life. The shaft can take some serious abuse without bending to the point of being unusable.",
    "Allows variable hole drilling. Made a nice job of drilling a clean hole in my skis (for attaching cord for crevasse rescue). Given this was drilling through a mixture of ptex, aluminium and plastic I was impressed by how neat the hole was.",
    "The Snappy Self-Centering 5/64\" Drill Bit Guidemakes it extremely easy to start a hole in ametal pipe exactly where you want it - a jobwhich normally is difficult, and often resultsin a hole where you don't want it. This productis well designed and a pleasure to use.",
    "I used this to remove a stripped approx. 3/16 diameter metal screw/bolt on my 13 year old Harley, which was frozen by age/rust. However I would not have been successful, had I not prepared it before employing this tool. First, I went to the local auto parts store and bought a strong penetrating rust dissolver. (I used something called Freeze-Off, but there are also other brands.). After applying this spray as directed, I used a hammer and punch to give several sharp blows to the offending screw. Then I used this tool to drill out the screw before inserting the other end to remove it. When removing the screw I found doing it manually worked after trying to use an electric drill failed. I inserted this tool in a pair of vice grips and the screw came out with only moderate torque. An appropriate wrench or channel locks would also work. In short, this tool will do the job on an automotive application if the screw is prepared so that minimal torque in required.",
    "I got these to do... well... what else? Landscaping! Up till now I justed used the cheap, throw-away gloves you get at the store. None lasted longer than a month at my new landscaping job. I wanted a pair that were going to last a while and be comfortable to wear. These are those gloves! I have been using (and abusing) them for over a year now and they have not even popped a stitch yet! All the others tend to start loosing the fingers within a few weeks, but the whole glove seems to be stitched together very well! I also tend to sweat a lot at some of the jobs and almost forgot that these gloves come with a handy built-in sweat rag. Just whip the back of the thumb across your forehead! The sweat rags, for how small they are, absorb and evaporate away A LOT of moisture out in the hot sun. These gloves surely take a beating and keep on digging. For those in landscaping I highly recommend these gloves - they are definitely worth the price!",
    "They say when it rains, it pours. And sometimes life just unzips and drowns you like a urinal cake in a rogue tsunami. That's how it's been at the office lately. And now I've been struck with that most insidious of office nuisances: workplace theft.Every day, I'd find something else missing at my desk. First, it was Post-Its. Then my three good clicky-top pens. Mousepads, headphones, those emergency airline bottles of gin in the bottom drawer -- all gone. I resolved to fight this sticky-fingered felon, and to protect what precious little stuff I had left.Finally, enough was enough. I bought six cases of this sticky goo and pasted every single item left onto my desk. Permanently. That'll teach some thieving no-good to pilfer my stuff -- just try taking something NOW, tough guy.Of course, I couldn't actually work any more, what with the mouse glued to the pad and the pad to the desk. Or all my notebooks stuck in place, or the telephone permanently fixed in its holder. But none of it disappeared, either. That's what you call a 'tie'. And I'll settle for a standoff, every time.At least, I would have. When I got to the office the next Monday, the whole freaking desk was gone. Maybe it was the thief, maybe the boss figured out that I was doing even less than usual and sacked me. I didn't stick around to find out -- I took one trip around the cube farm, grabbed all the Post-Its and mousepads and clicky-top pens I could carry, and got the hell out of there.Hey, if they didn't want me taking stuff off their desks, they should have bought six cases of Krazy Glue. This is how we learn, apparently.",
    "This was used to go inside handbags...it was a lot cheaper to buy it this way...the only struggle I had was cutting it..as I didn't have the proper tools :/",
    "If you're looking for a cheap strap to tie stuff down to a roof rack or other similar application, look no further. They're good straps that are skinny and pack well. The locking mechanism is in the middle range as far as ratchets go - it gives you no mechanical advantage, but works really well. My only gripe - the box states in big letters that it is 4 times stronger than standard webbing. It's rated at 100 lbs. working strength, 300 lbs. break strength. I don't know what Master Lock considers 'standard' webbing, but the last spool I bought was rated at almost 14 times that. Don't even think about trusting this webbing for any heavy duty application, like pulling a car, climbing, or slacklining. It'll snap in a heartbeat.",
    "The parts arrived in a reasonable timeframe and were exactly as described. It was exactly what I needed for the job I had.",
    "I bought these gloves as a Christmas present for my dad. He has used them quite a bit since then and tells me they are really comfortable and durable. He uses them to split wood outside. They are great quality and look nice!",
    "Couldn't find any presized boxes with lids in order to store some collectables and went ahead and made my own boxes and lids. The Kraft Packaging Tape was essential towards making sturdy and attractive boxes. Did not have any problem with a lack a of tackiness or stickiness, and tape stuck to the cardboard I used very well. Tape arrived in a sealed zip-lock bag. Would recommend. Excellent product and fast shipping.",
    "Our white vinyl fence got some damage during Hurricane Sandy, and the style fence we have is no longer available. I was able to repair the pickets with some glue and clamps, but there was a large split in the lower horizontal rail that was quite unsightly.I used this white Duck Brand electrical tape (and some of the same brand white duct tape) to patch it up. It does a great job of making the damage unnoticable and also will hold the fence section very well structurally. It was great for getting some protection and support around the smaller cracked areas. Electrical tape is a must have item around the home, and I like having a roll of white in addition to the usual black. Also makes great ad-hoc labels - small piece of white tape and a sharpie!",
    "We had dug out our teapot collection and had finally found a great place to display all of them. The drawback to the display location was that it was on top of a bookcase that is 15' tall. Museum Wax to the rescue! All the pretties are now safely and securely displayed. Great product and super fast shipping from this vendor. Thanks!",
    "I have a grid on my wall that holds my kitchen tools - I can't remember where I got my other hooks but needed more - and these worked perfectly because they are long in the back so they prevent the hook from moving!Will probably order more soon!",
    "Worked OK for what I used it on the slide of a RV trailer.when it was closed for travel on the road.",
    "I purchased this Vac with the hopes of having something lighter than my Kirby for my three stories. I am dissapointed with its serious lack of cleaning power on rugs. Hard surfaces it does well. If you have all solid floors, go for it...rugs....don't bother.",
    "This is a good CPU cooling fan.Pros: It keeps your CPU at a low enough temperature and is much quieter than the original stock fan. I recommend this to people who like gaming, but don't want to spend a whole lot on a super high quality fan.Cons: If you are overclocking this may not be the fan for you. Also, It is not silent, but it is pretty quiet.Overall, A good buy for its price range, but there are certainly better fans out there...if you want to spend a lot more on them.",
    "The gloves feel well constructed. They've got a great grippy texture on the palm. And they are reasonably warm in cold weather!",
    "I find this product to work very well on glass and other hard surfaces. Just get the feeds and speeds right.",
    "it works well, i have two posters that are really thick and these were able to keep them up on my wall. i also have these small metal signs about the size of a piece of paper but a thicker and didnt think they would work, but they were able to keep them up, a few weeks and no issues yet",
    "I needed a ratcheting cranks to fly 100+ lbs. rental fast fold projector screens. These fit the bill. Built sturdy.",
    "I bought these based on the recommendation of a previous reviewer. The seal on my Nissan 14oz Leakproof Insulated Travel Mug broke when I was washing it, and without the seal, it wasn't leakproof. These work great. Thanks, previous reviewer!",
    "I bought this as part of a gift. Good craftsmanship, the name speaks for itself. I bought the actual drill, the bits and one other piece, which made a nice ensemble.",
    "Works great. The only possible drawback is the length of the hose. It does not reach all the interior of a car.",
    "it was what i was looking for it came when it sad it would. it was fairly priced.worked well with the project i was working on .",
    "Nothing fancy - but it easy to assemble and it does its job well. We are using it to hold a 15gal barrel full of liquid that has to be mixed, and I don't have to worry about the barrel tipping or loosing balance.",
    "The aluminum bar was exactly what I expected it to be. I had to bend the bar into a shape which was not too difficult. It was shipped quickly and was in perfect condition. I would buy again and recommend buying from these guys.",
    "These are high quality EZ outs that work really well for hex head bolts. I use these for motorcycle repairs. Prompt delivery and great price. I definitely recommend Hanson Global for tool purchases.",
    "No one's fault, I probably overestimated the size. It's comfortable, warm and extremely good for motorbiking on a cold day. It's reasonably-priced too!",
    "I needed a bit to make 1/2&#34; holes for wiring and wanted something that would drill quickly through 2x lumber. This bit works great especially compared to spade bits.It also tends to self feed instead of having to force it as with a spade bit. I would not hesitate to recommend it for any construction type boring.",
    "This product does not work at all. Color of the strips would not change a bit, even tested it with vinegar.",
    "Quakehold - GREAT Product. Holds objects in place securely. Easy to reposition. Does not stain or discolor area where applied. Only requires a small amount of Quake Hold to position objects - package contents will go far.",
    "Just as advertised and works great! Makes an awesome fence post puller, which is why I bought it.... :)",
    "must of hit a nailsoon ,they dulled immediatly ,and once dull they did not move to fast .the standard teeth type might be better. but the self feeds are still better.just my experience . for all that money it sure let me down .maybe there is something they excell at?",
    "I use a cordless drill so much that I have a holster for it on my toolbelt. I have tried many different &quot;quick change&quot; bit holders. This is the only one that doesn't get pushed back by the holster. All the other quick change type products are to big and would constantly get pushed back and release the bit causing it to fall out. It's slim design is great. Why do the other manufactures make such big clunky ones? BUY THIS IT RULES.",
    "I recently purchased this product because one of my gutters had separated from the roof line and was sagging anytime we had rain. The fasteners which were originally used to hang the gutters are long spikes which had worked their way loose. This product comes with a spacer (which ensures you don't collapse the gutter while fastening) for each screw and the square drive bit needed to drive the screws. Each of the screws is slightly wider than the original hole made by the spikes so the screw threads get excellent bite. This product far exceeds original equipment by far.",
    "About one year ago I, and my wife, were transferred from a West Coast rural community to Manhattan NYC. We bought, after much effort, a small two bedroom prewar apartment in Midtown NYC. Though we love where we live we do not have central AC and often open our windows. I can not describe to you the amount of filth, soot and crud that we found settling on our floors, area carpets, furniture and walls! Our newly purchased \"never lose suction vacuum\", lost suction and died, steam mops, regular mops, and dusters could not keep up with what can only be described as a daily layer of toxic effluent settling on our lives. Then, one day, we needed our dishwasher serviced and the repairman used a this Shop-Vac wet/dry to clean behind the dishwasher. He took a small amount of water in a spray bottle and removed about inch of built up crud with the vac. I immediately decided to purchase the very same model from Amazon. Let me tell you what you can do with this thing. I wet our floors, with a very thin layer of soapy water, and sucked up all the water with this tool. The water was jet black and filthy (after having mopped it the previous day), I used the same procedure on our furniture and area carpets. The amount of crap I picked up was amazing. My wife's allergy problems have cleared up, our socks remain white when we walk on our floors and we use less in paper towels and cleaning fluids when cleaning. The HEPA filter is excellent when doing regular vacuuming. Here is my advice, you can spend $500 on a fancy vacuum and $100 on an upholstery cleaner, or $95 on this and you will not believe how well this works. One note, however, this is only a \"miracle tool\" for bare floors, hard surfaces, upholstery and area rugs. If you have wall to wall carpet, you'll need a regular vacuum. By the way, when you read the one star reviews be aware that the attachments should be self explanatory. If you can not figure out how to \"attach\" them well then you should seek professional help as it is unlikely you are capable of doing anything else that requires a little common sense.",
    "6 bits could be sold separate but thats marketing. Very pretty wood box they come in but a plastic pouch would serve as well and be more cost effective. The carbide drills will easily penetrate the super tough stuff!",
    "This steamer is really a useful appliance! After steam cleaning everything I could think of in my home I decided to buy two more of these for my grown children to use in their homes. I wish I had seen the Amazon price before I bought it, could have saved some money!!!!",
    "Very good glove. I built a 24x32 IPE deck in the backyard this summer and these gloves were on my hands everyday. Everything I did to construct the deck was while I was wearing these gloves from the concrete work to sawing, cutting, drilling, and applying the oil for weatherproofing. I could take deck screws out of my tool bag with no problem. Great glove. You will not be disappointed.",
    "awkward for about 10 mins. It makes large appliances easy to move without getting sore for 3 days.",
    "3M makes the best spray glue but this one is limited because of the spray form. It's not so much of a spray as it is a \"goop\" that shoots out. Nothing but a gooey mess this leaves you with. I guess I'm trying to say that it's not the best user friendly spray glue but it's strong. I can imagine this being fine for some type of lumberjack but not for my dainty little arts and crafts I do. I tried most other spray glues but 3M is usually the way to go.",
    "If you know what grade 316 stainless is and are familiar with its proffered and how to machine it,all I can say its they delivered what was promised without any problems: an unpolished rectangle/flat bar 1/4\" thick, 1 1/2\" wide, 12\" long for a little over $13.00.For background stainless steel 316 is one of the most corrosion resistant of all the common \"austenitic\" (any grade of stainless in the 300 range) stainless steels. It is sometimes called marine grade stainless because it resists corrosion even in the presence of saltwater. It is often called A4 stainless on metric sized fasteners.If you plan on using this for a project requiring machining -- like drilling or milling -- keep a couple things in mind:1) Don't even think about trying to drill without coolant. If you value your drill bits life, use LOTS of it, literally keep flooding the area with coolant from start to stop. If you don't have any real coolant, try regular olive oil.2) You can drill this with high speed steel drill bits, but cobalt bits will last longer because this process generates heat that cobalt can deal with better than high speed steel. If possible use a drill with an angle around 135 and if you can use a shorter \"screw machine\" or \"stub\" length drill rather than the standard \"jobber\" length.3) Drill a with lot slower rpm than you are used to for regular steel or (especially aluminum) and keep the pressure on. If you need to disengage from the cut, pull it back completely out of the hole immediately -- never let the drill just stay rotating in the hole without a good bit of pressure applied. It is much easier to do this on a drill press or mill than with a hand held drill because you can maintain pressure without flexing the bit (which can cause it to snap) more easily on a press.4) Make sure your bits are SHARP. Don't even bother trying if your bit is the least bit dull or worn.5) You can do this even if you've never machined/drilled a significant hole in a real metal before -- I first learned about metal cutting using Titanium 6al4v, which is a lot like this material as far as drilling / milling strategy goes. I never understood why people said it was so difficult to machine until later when I worked on mild steel and aluminum -- if you're used to those metals or try to machine this like it is those metals, you will likely be quite frustrated.6) This product comes unfinished (scratchy). If you want it to look half decent, use a disc or belt sander, start at 80 grit and work your way up to 400 to 600. It should look pretty decent by then. If not, move on to buffing with buffing wheels and appropriate compounds.I hope this provides a decent review of my transaction, plus what this stuff is used for and what to do with it so people can decide whether its appropriate for whatever project they're working on.",
    "Couldn't find these at any of our big box stores, local stores and department stores. The only place with a good price was Amazon. They're just great for holding cables in place. I highly recommend them.",
    "This is a very good jack considering how cheap it is. I have the 20 ton model and used it to raise the center beam in my house which was sinking. I gave it 4 stars because the handle used to raise and lower the jack seems to be weak--not a big deal. Overall, this jack is well worth the money.",
    "What everyone says on here is true. This stuff never cures, and I am livid. Maybe the cure temperature is -100degC, who knows. Home Depot managers who made the decision to still sell this stuff are complete idiots. GE, put silicon sealant on your R&D list...this product reflects your image."
]