[
    "This little thing is great so far. I even used it to pump up my motorcycle tire (just to see if it would work). While it did take a bit of effort and the pump does get a bit warm from friction, the bottom line is that it worked. Great little pump for the money.I even thought about buying another one for my motorcycle, and I still might, but I obviously cannot carry a spare motorcycle tire with me....I would just use it to \"top off\" my tires when needed.",
    "They deliver - exactly what I wanted: socks that help me avoid blisters. A bit of a pain to put them on, but they are worth it.",
    "This is the best knife i could never ask for, it's so sharp and durable, i sharp it like 4 months ago and it's steel very very sharp.",
    "The Ogio Atlas is a well thought out bag with plenty of great options. Their patented rain cover is very cool,the best I've ever used. The bag is stylish and offers enough pockets for just about anything.The top club divider is awesome. The only drawbacks I've found are these: If you ever want to store or transport your golf shoes in your bag don't buy this one. There is no way to squeeze your shoes into the side pockets. The material is stiff and the pockets are very narrow. The other bothersome feature is the umbrella sleeve, which leaves a normal sized golf umbrella sticking up higher than your driver by about 4\". If rain isn't in the forcast, you don't want to just leave the umbrella in the bag, it's too annoying. Otherwise, a very nice bag.",
    "This is my second Seiko. I still have my first. With this watch I see some well thought out improvements. The crown and both side mounted push buttons lock. This feature is long overdue in my opinion. This prevents accidental activation of the stop watch , or advancement of the time on the alarm. On the down side I found the owners manual a little vague, and lacking in instruction compared to the manual I got with my original Seiko. Also, I had to pay to have my band sized. On the original Seiko I bought, there were many adjustments available. Over all, I love this watch. It is beautiful, functions flawlessly, and has a very good feel to it.",
    "Zipper seams coming loose, zipper pulls came off and the handle on top broke in half. This is only used as a school bag and not abused.So sorry I gave this as a Christmas present.",
    "It tells time (surprise surprise..)It has a chronograph.I've had it 3 years and the battery hasn't died once.It doesn't look to bad.For $11 you really can't do much better!",
    "I've never liked throwing my cigarette butts on the ground after smoking outside and hated putting them in a pocket or pack because of the smell. Now I just put them in this.Because it snaps tightly closed with a \"click\" there's no lingering dirty ashtray stink following me around and no litter trail left behind. It slides apart easily for a quick and neat emptying into a trash can.If you're a conscientious smoker, this little gadget is a great item to carry.",
    "I would have liked to have and use this. Unfortunately, it's so cheaply made that it wouldn't work when I took it out of the box.",
    "Spent $35 total on this cover and its far superior than the $60 one I bought from Lowe's awhile back. The AU logo is perfectly straight and isn't cheap looking at all which is what I was worried about since it was so cheap. The fabric is touch and 100% waterproof.Actually gave this cover to my dad cause it was abit tight since I have a double lid grill so I bought the same cover from the same manufacturer but a 68\" model cuz i was impressed with the other one. Either way....I am glad I bought 2 of these now.Highly recommended!!!",
    "Our grandkids love playing with this. Great quailty. Adults enjoy it as much as the kids do. Arrived on time and was just as advertised.",
    "Overall this is an okay karate uniform. The material is light yet feels robust and the stiching is good. However, beware of the drawstring pants as there are good size slits in the hips which can expose ones underwear. If one is skinny it may not be a problem, otherwise decorum necessitates safety pins or a sewing job.",
    "The bulb fit the princeton lamp I bought 2 years ago and which bulb crashed last year. That is great !",
    "It gives good performance for a 3 inches in/out blower. For the same price as equivalent ones gives about 50 cfm more than other equivalent blowers. Installation was very easy. The noise level is minimal.I am very satisfied with the unit. I would recommend it to other people or friends.",
    "Bought this as a gift and is great! Definitely worth the price as it is a great value for the quality.",
    "I purchased this weight tree after being disappointed by 2 previous ones.I had hoped that this tree would live up to the expectations that come along with dropping this much money (not that it's cost-prohibitive, just that a Benjamin is a lot of money to some people, myself included), I expect quality. To say the least, this is not.I can't actually give an opinion on the assembled product. Mine arrived with missing parts; but even if it had arrived with all the parts, I'm not sure I would have been able to decipher the exploded assembly that they gave: AS THE ONLY INSTRUCTIONS FOR ASSEMBLY. Seriously, as though not receiving all the parts wasn't enough, they expect you to be able to fully assemble their product with simple, caveman instructions.It's just been headache after headache with weight trees for me; perhaps my expectations are too high. But when I can't even assemble a product, something is wrong.",
    "Apparently the 50mm don't exist, as I tried to order them, but received the 54mm twice. When asking Amazon and the sunglasses company why the mistake kept happening, neither owned up to the issue, or could even answer me.",
    "For anyone in search of a Nerf Turbo replica, this is not it. I bought this due to the favorable reviews but I actually own an original Nerf Turbo and the Poof is definitely a lower grade knock off. The original turbo is quite a bit heavier than this ball and throws a much better spiral. To get this Poof to throw a tight spiral you have to use your wrist instead of your arm. It also \"quacks\" if you try and throw it long distances. It is a decent attempt at replicating the classic Nerf Turbo but ultimately falls short in several areas.",
    "I love my Swiss Army Edelweiss Pocket Knife. It is sharp and great looking too.",
    "This rack easily fits on my 1998 Jetta, almost like it was made for it. It's sturdy despite being relatively inexpensive compared with other rack systems and easily (and quickly) disassembles. Plus it looks cool.BUT...Do not buy from The Rack Warehouse. Worst customer service I've seen in a company in a long time, and honestly, that is saying something.",
    "I just got my tri lite folding chair in the mail. IT'S INCREDIBLEI can hardly believe how light it is and easy to assemble.and it works.my hats off to whoever I designed it .Jane",
    "I bought this for my waterholic son for his birthday (at his suggestion). It seems a bit expensive but once you get it, you realize why. It is both lightweight and sturdy. I think I'll be buying 3 more for the rest of my family members as we are all constantly carrying around a bottle of water-to the gym, in the car, in the yard. A practical yet much appreciated gift!",
    "Worthless. Half the time it doesn't work -- picks up other monitors, or doubles your heart rate, or doesn't show one, or shows a ridiculously low one. Nice, when it works, but completely unreliable. Don't waste your money.",
    "I really like this watch. I'm always satisfied with my orders from Amazon. I really the features of this watch. It does everything I need it to do. The watch keeps track of my progress, and keeps me motivating in reaching my goals. Love it. Thanks!",
    "Used this bench shooting a Mosin and a Remington 700, sucked up all the recoil, shoulder felt fine after a couple hundred rounds one day.Tried it trap shooting and it was hard to mount the gun smoothly. So, I would say it has limited applications.Good price though.",
    "Great product but had to send back! We have 49 lb Heeler who has more sweaters jackets than me. Wife loves to dress him! We have always bought med. except one saddle bag we ordered large because of review warning. Well we decided to order lrg. but when it came it would not fit over Clints shoulders. Just requested return hope we can get the X-LRG Quality seemed very good!",
    "The selection and description of quantities led me to believe that I would get at least 3 times more. This is undoubtedly the smallest amount of heat shrink I,ve ever received for the amount I paid..... Very disappointed!",
    "These WILL FIT a H50 water Cooler. Buy them for Push-Pull config. Increased my cooling at little cost to me.",
    "nice lights for the money,everything you need comes with the lights.i had no trouble mounting them on my express 2500 and the most important thing they make a world of a difference when driving at night.make sure you point them right beneath the driving lights and no cop can ever ticket you ( at least in pa ) for having them on.white bright light very powerfull.dont even think about it just get them and you will not regret it.",
    "The Razor scooter was a gift for my 5 year old niece and she loves it! It was such a hit, her brother is hoping for one for his birthday.",
    "After reading several reviews I went with this rack. A lot of racks got lousy reviews because they were loose and rattled in the reciever. This one arrived promptly, was easy to assemble, and easy to use. It doesn't rattle, seems very secure in the rack, and has done well on the couple of trips I've used it on so far. The tilt-down feature makes it easy to open the rear hatch on our SUV without removing the rack.",
    "This will work using one burner only on the stove when connected to our RV exterior grill connection port. Our camp chef portable stove has one large and one standard burner. It would only operate on the standard burner due to the low pressure regulated on the RV piping system. Be prepared to break out the standard propane tank & regulator hose set if you plan on running a two or three burner camp chef stove. Rating is 4 stars due to the price and short length at $35 price tag, it could have been longer.",
    "I really like my watch. It's stylish for work and yet durable for yard work. I didn't give it 5 stars because it's difficult to read the digital display wearing sunglasses.",
    "The towel was soft and good quality. The Steeler emblem was clear and concise.After washing, the towel maintained it's softness.",
    "First, the good news. The rack went on well, no small issue because I have disk brakes, and needed a wide rack. It is sturdy as can be, and I have no qualms about loading it to the gills.Now the bad news. These are great racks IF you want to do what TOPEAK thinks you should do with your bike. Sadly, topeak and I disagree. So, I tried to mount my open top city panniers to the rack. The rack tubing is too thick. OK, I can modify that. So, I think I would like a narrow trunk rack so I can use my shopping panniers and still have a zipped space to store my raincoat etc. etc. I tried going to a brick and mortar store to actually look at the trunk racks and try them and see if they'll fit. The answer \"Topeak has changed their system so often we no longer carry them. We can special order, but thats it.\" Oh well, no trunk rack for me I guess. Finally I thought perhaps I would mount a flasher on the back of my rack. Two choices here. Buy the proprietary Topeak back lights, or take a hack saw to the rack to modify it.My recommendation find a company that makes racks and doesn't try to be overly clever.",
    "I got this product exactly when expected and it was exactly what I was looking for. Can't wait to use it.",
    "I had the original, which was made from cast metal and was great, this one lacks quality and is a piece of plastic junk!",
    "The training wheels came on time and product quality is as promised. They're sturdy and work great! I look forward to watching my granddaughter having many hours of fun.",
    "Cheap junk son drop it on the ground and barrel broke off, laser broke in house first day before even playing out side.",
    "I used this products for many months in my backyard and most of the time it only keeps Gopher away for 2 days. Occasionally, this works up to two weeks. I am going to try a less expensive and more efficient way now.",
    "I use this as a spotting scope for target shooting. So far everything I've looked at and worked with gets dicey at about 500 yds. It just depends on the conditions. But a rule of thumb is if the sun is out and you aren't being barraged with thermals you should be able to see at minimal 500 yds. So far I have not been disappointed in what I got for the price. When there are no thermals and good light, I can see very well at 500yds.I also like it's field of view. I was actually watching 4 targets the last time out without moving the scope. These are 12\" x 12 \" targets.I have a Schmidt and Bender 56mm scope and it's brightness and optics are actually better, but we are comparing a $2000 + set of optics to a &lt; $500 set of optics. I also have a NightForce 56mm scope and I would compare it's brightness as a little better.I have had quite a number of people use my scope for spotting and they are really amazed at it's performance vs cost. So I would say that if these guys would put in a MOA or mildot reticle, they could sell quite a few more to people who are in the sport of long distance shooting.At 600 yds on a good day like the last, I think this would have been fine. But no matter what scope you get, there are going to be some days you just have to walk up.The only reason I gave it 4 stars is that it doesn't have a hash reticle option, and the optics are really not the best. But I think price vs performance this is a keeper. So far I haven't run into anyone who could see something I couldn't.",
    "I purchased this pack at about 1/3 of the cost of similar bags at the local outdoor retailer. While I am not a fan of internal frame packs, (personal preference), this pack did it's job. I hauled 45#s on a 6 day 25 mile trip into Oregon's Wallowas. The pack held up well, had plenty of pockets for separation of all my stuff. The pack is a little heavy at 5.5 #s but is worth the cost trade-off to me. Next expedition I'm going back to the Jansport Carson external frame because I can better distribute weight to my hips, has better air circulation to my back and has the frame to attach tent and sleeping bag to allowing for more room inside the pack.",
    "Don't have much experience with these types of solutions. I once bought something at Walmart that didn't work. I have used this SeaVision on my old goggles and had 50% improvement on the first use. Probably 90% after second application on these very old goggles. I also bought my wife new goggles. They fogged at 14 laps, but after initial use they did not fog for her even after her 25 laps.Pretty impressed with the results.",
    "Plano 53 Aluminum Rifle Case arrived at my home packed only in it's flimsy display box not packed in a suitable shipping box as a reputable dealer would. Due to not packing the item properly resulted in two large dents in the case. The case itself works well and is of decent quality. I would not recommend purchasing anything from this particular supplier due to their inability to properly pack and ship an item. However I would recommend the case itself. It works well and looks good (except for the dents)!",
    "These a great shoes if you are over 200 lbs. They give nice cusion and support, and the 4E's are nice if you need them. I ran a marathon in the rain and found out that 4E is too wide for me.",
    "I expected more from these Peltor . I am disappointed. they work fine on the sports shooting. But they practically do not amplify sounds when tracking game.Also upset about the lack of the original packaging. The brand label on it was blured. So is only three stars. :(",
    "I would have liked to know the density of the padding: Example: 1 through 5 - soft, medium, firm, extra firm, etc. The padding is on the soft side; it gave me some lower back pain, even on a semi firm surface. Also the mat could be a little wider and a little longer. I returned the item mainly because of the back pain. I wish amazon would look for a mat that is say 2 1/2 to 3 feet wide and 6 feet long with some firmness.",
    "I bought this bike as cheap starter to see if I'd actually ride it on a regular basis and I definitely got what I paid for. It worked fine for about a month (just long enough for it to be outside of the return period) and then one thing after another started to break. After daily 30 minute use, the bearing slowly started to squeak, the flywheel started tapping the magnet, and after about three months the belt completely disintegrated and broke. This thing is a piece of garbage and not worth your money. There is no support or warranty for it other than Amazon and you'll never get in touch with the manufacturer. I would only recommend it to those that want to find out if they're serious about riding before getting a better bike. Any normal user should stay as far away as possible and spend the extra $100 to get a nice bike like the Schwinn 120.I'd love to give this 0 stars, the fact that it has an average of 4 is ridiculous. Look through the user reviews and you will find plenty more like this one.",
    "bought this for my husband for christmas, He loves it because it matches his Brooks saddle that he has on one of his many bikes.",
    "Otis continues to make me happy at the cleaning bench. I have many other Otis products and this brush fits right into the satisfied list of my other Otis cleaning tools.",
    "These goggles are very comfortable, don't leak and don't fog up. However, they broke after only 2 months of daily use. I had them in the car, picked them up at the destination and the nose strap looked like it was cut in the middle. No idea how this might have happened. But I still bought another pair as replacement. Another small thing: Every time I lift my head out of the water, a little water drop forms on the bottom outside rim of the glasses - slightly annoying.",
    "The product is exactly what we were looking for. We needed some inner tubes for my sons wheelchair an these worked perfectly for the job. I would recommend this product and the price was great.",
    "I own several Cuddeback Cameras and just bought the No Flash to replace a older camera.. I was very supprised at the Battery life you get with this Camnera.. I bought another leading brand and can't get over 10 days of battery life ..If you want the best ?? put your money on the Cuddeback Trail Cams and don't learn the hard way and buy other Brands junk!!!",
    "I bought this as a gift. The shirt was heavy duty and glistened. The person I bought it for loved it and it fit well.",
    "I received this set of chips for Christmas. Although I do like the set these are NOT clay chips. If you read the description in one part they describe them as \"authentic soft clay look and texture\". However in the bullets describing the item they claim \"100% clay for a realistic Las vegas feel\". They are definitely not clay. Also the description is \"Color Breakdown: 150 White, 150 Red, 100 Green, 50 Blue, 50 Black\". My set is 150 White, 150 Red, 100 Green and 100 Orange.",
    "I HAVE USED THIS ITEM FOR YEARS WITH STRIPER FISHING. THE SMELLIER THE BETTER. THIS IS TRULY A GREAT ITEM!!!!!",
    "I recently purchased this bike for myself. After assembly of the bike, I noticed the poor construction, junk components, and typical hallmarks of an inferior bike. Definitely a good looking bike, but nothing to be used for the real trails. You are better off looking elsewhere.",
    "I have used this stuff in the distant past and it worked. This time I had old rusty motorcycle parts to restore and it did nothing. I think this is more geared toward simple shallow surface rust. Multi-decade hard core rust is not what it's for. I'm going to try evapo-rust, if that doesn't work it's time for a glass bead blasting.",
    "These helmets were used for our youth development program, great fit and the kids love em!!! easy to fit as well,",
    "Instructions show that it's a \"toolless install\". When I took it home to install on my Trek 1.2 road bike, it quickly became clear that the included straps are WAY too narrow for my bar. I'm not sure what bikes the included mount could possibly work with....",
    "ok, so it's not a great meal, but you probably guessed that.I bought several varieties of these pouches from AlpineAire because we have one person in our family who requires a special diet, and I want to be prepared for emergencies. AlpineAire makes several GF pouches which fit our needs, and I can find them easily at a local sporting goods store. In addition to this beef pouch I got the roast beef hash and the brown rice. None of them were horrible, just not great. They would definitely serve in an emergency situation and are much better than the camping freeze dried foods we had as kids. They do seem a bit heavy handed with the spices, which is a problem when you're feeding kids, but otherwise are acceptable.What you need to know about them:They do require clean, hot, water to rehydrate.The steeping time on the packages was always a little off- the hash never did quite rehydrate all the way down.Because you pour the hot water into the pouch- it becomes HOT!!!! and they don't stand up on their own. At least not the ones I tried. I had to prop them against something while they steeped, and one time the rice fell over and spilled some of the water. So be careful- not a job for the kids to do.There was a lot of water left in the bottom of the pouches. It made the last several bites very soupy and unappealing. I ended up draining as I ate, but it seemed that the left over water and the rehydrating problem are probably related. Maybe if you stir the contents of the pouch halfway through it would be better?All in all, they serve very well as back up food as long as you will have a source of clean water and a way to heat it. If you think your situation may be more dire than that- look elsewhere.There is a large variety of entree, side dishes and even desserts available. You can find them at stores like REI, or order direct from their website http://www.aa-foods.com/for other choices. The 2,or 4 serving sized pouches are nice and the website has other, canned items, that are shelf stable for a longer period of time.Bottom line: I will be ordering more for \"just in case\", along with water purification tablets and our camping stove. Someone said, wisely I think, that this stuff is like food insurance. And like other types of insurance, you're really hoping you never have to use it.",
    "Bought this scope for a scout setup on a Mosin Nagant and am really happy with the purchase so far...even though it says AO (adjustable objective) and it really isn't. Not the first time Amazon has misrepresented a product in the description. Not a big deal for me, but something to take note of.The long eye relief is perfect, the optics are really clear and crisp, and the materials feel like quality. My main complaint with this scope is with the windage & elevation adjustments. Honestly, they leave a lot to be desired. They are not \"fingertip\" adjustable by an stretch as you have to use a coin or a straight-slot screwdriver to make the adjustments. Even then it's hard to turn and is a real pain in the butt. The clicks feel a little mushy, too, but not horrible. Overall, it's a good quality scope with adjustments that could be much better, but I still highly recommend it for the price point.",
    "I had been looking for foldable bikes to carry in my motorhome that would fit in the underneath storage. I had purchased others but they were never compact enough to fit my compartments plus unfolding and folding back was a pain with the others.Mobiky fit the bill! They are absolutely fantastic. They fold in 3 seconds and unfold in the same amoust of time. Plus they easily fit in the storage compartments of my Class C motorhome. First glance will tell you these are higher quality than the other larger folding bikes. If you have been looking for the lightest, easiest foldable bike this is it.",
    "use this in the off season to keep in shape...have the one with numbers..just set it up in the back yard and throw 60 balls every 4th day and use it at the park for long toss...",
    "First off...There is NO other game that I am this picky about. My Madden gaming experience is important to me, because there is no other game that dominates my free time like Madden does.Team Madden dropped the ball on this one.I'll be the first person asking for something new in the bells and whistles department...but DANG! When the bells and whistles get so loud that you can't hear the fun stuff going on behind `em, you have a problem. The championship ring thing is just ridiculous! If I ever see someone \"sporting\" one of those things, I'm calling `em out in public for being a world class loser. Seriously, to think you actually accomplished something by playing a video game is one huge indicator for a serious need for counseling. I mean...i like video games too, but get real.My beloved Franchise Mode is now so freaking involved that I hardly felt like bothering with it. Why mess up a good thing with a bunch of extra crap that you now have to track? I don't know anyone that wants to waste HOURS just setting up a game unless there's some incredible gameplay involved afterwards. And thats just it...there isn't even \"OK\" gameplay once you hit the field. I know I'm not the only person that still feels like my players are ice-skating down the sideline when I actually got a chance to break a long run, or feels like they're not really in control of their runningback inside. I just hit some buttons and pray...you don't set up cuts anymore on Madden, you just hope that things work out. That's lame EA!Save your money people! If you don't have a backwards compatible PS3...get one. Then buy Madden 08 for PS2. You'll get a more natural feel to the gameplay, and thereby have a much more fun and satisfying gaming experience.PS,Don't get me started about how horrible the defensive side of the ball feels on this rip-off of a game!",
    "I purchased Madden 08 from here a while ago and though the package arrived promptly at the expected date, it was a while before I was able to play Madden 08. This because my copy of 08 was replaced with a copy of 07. It was 07 in an 08 case. In closing, DO NOT TRUST GAME FUNK!",
    "First of all, this thing is huge.. be prepared. The top was screwed down so hard that it took 2 people to open it the 1st time. After the initial opening, it still was difficult to both open and close. The final problem finished it off for me. It leaked around the spout while pouring. This was a complete waste of money.",
    "Good solid bars that appear quite indestructible. Sleeves rotate and collars fit with no issues. Good gripping surface to prevent slipping in sweaty hands. If you run out of room on the sleeves for weights you probably ought to consider curling or lifting steel train wheels or jersey barriers.",
    "The helmet got to me in a very timely manner and was much more comfortable than I had expected. There is inside padding that can be easily taken off if you so choose, and the look of the helmet is exactly what I wanted.",
    "This pair of heavy duty nets was defiitely built to last. The material is very durable and the nets are thick enough to withold the punishment that good shooters can put it through. Mine have been outdors, exposed to the elements (sun and rain), for over six months and have shown no signs thay are ever going to shread, as reported with theSpalding 8279S All-Weather Basketball Net (Red/White/Blue).On the negative side, I'm not sure they properly check the ball after each successful attempt. They do the job, but not as well as I have experienced from other nets. Perhaps this is due to the length, because as other reviewer commented, they are not as long as regulation nets. But for non-regulation/recreational basketball I don't think you can get any better.",
    "I love these socks! Lots of cushion and exactly what I wanted.I am a new runner and was told that these socks would help prevent blisters. I have not had any blisters yet (either because I can't run long enough distances yet or these socks really work, who knows).",
    "These tire levers are made of high quality plastic. They are very stiff and don't seem like they will ever break. Easy to use and they connect to each other. I would recommend it 100%",
    "I LOVE this watch...unfortunately, I sent it in for a warranty repair (condensation accumulated within the lens). It took about three months to get the watch back. They do stand behind their product, but it takes a LONG time to get it back. I have gone diving with this watch atleast 15 times and it keeps very accurate time. The mother-of-pearl face is really stunning.This is the 1st watch I've owned that I can honestly say I LOVE.",
    "used in industral type work for high places. The belt has a place to tie in to with safety ropes and hooks to stop falls.",
    "These knives are a bit heavier than you might expect if you're a seasoned thrower. Requires a little bit refining on technique to get it right. But once you have that down you can drill a target rather consistently. I have managed to become competent throwing left and right handed with these knives. They require you to grip towards the rear of the handle more of the traditional full hand grip. At least that is my personal experience. My throwing distance for a half spin is around 8 feet from my target. Throwing at a human sized quarter sheet of 3/4 ply. I have since gone to a 6x6 in. post which is an easy target to consistently hit. They are stainless steel so they can take a lot of abuse. But do not be detracted when they get nicks in the blades this is inherent of throwing knives it will happen with any knife if you throw them enough just be prepared for it. Other say their knives broke personally I have not had that issue. Maybe they got a lemon but I have thrown them pretty hard and have hit them on each other with no ill effects. I believe this will be a good knife for anyone seasoned thrower or beginner. I have no complaints",
    "My third one. Seem to lose them, once every couple of years. Some tools are too short to get into deep places but its a carry-on. Not as vesatile as the Topeak Alien but much more portable. Keeps quick fixes on hand in a neat little package. No complaints.",
    "I needed ear protection for the shooting range and for my workshop. This product delivers in both cases. Great deal!",
    "This is an awesome golf cart cover. I live in a community where almost everyone has a golf cart and this is the nicest one I've seen. It is easy to put on and fits perfectly.",
    "I love this bike rack. I don't need my husbands help loading the bikes. It's great!",
    "My 13 old year grandson is a very fussy dresser and typically wears only jeans. The Diadora pants are the only exception. He likes them because they are comfortable and hide his skinny legs. I like them because they wear remarkably well, hide dirt, and don't wrinkle, fade, or shrink.This Amazon purchase was convenient, economical and a good buy!",
    "I have been wearing Helly Hansen base layers for over ten years and they have been great since the beginning but the technology has improved so much that I don't think there is a better product out there! I am a Helly Hansen sponsored athlete from Canada and I recommend wearing this top!",
    "I bought this bike about a month ago. It is very heavy and my exercise room is upstairs off the master bedroom, so we had quite a time getting it up there. We should have opened the box and carried it piecemeal up the stairs. It would have been much easier.I am a 55 year old woman, and I am NOT mechanically inclined, but am proud to say that I put this bike together by myself. The necessary tools were in the box - what a nice surprise! It took about 2 hours, but I was being careful and enjoying myself.The bike itself is so smooth and quiet. I have a very bad lower back and bad knees and I would recommend this to anyone who needs to exercise but can't use other exercise equipment because of physical challenges. I can watch the news at night and exercise at the same time and feel good about doing it. It's easy to get on the bike because the body is open. I don't have to climb over anything. Nice job, Scwinn...",
    "We purchased this grill as a gift for my husband. He was looking for a smaller grill as we have a large one already. This is perfect! Not only was it the right size but it's portability made it even better. We also purchased the Coleman RoadTrip Cast-Iron Griddle which is great to cook fish, steak and cheese, grilled cheese, or anything that might fall through the regular grill.As we were planning to leave this standing much of the time near our pool the bag for it was unnecessary. The cover offered on here would have worked, but was a bit pricey. Instead we found that a simple kettle grill cover from Wal-Mart for under $10 fits PERFECTLY! We also found it much more economical to purchase a hose w/ fittings from Lowes and connect the grill directly to a large propane tank. No need to worry about smaller tanks running out if you're going to use it in one place much.Having used the grill several times now we are completely sold. As for a small portable gas grill it is perfect since it stands up, not table top. Also the gril rarely flames up and the grill plates wash excellently, even in the dishwasher.We highly recommend!",
    "This water bottle is very nice indeed. The build quality is great - no cheap plastics and thin metal. Solid all around.",
    "I decided to purchase one of these for an alterative to my stardard MPH and milage guage for my motorcycle. I finally got the space and connections correct and it seems to work. A front motorcycle tire is a bit odd, compaired to a bicycle tire - size and travel. The speed has been off about 5-9 MPH slow and I will need to mess around with the tire size setup to dial it in. Should not be a problem.........But...... for milege, trip odometer, clock, light and other calculations, this unit should work close enough for what I'm looking for. I'm glad they sell replacment parts (sensors, etc) here for this bike computer !!",
    "A very nice red dot scope.Precise and easy to calibrateNot expensiveNice grip on pistol receiver",
    "Nice product, well design does not move around with every pitch. Matter of fact, it does not move at all unlike others I have seen on the market. My son uses it to check on his accuracy rather that practice on it. He favors having a real catcher for practice purposes. If you are looking for a pitcher's practice aid this is the one to consider.",
    "This is a must for anyone playing. I used my to warm up prior to hitting balls on the range and most certainly just prior to teeing off on the 1st hole. You can really feel the weight on the end of the club and also you will note how light your club feels after removing the wight. All in all a very good buy.",
    "I got this for my Mail Lady, I live in a remote area and there are not many bathrooms around. She was very happy with them and told me they are life savers.I am very please with this product and I recomend this product to any one that may be stuck in the position with out a bathroom, ie.. truckers stuck in traffic,.Great product.",
    "I really love this pistol. It might be my favorite. My interest in airsoft is almost purely for collection and target shooting, not any kind of competition, and this gun really scratches my detail-craving itch.Pros:- Very durable. Mine still works perfectly after a bad drop. Some ABS plastic pistols feel cheap as soon as you pick them up, this one doesn't.- Maintenance friendly. The slide stop pin is removable, and allows you to disassemble the gun. If yours stops working, try taking it apart and putting it back together once or twice (I did this after dropping it, afraid it was completely broken).- Realistic. While the gun is mostly plastic (except the trigger), the mold appears to be dead on for a Colt M1911. Some airsoft pistols have inaccurate looking magazines, this is not one of them.- Functional parts. As a collector, one of my favorite things about this pistol is how many parts work on it. While the slide stop pin doesn't actually stop the slide, the grip safety and slide safety are completely operable, and accurate to a real M1911. The hammer also moves, which is always a nice touch.- Power. This pistol has a lot of punch, easily better than 300 FPS.Cons:- Hop up. .12g BBs are not accurate in my pistol because of the high hop up. Even .20g BBs seem to rise a bit when fired from my pistol. From other reviews, it sounds like this isn't consistent behavior for this model. The hop-up doesn't appear to be adjustable.Again, this is probably my favorite airsoft pistol thus far. If you're thinking about getting it, you should.Update: I like it so much, I decided to get a second in silver.Final note: If you want a second magazine for this pistol, Amazon has them:TSD Sports UA961 Airsoft Pistol 22 Round MagazineThat item is only 1 magazine, but it fits the UA961 (this pistol). The magazine in the far left of the picture is the one you will receive.",
    "Despite the adequate number of pockets, they don't hold as much as you would think. They are not \"full\" enough without much \"give\", so items tend to fit too tight against the core. And with a Sun Mountain Speed Cart, the bag does not fit because of the rear location of the putter well.Additionally, there is only one ring to hang anything on (like a towel or a ball pouch)... and that ring is on the very back and not accessible. Also the cooler pocket barely holds a 32 ounce drink; it has to be put in at an angle and is a very tight fit. Good luck with multiple cans of drinks.The 14 full length individual club slots are very good. Also the bag material is very good and strong. Overall, I rate it a \"B-\"",
    "Got the flag I want at the stated price and within delivery timeframe. Easy way of ordering!",
    "This pedometer is very reliable and far better than the typical cheap pedometers available at the drug stores. It is a fully solid state device that uses a semiconductor accelerometer. The 7 day history of steps, miles , kCals are useful for keeping a log of activity.A small quibble is the clip that can result in the pedometer dislodging under some conditions. I did lose the first one I had when it fell off at the beach.",
    "NO. The rack is quick release. The \"office bag\" from topeak works great with it..........and there are other bag options. What could be better? Nothing that I can think of. Between the rack and the office bag, good bye super sweaty back.",
    "I got this mat a couple months ago and practice in a studio twice a week.Now there are peeled spots where my feet land in downward dog! The material peels off! I am surrounded by little blue foam nubs by the end of my practice.Is no one else having this problem?My other mat was five years old and only faded slightly where my downward dog feet went.So disappointed.",
    "A+ finishing product. Drys rock hard yet is flexable and once it is cured it is resistant to Actone, laquere thinner, and finger nail polish remover. It was very easy and forgiving to apply. I would recomend it over anything,and i've used almost everything out there.",
    "This is my daugheters 1st year and she loves the look of her clubs. She says they are very comfortable. Bag is light.",
    "The Nike One balls are tremendous, but if you play a lot of golf, and don't like spending $45 per dozen, this is a good alternative. Good distance, soft feel, and great on or around the green. I have a lot of club head speed, so I like a softer ball that lessens the feeling at impact. I would not recommend this ball for players that like to \"let the club do all the work,\"All I know is that the first 2 shots I hit with the Power Soft ball were a GIR to a 180-yard par 3 and a subsequent birdie. Can't argue with that.Also, I prefer Nike balls in general because I don't like trying to line up the ball's logo with where I'm hitting it. Many people like that, but I prefer a ball that has a non-linear logo, and Nike (the swoosh) fits the bill. I know, it's a psychological thing, but, hey, it's golf. It's ALL psychological anyway. Bottom line: Good ball, good price.",
    "At the end of hurricane season Nov.30,09 I put my Coleman 2 bulb rechargeable and my Swiss Gear rechargeable lanterns away.At the start of hurricane season Jun 1,10 I took them out again. The Colman lit right up. I still charged over night. When I took the Swiss Gear out it would not light except for the night light. When I tried to charge it the full charge LED came on. I still charged over night. It was the same. I noticed a little darkening on end of the tubes. So I bought new ones. Same thing. So I took the bulbs out and trashed the lantern.My new Coleman Quad from Amazon.com arrived yesterday.",
    "Followed instructions but find it tough to install. Once in place, using gun oil as recommended, it stuck and cannot move either direction. Haven't fired mt rifle to test it yet; however, will be difficult to test since it can't be moved.",
    "Can't even tell you're wearing them. Fast drying. I do a lot of backpacking for multiple days and find they dry very quickly after washing.",
    "Works as described. I was up to 60 reps at a time which was putting alot of strain and pain on my wrists. The extended motion has reduced the number of reps I can do but I get better results. The swiveling action has also removed all of the strain and pain from my wrists. Great product. If pushups are irritating your wrists, then don't hesitate to get these. The one thing I don't like are the rubber handle covers, I would prefer a knurled metal handles.",
    "The pedometer is inaccurate. You have to be very careful if traveling in a car/bus/train as it registers all the bumps, but I think most of the cheap ones do that.",
    "I purchased this gun about a week ago and it was not what we expected. It is definately NOT full metal, it is mostly black plastic and it just feels flimsy. If I would have know, I wouldn't have bought it.",
    "Compact, close focusing, more than adequate optics. Excellent binoc for beginners at the bird watching trade. I've had the first issue (UCF-X) for more than a couple of years. Purchased this one as a gift for my adult daughter 'cause she raved about using mine as she examined wild life during a recent vacation. Buy it, it will not disappoint.",
    "It did not quite fit my bike model \"Flirt\". I have to install it on the handlebar sideway instead, but I guess it's more of the problem with the size of handle on my bike compared to others. otherwise, it's a great buy with reasonable price.",
    "Great fit, nice features, including the drain in the back that works automatically. One reviewer mentioned that the tall heel tabs cause irritation, and I agree. Just cut them off, as the boots are real easy to get on and off anyway. I like that these have a somewhat narrow and slender profile, as they make getting on my medium sized Blades easier. My thick 7mm ones make it hard to get the fins on all the way. Also, the rubber extended toe caps and on the heel are great.I completely recommend these boots. Better than my older Akona's by far.",
    "To give you a good idea of what these tires will do, I need to tell you about the bike I got them for. It's a 1970's, French made, rigid frame, 5-speed double, youth, road bike with MTB bars, shifters, & brake levers that has 26x1-3/8\" rims with these Kenda Kross knobby tires - think \"old school\" MTB Lite. I use it for riding the local converted (as in \"rails to trails\") rail trail (RTB anyone?) two miles from my home. 27 inchers and 700Cs are just too skinny and dig into the soft stuff. 26\" MTB tires are too fat and have you huffin' & puffin' on the smooth stuff when you want to roll. 26 inch street tires on 590mm rims are about right but a little slippery in the muddy stuff. These Kenda Kross knobbies are just right. They pedal easily enough on the the street, and stick pretty well in the slippery stuff. They're not perfect so you do have to be careful or wind up taking a mud bath. They are a compromise like everything else bicycle. Some may say, Why not just get a mountain bike and be done with it?\" Well, I do have one; and sometimes it's just a little too much like driving a truck on our local rail trail.I took it out for a little ride today. There's still snow on the ground and some left on the streets, but these Kendas made a good showing for themselves. They worked out quite well and held in the small patches of noncompacted snow that were still left. Of course they do slip on hard packed snow like any other nonstudded bike tire.I like Kendas as I've used them in this size before on some of my other bikes. I was really amazed that anyone made a knobby in the size. Yes, they definitely do the trick and at half the price of Michelins. They even look cool too.",
    "I've been wearing Wigwam 625 socks for years - - I like them a lot. I'm assuming that they've still of the same quality.",
    "These are well-made, and much nicer than the typical plastic streamers that tend to break of and fade. Our 5 year old loves these on her bike. We couldn't be happier with this purchase.",
    "I bought this ball and it was really nice. It had a chart for some exercises with the ball and a band to reach the desired and right size of the ball. The bump is simple and easily attached.The size (55 cm) fits my length (5.1) as recommended.",
    "Excellent net, with nice look. Easy to install and I'm very pleased with performance. I would recommend it to everybody!!!!!!",
    "I found this step too tall to be able to comfortably step onto while carrying items on to my boat. Also, the top is curved, which makes it seem even more unstable.",
    "Without rough use, the rubber has already started separating from the wooden paddle in a couple of weeks.",
    "This is the best pedometer I ever owned. It's accurate, durable and is easy to carry in your pocket or clip on to a belt. LCD display is easy to read. Seven-day record is very handy.",
    "At $22, these were a steal. They are very comfortable for lounging during Minnesota winters. While definitely not wind-proof of course, I was pleasantly surprised at how wind resistant they actually are. I would wear these all day everyday if I could.",
    "These work great! Just beware that they don't really work on a lever- action, but for any non lever action they work great!",
    "The tires I purchased were what I expected and therefore am satisfied with this vender's products and service. The price was resaonable and competetive. I feel I received a good deal and would not hesitate to purchase other items from this vender.",
    "I was able to shoot 1\" groups from 50 yards away with my crosman phantom. More accurate than any of the pellets I've used. Will definitely be buying more!",
    "20 more words require20 more words require20 more words requireddd20 more words required20 more words required20 more words required20 more words required",
    "Wish the newer model had a reset option to reset the current days data to zero for mileage, steps, etc like its predecessor which I managed to loose while walking.Otherwise I am impressed with its accuracy and recommend using the pedometer \"leash\" to avoid loss.",
    "I just orderd my gun on 11/18/06 and i got it on the 22nd, when i opend it, it felt like cheap plastic i liked the flash light and the laser. It comes with a silencer but that doesnt do anything when you shoot the spring makes a loud sound and you cant do anything about it. Dilivery was fast it works fine a little plasticey and hold vary little bb's its really light (because it cheap plastic)but other than that it looks great real actual size.",
    "This product will NOT stop your bike from being stolen. My bike wasstolen using this lock in broad daylight in a high traffic area of SanFrancisco. This lock will only stop a person with no tools. Boltcutters go through this lock like a hot knife through butter. It won't slowa theif down more than 2 seconds.",
    "I will not be without one, I use it everyday. When a Friend lost my knife, the next day I reached for it 4 times, so you see, I really like having one. I was a part time commerical fisherman for 26 years, they come in handy. Buy one, you will see what, I'm taking about.Grerat knife for everyday use.",
    "I bought this to replace the inutile E-Z Firefly stand and I was so impressed that I bought another one. The adjustable height is nice to have when you're cooking at night. And since I've either had my lanterns on the ground or table top, it's great to place it elsewhere so bugs can leave you alone.",
    "GREAT ITEM, ARRIVED VERY FAST TO ENGLAND, KIDS ARE DELIGHTED ,HOME MADE ICE-CREAM,GOOD FUN TO THROW THE BALL AROUND X",
    "I bought these for my husband and he likes them. They are a lot cheaper than at local sporting goods store chains where he previously purchased them. Being a big & tall man he'd like them to be a little longer but they are decent in that regard. He has a strong sensitivity to fabrics that are not 100% cotton. We've bought three shirts so far and waiting on two more.Colors that are 100% cotton:1. Black2. Royal BlueColors that are not 100% cotton:1. Graphite.Waiting for the following colors to arrive, will update:1. True Red2. Columbia Blue",
    "since the product was not received I cannot give a good review for this transaction",
    "This computer is very easy to use. Works great - has a lot of great funcions and is very easy to read. Helps keep track of a lot of information. Would recommend",
    "The product works very well as advertised. It's simple and straightforward to initialize and once that's done, it's just a matter of wearing it and looking at the results. The only problem I enountered was when I wear it during strenous exercising (i.e. racquetball, 5+ mile runs), and I sweat alot, the wetness of my shirts on the cover of the device soemtimes causes humidity to build inside the devices front glass and that effects the ability to see the results displayed (sometimes the actual displayed numbers are faded, however, viewing from angles will still allow you to see the results). I also discovered that the problem clears itself and the device displays perfectly again after a few days. Of course this only happens if you don't repeat exercise that caused the problem initially.",
    "I bought this poduct about a month back and have had no problems with it at all so far. i dont know why so many people are complaning about it being crapy but it fits perfect with my K105 sevylor caravelle inflatable raft. well i guess some people just have bad luck sometimes",
    "Watch lens is plastic and scratches easily. Watch must be sent back to factory to change the battery due to waterproof seal.On East Coast of US, very picky about location in home for overnight update of WWVB time signal.",
    "These work wonders! The reason I give it a 1 star is because people tend to look more closely at bad reviews because there's less raters there for this item at least. Now the other reason behind it is so that people can be informed about what I'm about to tell them: I found it on Ebay brand new for 2 usd free shipping! The item itself is a 5 star. I use it for my road bike and mountain bike. It's flawless with the exception that it only comes in pairs rather than triplets. Buy two sets because they are so cheap and handy!",
    "I ordered this in black, it is very rugged and well put together. I have my doubts about the pouch clasps being efficient in combat, however I bought this with the idea of carrying a wallet, cigarettes, leatherman, etc The pouch is nice sized and the loop on back is big and well secured. I would highly recommend this product for non-combat use.",
    "I bought this bottle for my girlfriend as a birthday gift and she loves it. I find the matieral light and effeicent for a bottle of this size, Sigg is very high quality and makes a beautiful bottle. 5 stars, excellent bottle, works great!",
    "This Buck pocket knife is a great size and quality. The blades are really sharp and have a fine edge.",
    "Yes, they are spendy but, with Thorlos you absolutely get what you pay for!! Been wearing them for years and years and still have my first pair.",
    "this is haevy but good its really stiff and hard to braek good for street tricks easy to ride i love this company",
    "Concept is good, but quality is poor, and customer service has been poor so far as well. Straps began to fall apart almost immediately. Contacted customer service over a month ago, and they said they would send a replacement. Have not recieved a replacement, or a response to my subsequent email. I would advise anyone considering this product to steer clear.UPDATE: Eight months have gone by since my initial review. They still have not provided either a replacement or a refund. I strongly recommend that you don't buy this or any other Gofit product - odds are you'll only regret it.",
    "This Nikon 7x50 has all the essential ingredients if you're looking to gather as much photons as possible. It offers you the best binocular views of the solar system and the deep-sky Messiers alike. The 50 mm objective gathers so much light that I got a headache when I tried some sightseeing during the day. The neck-strap, pouch and lenscaps are welcome accessories that come with the binoculars. Strongly recommended.",
    "Bought this for my Niece's 5th birthday. She loved it and still does. It has been about 3 months and still is good shape. Adjustable for different heights, perfect for younger and older kids. My dad even uses it sometimes.",
    "Wow. Looks fantastic. I ordered this on 04/25/2012 and received it on 04/27/2012. I didn't pay for the fast shipping because the weather was going to be yucky, only selected the 5-8 day shipping. I was surprised at how great this looks and it feels very well built. I hope it performs as well as it looks.Just went for a ride today (04/28/2012) and this Chain Guide works very well. I'd buy another one if I had another bike that needed one.JPSalt Lake City, Utah",
    "i got this gun about 2 weeks ago and it is awesome! really sturdy, good fps and most of its metal. it blew a snowman to pieces and the 600 round hi-cap mag is really use full.Pros:Metal gear boxHigh rate of fireMostly metalAttachment rails600 round clipVery accurateEasily install batteryAdjustable hop-upComes with winder tool for the magazine and 4 winds with it is like 20 without itConsThe single fire skips if not wound well enoughthats about it...I highly recommend this gun to anyone!",
    "This is what i wanted to practice with a Katana as you really cant do it safely with a live blade. Strong and sturdy.",
    "Holding up well. Front clip very helpful, well padded. Kids 12 and 14 learned how to kneeboard on this with no, zero, zilch experience. My kids are generally intimidated by these kinds of new things, especially after watching the others face plant into the water a couple of time. But they have gotten on this thing pretty easily with just a few such face plants into the river. TONS OF FUN. I ON THE OTHER HAND have tried twice and did not get up. BUT, knowing how to drive makes a difference. Start with the chest on the board, hands on the front sides. With the handle clipped in then drive 12 MPH strait with no chop or wake. When my wife drove the board was either under water (Too slow) or too fast (Almost lost my suit, spread the legs or your trunks are 50 ft behind you ;)",
    "I had been watching other pool users with their floats and determined this was the kind of float I wanted. I thought Amazon might be my best bet for finding it, and I was right. Although color is not an option (I received lime green), the float work beautifully. The seller sent it in record time, too!",
    "Before you read too much of this, you should know that I'm not an experienced duck hunter. I can't authoritatively verify the quality of the sounds this call makes. That aside, it is a very easy call to make sounds with and does take a bit of abuse. My nephew loves to play with this call and blow it as hard as his lungs will let him. The best sounds, however, come from more gentle blowing and a large variety of duck sounds are available with simple variations of technique. To my inexperienced ears it sounds like the sounds ducks make. The price is hard to go wrong with. If you've got some of those very expensive calls, maybe their nicer but this would be a good back-up.",
    "While these are not as good as KSC bbs, you get what you paid for. These are highly affordable and good quality bbs. The bottle is a little weak, so don't squeeze it. Its a hassle trying to pour sometimes because bbs get stuck in the nozzle and u have to tilt the bottle back and then pour some more in. 2000 bbs is not enough though if you are just starting airsoft.",
    "This is the real deal. The genuine article. The very same football that is used in NFL games. Enjoy the smell and feel of real leather. You may have to condition the skin of the ball, by wetting it, in order to achieve a better grip as the skin is fairly slick right out of the box. Also, the instructions on the ball say to inflate at 10-12 pounds, but if you do this you'd better have the large hands of a Manning or McNair in order to get a grip, because it'll be as hard as a rock. For tossing the pigskin with friends I suggest inflating only to about 8-10 pounds so that your fingers can put a decent indent on the skin and give you better control.",
    "Love these glasses! Fit well. Fit quite snuggly to my face (ie.. they dont fall off, or slide around, when jumping, running or leaning forward).Great polarization.The only negative to these glasses is I would have prefered if the lenses were a little larger (vertical lense measurement = 35mm). But that is just a minor.Overall, great glasses!",
    "I use these for a slightly different purpose. They work very well as a kayak leash. I clip one of them on to the front handle and I can pull my kayak up river when it gets too shallow to paddle, before getting back in on the other side of the shoals. That way the kayak just follows behind and you don't wear yourself out bending over to hold the handles. You also can stay more on the rocks while the boat glides around them. Sure, I could have made one out of a piece of rope, but two of them was cheap enough that it wasn't worth it.",
    "I couldn't believe the heat this stove would put out. Took some time getting used to but once I figured out the right temp settings I couldn't be happier. The only thing I would try and improve on is the wind gaurd. With the BBQ box in use you can't use the wind gaurd for the third burne if you want to cook something in a pot at the same time you are BBQing",
    "Good item but did not fix my IT band problem. The best fix it go to the physical therapy.",
    "I BOUGHT MY 10 YEAR OLD SON A BIKE FOR CHRISTMAS 2005 AND ON THE BOX IT SAID FOR CHILDREN 13 AND OVER AND NOW I SEE THAT ITS 10 YEARS AND OLDER. I HAVE THE PAPER THAT STATES THAT. IS THERE ANOTHER MINIMOTO IDENTICAL TO THIS ONE? ANYWAYS MY SON LOVES HIS BIKE.WHEN THE BATTERY IS CHARGING YOU NEED TO MAKE SURE THAT THE GREEN BUTTON IS ON INTHE CHARGER. JUST PLUGGING IT DOES NOT WORK. MY SON RUNS FOR ABOUT ONE HOUR MAYBE ALITTLE MORE. WE BOUGHT HIM A HELMET THE KIND THE REAL MOTORCYCLES WEAR JUST TO MAKE SURE WE KEEP HIS HEAD IN ONE PIECE. AS TO THIS DATE HE HAS NOT FALLEN OFF SO HE IS DOING WELL. (...)",
    "I bought this ball about a year ago. It is a nice soft touch ball that is great for recreational volleyball. I prefer to use my ball whenever we play in the gym. I also brought it to our youth practice and it was the team's favorite ball as well. A good value for a great ball!",
    "A good leatherman is more usefull than you think. Ask anyone who carries them regularly, you'll be surprized how often it comes in handy (and I'm not just talking about the knife).The Leatherman Wave has everything I'm looking for at a reasonable price. If you're looking for a better steel in your leatherman look at the Leatherman Blast, it is near identical to the Wave but more expensive because it uses a better steel. Anyway, back to the Wave.Pros:All the tools lock open, including the blades.Blades are on the outside of the tool, making them as easy to get to as your basic pocket knife.The wood saw blasts through wood.Bit Driver with exchangabe bits is genious and works very wellVery small jewelers screwdriversScissors bigger (though not by much) than swiss army knivesCons:The outside of the handles aren't smoothed (sharp squared off corners), which cause a little discomfort when using the bladesScrewdriver bits will bend if really torqued on.Leather/Nylon sheath is bulkyI recommend the all nylon sheath (sold separate), its a little lighter and more importantly its not as bulky. In fact the nylon sheath (for the wave and blast) is the most compact leatherman sheath I've ever seen. It holds one of the additional bit driver sheets (again, sold separate) and has two elastic loops on the sides for pens or small flashlights. I wear my wave every day, I preffer wearing it horizontal above my back right pocket, though it does kinda get in the way of getting to my wallet.",
    "this is the one you want to resurrect your old Pur Scout Model water filter.I've never had a water related illness in the many years I've used this filterand I've drank from some questionable places in the wild west.",
    "todo muy buen exceletene producto muy bien bien empacado y llego el dia q tenia q llegar x dicha xq sino q problema",
    "This has been the best rear bike rack I have used so far. Delivery was extremely prompt. Unit is sturdy and came with instructions, fits over 700c tires, mounting hardware is fully adjustable and came in two lengths. Very happy with this purchase.",
    "It's a blast, whether you use it for a 5-minute pick me up or do the full workout. It's still new to us, but my kids and I love it.",
    "My son is 14 and we tried other sliding shorts when he was younger, but settled on these when he was 10. They are comfortable in hot or cold weather and don't irritate his sensitive skin.",
    "This is a great seat for babies between 1-2, no older. Any larger than 25lbs. and your baby is too big. I've seen it work well for others, but didn't suit my needs personally. Otherwise, a great seat!",
    "The mirror was easy to install, just cut the end off your grip and it slides rights in. The only thing you might want to consider is that it does crowd you hand if you grip towards the end of the grip. It hasn't moved or vibrated loose in 32 miles of riding.",
    "This is a great pair of sweat pants. I usually have a difficult time finding sweats are casual/longue wear but that are not sloopy or frumpy. This is that pair of sweats.",
    "I bought the headband in several colors. They are thick and absorb moisture well. I haven't had any problems with the colors; maybe that's because I wash them by hand.",
    "Here's a follow up after less than one year's use:(since receipt of the bike, i have changed every part besides the seat post and the bolts that hold the bike together.)Up until last night, i had not complaints about the bike besides the fact that the hangers broke often. But atleast hangers can be replaced. Last night I went out for a ride and was skidding around corners for fun when the frame snapped just after the weld on the left chainstay that binds the chainstay tube to the solid dropouts. It wasn't a defect in the welding, the tube itself snapped.To be honest i have gotten a lot of use from this bike in the few months i've ridden it. It will do justice to most trails and riders but beware that catastrophic frame failure may be around the next corner.Another thing to note: after I bought this bike, my friends also bought 2 of them, they ARE slightly different in measurements and components. The newer version will not fit an 8 inch rear shock.Following is my initial review of the bike:I'll start by saying the bike came in one day and in good condition. The headset on the bike is a little strange, there's a little peice at the bottom that prevents you from mounting a standard fender on the front wheel. I ride this bike hard taking 3-4 ft vertical drops and flying at curb sides and I have had just a few issues. First off, I have dented the rims and have since upgraded them. The stock rims were very light and they would be very durable under normal riding. Second I was oiling the hubs and accidentially got some oil on the disc rotors, they were terrible at stopping for a long time after that (so be careful!). Also brake pads for the stock brakes are hard to find. I have since upgraded to Avid bb7 mechanical disc brakes with a 203mm rotor on the front and back and it works great. Pads are much easier to find and stopping power is amazing. The only thing is that the front fork tends to flex under extreme braking and it's a little unnerving. The rear shock is a little bouncy but there's nothing wrong with it. I have since upgraded to a Xfuxion 02 RC air shock with lock out and it works very well, but this is personal preferance. The sides of the saddle wear pretty quickly but it doesn't need to be replace. It's a little wide if you're doing downhill riding but I think i'll keep it. I've had this bike for two weeks and the rear tires are almost completely worn but it really depends on the type of riding you do. They also don't inspire confidence when doing highspeed cornering or stopping on cement The front shock is a bit soft for me, i'm 165 lbs, but the sag helps keep high speed traction over rough stuff so i suppose it worked out. The gear ratios are very comprehensive although top end speed is a little low for me but that's because I usually ride road bikes. Low end gearing will get you up any hill with the right tires and rear shocks. The pedals are plastic, i don't care, they get torn up anyways. Personally i don't like grip shifters because you have to shift your hand's position while riding to shift gears and if you're hitting some rough stuff or jumping over something, your wrists take a beating.Overall a great bike, i would reccomend it to my best friend. Don't take anything I said too critically because I'm picking apart very small issues. It's a great deal for the price, they don't waste money on components so you can customize it yourself. This bike is highly upgradable and user friendly, unless you're coming from high end $1000+ bikes, this bike will not dissapoint. 250 is a steal.",
    "I was in such pain, had a locked shoulder, my Physical Therapist suggested to buy myself a shoulder pulley, after using it for three days my shoulder was so much better, i use it all the time now, even if i dont have shoulder pain. the Pulley is well made , top of the line, i suggest to anyone who has shoulder pain to buy this, thank you so much for the pain relief i received!!!!",
    "My husband and I purchased this tent to upgrade ourselves to go camping with our son - now 2 1/2. The tent is very easy to set, well built and was exactly what we needed. A nice sized sleeping room and a bug free living space (we live and camp in Florida).We have not sealed the seems, they don't seem to need it. It rained one night, not a drop inside the tent. Everything in the tent is well thought out (with the exception that we would have liked the e-port in the front room instead of the back room). We love the way the windows work and how well ventilated the tent is.Having a front and back room door also worked well.The only complaint - if it can even be called that - is we couldn't seem to really get the front fly to stand properly. It sagged no matter how we put it together and in the morning was covered in a lot of dew, so if we left by the front door, lots of droplets came raining down on us. This pictures show those poles being a lot taller then they seem to be for our tent.Take down is as easy as the set up was and if you follow the instructions, you should have no problem getting the tent back in the bag.Well worth it, we are very excited to own this product and it made our latest camping trip such a joy that we are actively researching other places we can go camping. So, a good tent.",
    "The Seal Line bags are the only way to go if you want to keep your stuff dry. Accept no substitutes...saving money doesn't matter if your stuff is wet during a backpacking or kayaking trip!",
    "I bought these scooters for my children about 6 years ago. They ride them regularly and have put a lot of wear and tear on them. Not to mention leaving them outside in the rain and weather often. These have held up and have been well worth the 19.99 I got them for (on sale on Black Friday). My son is asking for a new one, only for asthetics since his has rust and the handle bar grips are breaking down from use. It still rolls and works fine. I think I will indulge this Christmas and buy another and keep this around for friends.He actually rides this more than his bike. He is 10 years old. My daughter, 11 still hops on hers too.Easily folds for quick storage.",
    "This will definitely help you build up your endurance and get you in shape. As far as strength training though, you're better off with P90X. I've done both",
    "I bought this bike about a month ago. The look and style is great. However, the seat is very uncomfortable, I had to get it replaced. Even worse, I have rode it a couple of times already, and the Front Derailleur is already damaged. I need to have this bike tuned up at the local bike shop which will set me back an additional $50.00. While I do expect for Schwinn to make good on the warranty, and send me a replacement part, it is a hassle to have to register, and wait for it. Unfortunately, I may need to come out of pocket even more if I want the part replaced sooner. Overall, this bike is okay, but I will recommend to do serious research before deciding on this one.",
    "I got this for my wife after she complained that the first 2 I got her were too thin. She LOVES this mat! Everyone in her classes keeps asking where to get one. It may not roll up as small as the others, but it is so comfortable, and has pretty good grip too.",
    "Got these over a year ago. Didn't actually use them for probably about 6 months. Got them filled & they worked exactly as they should. The held the Co2, lasted a long time with a Tippmann 98 Custom & have had absouloutely no problems with them. If you're looking for good tanks at a good price, I would recommend this product.",
    "I purchased this item from here and it took three weeks to be delivered to our store. My children played with it for a month and enjoyed it. Then the back tire blew out. Razor states they have a 90 day warranty so I contacted them.",
    "I got these in the mail and was so happy until I put them on and realized that they were for little kids faces because they are small, not meant for adults!!!!!",
    "This lock is great. It looks significantly more imposing than the 12mm coil which is probably most of its deterrent value. It takes patience to wind any coil lock through your frame and spokes, but both a man and petite woman have used this lock with ease. We own three onguard locks (one for a bike and two for a moped) and we love them. Reliable and strong.",
    "I must own 12 of these, I give them as gifts and I put them in every Survival kit I make. When ever I go to the Light my Fire booth at the trade shows I buy some. Really nice guys that run the company too. There always nice.",
    "I bought this rack after searching through the numerous styles and brands available. Installation did require me to drill 2 small holes in the fram though. I really didn't mind as long as the rack was sturdy and attractive. I do no regret my purchase and recommend this product to anyone. The bike it was installed on is a GMC yukon mountain bike.",
    "I've had three other Serfas RX saddles, decided to try a Rido 2 saddle, rode with it for about six months, it was ok, but, not as comfortable as the Serfas RX so , I ordered another RX. These are the most comfortable saddles I have used, I have ridden a lot of miles on these saddles, and they are GREAT !!!!",
    "Chicago Women's Rink SkateGreat skates for the price! They are smooth rolling, work well in turns and help me enjoy skating again. A great bargain!",
    "I have purchased these liners for 3 bikes thus far and been extremely satisfied with the results. It can be a little tricky maneuvering the liner, tube and tire to position it properly. But once done, amazing results. I just bought this set for my new Hybrid. Love them.Sidebar: I also use tubes with leak liquid in the tubes. In 2 years of heavy use on all the bicycles, I had to replace one tube. We ride on all types of surfaces and over sand spurs, glass, road debris and these things really help.You do the math.JB- Delray beach, Fl",
    "I wear a size 11 shoe and on the chart on another website it said that a 45 was the equivalent to a size 11. come to find out the size i ordered was about a half size too big but they still fit fairly well. also, a big thing is that these are not actually feiyue brand shoes but they are knock offs. they still are very light, cheap and super comfortable. i cannot stress how comfy these shoes are. they might look a little strange at first but you get used to them. i like them. 6/10. would probably buy again.",
    "I bought this thermos a little skeptical about the 24-hour claim. While I haven't tested it myself all the way to 24 hours, I have tested it to 13 hours. After pre-heating the thermos with hot tap water for about 10 minutes, I poured near-boiling water at 190 degrees F into the thermos and screwed on the cap. After 13 hours I took off the cap, stuck in a thermometer, and viola - after 13 hours the temperature had only dropped 10 degrees to 180 degrees F! This thermos is fantastic! It holds enough coffee for almost three full mugs. I have two in the morning and when I get to the third in the middle of the afternoon, it's still piping hot! I'll be curious to see how long the thermos lasts, but after 3 weeks, I'm extremely satisfied with this product!",
    "I am very pleased with this holster.Ordering was easy,Shipped when they said it would,and arrived on the day. Sport serpa was in gray instead of black which I was glad to have found.",
    "If you are like me an are just getting into airsoft guns and found paintball to expensive this gun is for u. it is made of die-cast metal and comes with flashlight and laser, very poor lasor.this gun has incredible accuracy.",
    "I was pretty skeptical before I ordered this bow press. (Even though the reviews for this type of press are very good. I was pleasantly suprised at the ease of use and the simplicity of this press. It is also very compact and lightweight. I have read a few negative reviews of people saying that it is hard to crank. I haven't noticed this at all! If you do any bow work on your own and don't want to spend a fortune on a bow press, this is for you.",
    "These were sporadic to work if they even worked at all. I sent them all back and will be a Coleman LED lantern instead",
    "problems, problems. . .I am having just problems with the cardiosport heart-rate meter (limit classic, with a strap), and wish i had never seen it.",
    "It's been inflated for about 2 weeks and has not lost any air. I like the built in pump",
    "These are for my Leupold 3x9-50 scope, and are really strong, fit perfectly. Seem strong enough that the 30-06 isn't likely to shake the scope loose, no matter what load I shoot. Wish the store locally had carried them, but got a better price on Amazon anyway!",
    "I love these sweatshirts, the one I recently purchased was a gift for my boyfriend, and he loves to wear it as we transition into spring. It's warm enough to wear on a 30-40 degree day! They are also built well.",
    "Put this on my bushnell 6-24x40 and the fit was very good now I won't be looking for my cover when through shooting at the range.",
    "Kids (30ish) opened and kept reading about how to use it, they stopped opening gifts and were fascinated by them. Great product, well made.",
    "We ordered 30 of these for our agency. Overall they are solid and will serve our purposes. We had to return one so far for a defective door that would not open properly. The return was quick and easy through Amazon. I do question the security of the battery over-ride if you lose the key and cannot get the code to work. Seems anyone with a 9 volt battery could get into the safe any time. We are thinking about disabling this feature by cutting the wire to avoid unauthorized entry. We will just need to make sure we know where the keys are if the batteries for the electronic lock go dead! I think overall the product offered by Gun Vault is a bit better made, but the price (and free shipping) made these ADG safes the best available for the cost.",
    "This 20\" cast iron skillet is huge. It is large enough to cook 6 pounds of shrimp at once. If the need to cook really large amounts of food is your task, then this is the item for you. It is heavy and it will need to be seasoned before first use.",
    "I bought this as a second, backup light to complement my main headlight, a 3W LED light. This light uses a single low power white LED powered by two AA batteries. The light has a very tight focus and can be set to flash, or be constantly on. I haven't tested the runtime, but it should be in the order of 100 hours.I fully understand that a single 5mm LED will only put out so much light, so I was hoping this could help others see me, not necessarily help me see the road. Unfortunately Cateye made the beam VERY narrow, which is NOT what you want for a \"to be seen\" light. It's WAY too dim to serve as a headlight but the beam is WAY too narrow to help others see you - unless it's pointed directly into their eyes. I know this will sound harsh, but this light isn't good for anything. If you want an LED headlight, spend the extra $15 or so to get the Cateye HL-EL530 or the Planet Bike 1W Super Spot (which I also reviewed). Both of them have a VASTLY brighter, 1W LED which actually puts out enough light to be useful as a headlight at night.",
    "I routinely do squats with an olympic bar @ 305lbs and this pad makes it more comfortable. Good posture, form, and technique do not help the fact that you have hundreds of pounds focused on such a small area of the shoulders. I tend to have issues with the bar crushing the skin between the bar and shoulder muscles, as well as the area of C7-T1(since I am not fat the processes of these bones are very close to the surface). This pad has helped that load to be dispursed over a greater surface area thus reducing the discomfort and redness associated with missing skin layers. It fits my bar just barely. It is a tight fit. The velcro and other materials seem to be glued on, and so I have to wonder how long this pad will last. It is inexpensive though.",
    "Skates were a great price and are of great quality...I would recommend for any beginners!",
    "I purchased these shoes as a barefoot alternative/minimalist shoe as I am very much a believer in this movement. I have many barefoot shoes ranging from the vibram fivefingers to multiple vivobarefoots. I wear nothing but minimalist shoes and study the topic regularly (see the Harvard Barefoot Running website for a good overview).These shoes are probably a step between a regular running shoe and a barefoot shoe. If you would like to switch to barefoot, but are afraid of moving directly to something like the fivefingers, these shoes would probably work very well for you. They do not have any arch support, which is excellent. They do have a fair amount of sole, however, which prevents you from truly feeling the ground and moving with the appropriate barefoot gait.I do not want to seem like I do not like these shoes though, as they do have some desirable assets. For one, they do have a very minimal upper, which does not restrict movement. The sole is also very flexible, albeit slightly rounded. At first the rounded sole seems a bit strange, but it will work your gluteus medius/minimus more than a normal shoe and should help with balance and ankle strength. These shoes are also very light, and the sizing for me was the same as any other minimalist shoe.Also, you cant beat the price. Although they are not true barefoot type shoes as some other reviewers mention, if you dont have 150 bucks to drop on vivobarefoot (best barefoot shoes on the market) or dont like the look of the fivefingers (they are amazingly comfortable however only losing points for not being appropriate for every occasion) these may be a good start for you.Finally, these shoes are way better than the Nike Free shoes (any version of them) but I would put them in a similar class of minimalist shoe. If you are wondering what these will feel like, go try on some Nike Free 3.0 shoes. These have a similar feel outside of the rounded sole. These shoes also have a flat feel, where the Nike Free's have a slightly raised heel.Enjoy getting rid of all of your back pain through ditching the foot cast that is today's running shoe.",
    "I love this stuff! It is the only thing that has EVER worked on my lake inflatables.So upset that I can't find it anywhere anymore. :(",
    "I got the other kind at Dick's Sprorting Goods Store and the string snapped off on my 3rd use. This one is fit perfectly and the material is superior to the old one. So 5 stars for this item.",
    "I have used a heavier duty model for high caliber ammunition and was initially concerned that this might reveal some of the same shortcomings, but it worked flawlessly and does not incur the kind of damage to the dowel pins on misses that the heavier model does with .38, .357, .44, and 9mm rounds. Whether you are using a pistol or rifle, the convenience of the resetting paddle is worth the entire purchase price. The frame and anchor rods are robust enough and sufficient to keep it in place even on relatively soft ground during our trials. In areas such as an old quarry that are too rocky to drive in the stakes, you might want to mount it on a plywood base. if you aren't fond of replacing the target decals, you can do a quick touch-up on the paddles with a can of spray paint after each use in preparation for the next outing. Make your practice session more interesting by making a friendly game of mixing it up with the sequence in which to hit and reset the targets for both markmanship & memory. 1-2-3-4-reset;1-4-reset;2-3-reset;1-3-2-4-reset;individual reset one-by-one -- use your imagination. Fun for the whole family.",
    "Don't trust this lock to protect your bike in a public place. The cable is thin enough to be cut with wire cutters, and the locking mechanism wouldn't withstand a single blow with a hammer.",
    "I got this as a birthday present for my fiance and it actually has developed into a new hobby! It's great for people who don't want an intimidating or difficult-to-pull bow. I had so much fun messing with it I got my old bow restrung and we have been shooting together.",
    "Very nice for fishing. Has lots of room and is very durable. I take it fishing alot because of the wheels on it. They make it easy to pull.",
    "I had gotten it for my husband but it was a big mistake. He is used to leathermans and apparently these don't really lock. I remembered my Grandfather using them for a long time but then I remembered that was something he didn't like either. I would return it but then I would loose 45% of what I had paid for it so I will just keep it in the stuff draw in the kitchen..",
    "This product does not work well with the Model 85 poly either. It looks as if I would have to cut part of the grip away to allow everything to seat fully. As it is, the loader jams against the grip and isn't easy to remove. Might work well with other model 85 snub nose revolvers, but not the poly model.",
    "Bought this training wheels for a six years old who decided she wanted a 20\" bike. Needless to say, I was having issues finding training wheels that would fit her bike. Maybe the frame was too high, so I looked for training wheels over 20\". After much research, and many hours in the computer, I finally came across this item. Thought to give it a try. The braces didn't quite fit the frame, but after much pounding with the hammer( and it wasn't easy at all!), I finally got them to work.She's been riding the bike for over 4 months now, and she's not gentle with it, but the wheels have stayed put, and worked better than I thought. I highly recomment it for anyone looking for a sturdy set of training wheels.The box does say \"for a 3/4\" or smaller rear frame,\" so I suggest measuring the frame of the bike before you purchase, or get ready to pound it into submission like I did.",
    "My expectations have been met. Very authentic, quality material and good workmanship. This is obviously the official NBA jerzey.",
    "For an inexpensive bike, this is a great value. It has many nice features and the seat is very comfortable and adjusts well. Provides a good workout for beginners and those ready for challenge.",
    "My son, 9, wanted a real gun. This is what he got instead. I guess he was happy with it. He wore it out.We bought this one so he wouldn't shoot his eye out.9 year olds don't need a real gun.",
    "I have been looking for the Ray-Ban aviators for a long time. I saw these at Amazon and i was so stunned when they were only 70 dollars! At other stores they're roughly around $100-140 which is quite expensive. I went to Sunglasses Hut to try them on to see if they would fit before i bought them. The sunglasses hut i went to didn't have the 52mm so i tried on the 55mm which was way too big so i thought that the 52mm would be a good size. When i ordered my sunglasses they took about a week and 1 day to get here. I expected quicker shipping but it was alright considering i didn't have to pay shipping. I opened the box and saw them i thought they were way too small! but i tried it on and it was a bit small. i didn't want to go through all the shipping to get it back so i just decided to keep them. They're actually really nice though. my 8 year old sister fits them better than I do.They're Made In Italy, which is a BIG plus. The colors are very nice! the metal frame is really shiny gold and the lens has a bit of a reflection which i like. I have a small-medium face, somewhere in between that, so if you have a large face or a slightly bigger medium face i do not recommend this product for you because it may be way too small! these are NOT children sunglasses, they're just for those with a smaller face. so buyers be warned. Overall i think i spent a very reasonable amount of money on these sunglasses and i am very satisfied.",
    "At 1st it seemed great. It was a fun workout. I didn't lose much weight though which was my goal. It just seemed to tone my legs. at 1st its padded piece came off, but no big deal. Then the entire foot piece broke off where it has been glued. So my dad used bolts to put it on there. Two months later the cable on the side snapped. It is just going to end up falling apart on you.",
    "I recommend this product. I'm not a workout freak. I just wanted something to strengthen my neck because I was having neck pains from too much computer work. So I got this. I have never used similar products, but this one seems very good. It's 8 pounds so I was glad it was heavier than all the others I researched. It's well-made and stays on your head. I can feel it working very fast when I lean back a little bit, or even roll my head around very slowly like a stretch. It provides a very good workout in a passive way. You don't have to put all this effort into lifting something. You just lean back or at an angle, whichever way you wish to strengthen, and you will feel your muscles really work. It felt great to me because I'm used to sitting long hours at a desk and only utilizing the muscles on the back of my neck. This gives me an excellent and relatively effortless way to get an intense workout on the muscles I never use, the ones on the front side of my neck. This has helped my neck pains tremendously, and even alleviated stress as a result, since everyone knows that so much tension is carried in our neck and shoulder area. I do recommend this. The picture doesn't make it look like anything special, but this is a quality, heavy-duty product so don't hesitate to buy.",
    "Good lock, and it fits my S&W; .357 revolver nicely.I needed a trigger lock if I was to keep a handgun in the house (quoth the wife). So I chose this one, as it's a Master Lock (reputation for quality is upheld) and it has a combination lock (so I couldn't lose the key).One star off because, yes, if you put in up to 1,000 combinations, you're going to eventually open the lock. (Although for me, the quick access is more valuable than that possibility, as I don't have children yet.)Ideally, I'd prefer a good, locking case that both protects the stainless finish and is a little more secure. But the price was right ($10, vs. $50+ for a locking case), the firearm is secure and I get quick access should I ever need it.",
    "This is the first time I've ever owned a mountain bike and the first time I ever used a Trunk Mount Rack. I have 98 Acura RL.This rack is sturdy (all metal parts), strong, and very easy to use. I admit, I was nervous the first time I used it. I kept looking in my rear view to see if the bike was flopping around or had fallen off or whatever ;) I was extremely surprised how well it held the bike in place, even over bumps in the road.This rack is worth every penny and easily fits in my trunk when I'm not using it.I highly recommend you read the other reviews and look at the pictures on how to secure the bike to the car, keep the front tire from moving, put socks on the pedals if you need to, etc. All that information was EXTREMELY helpful.You might want these bungee cords: Highland 90086 Bungee Cord Assortment - Set of 12",
    "Mikasa balls have always been of the highest quality with a grippy surface and not prone to bubbles when hit against hard and pointy surfaces such as the corner of a goal post. This blue and yellow version is no exception. Honestly, the blue sections (balls have always been monochromatic) are more for spectators than for players.",
    "This baby is HUGE and keeps everything I place in it at just the right temp forever, it seems. Love it.",
    "Opens and closes very smoothly. Extremely sharp. Kershaw has a great reputation for a reason. This is an all around awesome little knife :)",
    "left over night in nyc and found the u bent. bike gone. i was happy with the price and lock until this happened. also, the pad is tough to see in the dark",
    "I ordered 3 serpa holsters, two were the grey cqc and they are great quality, but this one is terrible, I had to use a exacto knife to shave off the left over molding tags around the whole holster. I also had to shave off a sharp area right where my finger pushes the lock in. Not sure what happened, i did notice the seller (Online Tactical Store LLC) has several people saying they are selling counterfiets and fakes on other products!! They also shipped this poc in a freaking zip lock bag and claimed it was new!!!!!!!!!!! Serpa is great quality usually for the price. I had to order another holster to replace this poc one.",
    "This bike rack is pretty sturdy and it does bring something to lock the bikes. I have only used it for short distances but it did the job really well.",
    "Perfect fit and easy to install. Really helped at the range. Actually stoppen the musel flip proble I had and it was easier on the hand. Great product. I ordered another set for another firearm.",
    "I made the mistake of only buying one of these for my grandkids and they are fighting over it. They sleep with it every night. Its soft, comfy and very long.",
    "I bought this bike for my wife. She is 5'0\" and the bike could be a little shorter (we bought the smallest frame) but works fine. The brakes and shocks work as planned. The disc brakes are nice but unlike conventional brakes they are difficult to tell when they need replacing. The look of the bike is really nice. Some tools are required for assembly, most notably a large allen wrench.",
    "I've moved away from plastic and aluminum bottles for years now, in an attempt to avoid leaching chemicals from the bottles and epoxy coating often found on aluminum ones. I first came across Klean Kanteen brand now have several of their stainless steel bottles in different sizes that I use one way or another every day. So far, I've not have any problems with any of the ones from Klean Kanteen. I have never noticed any metallic taste with the water even when it sits in there for a day or two, nor any other odors of any kind and I'm pretty sensitive to impurities in water from using water purifiers for well over a decade. I've used other cheaper, generic brands and with those I do notice a metallic taste, especially after the water sits for a few hours and will now only use Klean Kanteen.The quality of this brand is the best that I've encountered so far and I highly recommend it. They come in various sizes and even shapes to fit your needs and are a healthy and sustainable alternative to other materials.",
    "Nascar Thunder 2003 is definitely the best racing game ever created. The graphics are unbelievable, the cars look awesome, and the racing is so realistic that any NASCAR junkie would love to buy this game.First of all, you can choose from over 50 NASCAR drivers and what seems like over 100 different paint schemes. You can even unlock legendary drivers such as Richard Petty and (the infamous) Dale Earnhardt!The racing itself is fantastic. Rubbing fenders and smashing into other cars-awesome! Nothing like seeing Jr. falling back out of sight. Throw in spectacular wrecks and knocking others out of the way, and you've got the perfect racing game.One of the most fun features of the game is Lightning Challenge. Battle your way through over 20 challenges ranging from easy to extremely difficult. I've been able to unlock Legends, Busch Series drivers, and even Tiburon, a 3 mile fantasy track where you race over 230 mph with no restrictor plates-sweet! I've also been awarded alternate tracks. It's awesome being able to race on everything from a night race at Rockingham to a road course race at Pocono.All in all, don't even bother renting this game before you buy it. It is amazing! Get Nascar Thunder 2003 while you can!",
    "Got this very inexpensively as an Amazon \"deal of the day\" and it is very impressive. The first few days, I did a number of counting steps checks and they were all right on the money. Further, this one uses a technology that is different from and far more accurate than my previous pendulum-based pedometers. The calorie-counter and fat-burned displays are a plus, as is the distinction between aerobic steps and non-aerobic. The fact that it automatically saves your last seven days of data is a welcomed feature. I highly recommend this.",
    "I give this watch 4 stars only because I've had it only a few weeks and haven't used all its features yet. To this point, its a 5 star watch. It looks great on my wrist and functions perfectly.Amazon had far and away the best price anywhere and I am very pleased with my purchase.",
    "I have gotten other types of reusable water bottles before that kept the water cold, but those where too big to use normally and the sports cap or wide-mouth designs made it harder to drink from than the store water bottles. So I decided to try to find a reusable water bottle like the kind you buy in the store, aka smaller sized with a narrow opening.Well, I found and got one of these...and it was perfect. It was thin enough to fit in cup holder, while the colored versions of this product (different page) are a bit too wide. The opening is a bit bigger than store water bottles, but it is the smallest I found and very close.If you want a thin, cup holder fitting, narrow opening, reusable water bottle like the store brands, this is the one! I plan to buy more soon!",
    "I bought two of the OmronHR-100 Heart Rate Monitors. One for myself and one for my mom, for Christmas. We both use them all the time we are exercising, and it works great. It is comfortable to wear, and accurate.I use many differant work-out tapes, and now I know which ones burn the most calories, because of my heart rate. It is a real good deal for the buck..",
    "I own two of the large sampras ball hoppers and one of these small ones......love them. First of all, I honestly think both the large model and the smaller sampras/unique plastic ball hoppers do NOT hold what is stated. Probably get 33 balls in the smaller one and 70-75 in the larger one (that's fine with me - who honestly is counting and perfectly getting every little ball in there). The balls will jam up a little bit if you try to cram every little ball in there. The company does need to re-design the interior of the basket. It's not smooth, so the edges can grab a few balls as you fill up the basket, and can scrape your hand a little bit as you reach in and out.I love using the smaller 36 ball hopper because I can bring this one with me at all times. If I'm playing a friend, we have plenty of balls to hit with and do a few drills. Going thru more (say 60 or more balls) gets very tiring and probably a little boring for the one who is doing all of the \"feeding\" during the drills. 30-36 balls seems like a good number to get thru a drill quickly, pick up the balls, switch and get going again. The main reason I really like the smaller size is to always have in the trunk and use for serving practice. Again, getting thru 30-36 balls seems like a good number to practice serving into one box, before taking a break, picking up, grabbing some water, relax for a few minutes and then switch to serve over into the other box.I haven't had any problems with the plastic breaking or splitting. All of mine are not abused, but they have been in and out of trunks alot and fallen over plenty of times on the courts. I only used my larger ball hoppers for dumping 75-150 balls into my ball machine. Otherwise, the smaller model is my bread-butter and go to basket for everyday use. The only other model out there that I would personally recommend is the masterpro 72 or 50 (or larger).....if you still need a basket that picks up and flips over to stand up. Those are very well put together too, but more on the traditional powder-coated steel construction model.",
    "This is exactly what I was looking for -- an inexpensive, easy-to-carry mat that gives me some padding while doing sit ups or other excercises on the floor. I'm very pleased with it. The one negative is that it doesn't lay completely flat when I roll it out, but I use a couple of hand weights to hold down the curly end. It rolls up very small to store in the hall closet. It seems to be sturdily made to last through a lot of sit ups.",
    "This gun isn't too bad but i would rate it a three and a half because it seems like it shoots at 185 fps, and the button for the flashlight broke the same day i got it. The stock broke like a week after that but i just duct taped it and it works fine. It also shoots 2 or 3 bbs with 1 cocking action, which can dramatically ruin the fps. It could be that i got a faulty gun in thousands or millions but thats just what happened to me.",
    "Just got this item. did a pull up or 2 to see if it holds me...so far so good. I don't need a tool to do push ups. Now to test the 2nd reason I bought this thing: sit ups. I wanted something that holds my feet down while I do sit ups (as advertised in the picture with the dorky haired dude right?) This is the point you realize you've been had. If anyone knows how to make this work (the sit -up part), I'm golden with this product, if not, lying to a customer PISSES ME OFF!(Please comment if you know how to make this bar hold your feet down whilst doing sit ups",
    "I have only been using this kit for a short time and already I stand taller, my breath is freer, and I'm waaaaay more relaxed. I even sit up straighter in my chair at the office--without effort! I've tried to get the same effects with yoga but no dice. This therapy/exercise/bodywork is amazing!",
    "Great toy that doesn't require a lot of assembly or batteries. Get two of these and just the pure fun of sitting across the room from each other is hilarious to watch your opponents' hair fly. My son and niece loves these (and husband). Hours after opening every gift after Christmas, these were still playing with these. I was afraid that the plastic inside would tear quickly, but it is incredibly strong. My son has had his for 2 years, and I just got one for my niece.",
    "This is a very nice dart board with many games to keep you entertained. It has 4-player simultaneous scoring. It shows green when a number is hit once, yellow/orange for twice, and red for 3 times. It flashes red when the number is closed out and should no longer be hit. It allows 8 players, alternating between the first 4 and second 4.The only gripe was that the Bulls-Eye spun when hit, so it would rotate down and neutralize the impact. This would sometimes cause it to not register. Otherwise, great board!",
    "this item was absolutely terrible. Immediately upon clamping it to my knife, it scratched the finish off of the blade. the stones do not work, I could do a better job with a hand stone in some spit. Do not buy this item.",
    "If you are looking for the real Reebok replica jersey distributed by the NFL this is NOT it! This is a fake jersey with cheap embroidery whereas the originals are screen printed. It is the wrong color blue and is made of cheap material. Don't waste your money!",
    "these straps are far shorter than other straps i have owned in the last decade. also, the material is coarse, unlike the white cotton straps made in USA.",
    "There are some ups and some downs of nba live of 2004. First of all, when you take the ball upcourt, you are sometimes met by a player and you can not get around them. You always have to pass it to another player. Second of all, you can never pick it off when the other team passes it in. You can be standing right in front of the player the ball is going to and you can press and press the steal button to no effect. The upside to the game is the awesome dunking. I'm glad to see that someone at EA Sports knows what it takes to make people buy their products. One last thing: One thing that pisses me off is that when you throw an alley-oop pass, when the player that is supposed to be dunking it is guarded, he always misses the dunk. I have to yell out loud when that happens. Overall, it's a pretty good game.",
    "I wish I had not bought these HotHands2. They seem to be half the heat of others I have used. They last a long time, but I need a lot of heat for my fingers, not a little. I will have to use two for each hand.",
    "These tires looked so cool online, and what an idea to have reflective qualities. So I ordered two. The reflective surface is nothing more than a powdery substance that was flaking off, as I removed them from the shipping box. It easily scratched off with little effort using my fingernail! None of it would have even lasted tire mounting, or it's first wash! I examined the quality of rubber and it looked like poor-quality (like tires from India, or other third-world origins). I folded the them up, and placed them back in the original container to ship back. After mailing both back to Overstock, the idiots there only credited by back for one tire (perhaps they couldn't count to two?). Amazing. Do not place these crappy tires on your bike. Purchase two of the very fine tires available for the same money, made my several good manufacturers, like Schwinn, Kenda, Michelin, etc...This is why here is never a lack of work for consumer attorneys, who can litigate so many things out there, designed and produced by boneheads, who don't know the difference. Hurrah for our consumer advocate attorneys, like myself,New Cruiser 26\" x 2.125\" Hazarea Bicycle Tire who, without them, life would have even more unreliable, and unsafe products ripping us off.",
    "Great resale item here at my store. It comes with a forever warranty and that classic stockman look. Jim s.",
    "We bought the coupe for our daughter's second birthday. She got in and out of it at least 20 times in the first hour! She loves it and actutually so does her 6 year old brother. Since it's winter and cold right now we've only used it inside.",
    "I've had this lamp for a few years now. It's very handy to have around in a power outage, and it's been camping with me at least 4 or 5 times. It's so handy while trying to put up a tent in the dark. The light output is pretty good and adjustable, and it will use rechargeable batteries, which are an good investment. Even though it is plastic, I've had no problems with anything breaking on it.",
    "An excellent little Monocular. Light and easy to carry, and the optics are better than I had expected. Well worth buying.",
    "very happy with product and seller, item arrived when promised and in excellent condition...been wearing necklace for over a week now and seem to help.all in all, i would recommend this product and seller",
    "Much has been written about the Razor electric motocross bikes. So, I would just like to add that the Bike stopped working one day after the warranty expired.",
    "It fits well, stays in the pocket, comfortable, compact. Not the best for some pocket carry, but does well in carpenter jeans, tactical pants, some khaki pants. Affords easy and quick draw from the pockets it fits.",
    "So far, this is the best manual pump I have owned and it is worth the extra money over a more basic pump.",
    "First thing. This knife is the sharpest knife I have ever received from any knife maker straight out out of the box. It's so razor sharp you will cut yourself before you even know it if you're not very careful. For the money you are not going to find a better knife in my opinion. It's well made, light weight and the clip allows for deep pocket carry. I would consider this an EDC knife if you live in a rural area (not a city knife). Also would make a good self defense blade in a pinch, but that is just a personal opinion and I would never tell anyone to use a knife as a weapon.",
    "I am very picky about watches, in the past I have had a seiko and a Buluva. I have only had this watch for 1 day but I love it and I am sure I will for a long time. I found it very easy to set up all the features, I did use the guide for some of the set up but it was easy to understand. Great price from Amazon, Great service from Amazon. Thanks to Citizen and Amazon!",
    "spring loaded pliers meaning after the pliers taken out, they are held in the open position by a spring. this keeps it in your hand and opens ready to grab (no need to wrap pinky finger around inside to open pliers in your hand) giving you a full grip. feels really nice in your hand, heavy duty. tools lock in place and the spring unlock works smoothly. tools are a little tough to pry out, especially if you keep your nails short (i do). out of the box they are very stiff, but with a little working back and forth they come out easier, though still stiffer than i'd like. may loosen a little over time, but better than falling out. looks and feels tough, i just bought 5 more as gifts to the groomsmen in my upcoming wedding.",
    "I was excited to see this product as I was looking for a growth chart for my son that wasn't girlie. I ordered it and it was delivered on time and in good condition. My only problem with it was that the \"sidelines\" of the chart don't line up where it is put together. The hinges are off just enough to keep the two halves from lining up.",
    "Just needed an extra master link to fix a bicycle. Did not find the item sold by itself in stores; chain sets only. Perfect fix.",
    "Does exactly what it's supposed to do. Still going strong and being used after 5 years of use. My pinky finger still can't push the last one all the way down.",
    "I wasn't a predator hunter before I bought the mojo. The last time I remember predator hunting was with my dad when I was 10 (33 years ago). I was trying to keep the price down since I didn't know if it was a type of hunting that I would care for. The first time out with my Foxpro stingray and my mojo critter was incredible. I hunt mostly south Texas and with a warm south wind blowing a great big red coyote came charging at the decoy at 4pm in the afternoon. The next morning I set the speaker out with the decoy about 15 minutes before official sunrise and had to run back to my stand to get my rifle to shoot the female that was running right at the speaker and the decoy. I got to the stand at 6:50am to start setting up and was done at 7:05am with another coyote in the dirt. In the last 5 weeks I've killed 3 coyotes and 2 bobcats hunting maybe 7 or 8 times during that 5 weeks. One lesson learned is not to point the speaker directly away from where your set up. The first time I made that mistake I had to make a running shot on a male coyote and never had a chance at the female that was with him because the male saw me putting my rifle on the side of the stand because I hadn't gotten completely set up before they came to the call/decoy. That's right. Called in two at the same time. I am by no means an experienced predator hunter. Amateur isn't even a good description. I've just taken it up as part of my therapy after coming back from overseas. I still like hunting deer. Nothing beats chicken fried backstrap and tenderloin, but predator hunting is an action sport. One word of caution-if you're sitting under a tree with the speaker beside you and the decoy a few yards away and it's getting dark and you have on a rabbit fur mad hatter hat, watch for owls. They don't discriminate. This is a good entry level decoy, especially for the price. I've learned a lot of predator hunting lessons with it before I started adding some other animal specific decoys. But even with those I'll use the mojo just to make extra motion by sitting it in close proximity to another decoy.When I hunted with my dad when I was little it was a nocturnal event. The latest I've killed any of the predators I've killed in the last few weeks was 530pm.I would like to see one created with a delay before it starts spinning to get back to your hunting position. Sometimes they come that fast. I've read the comments about them being cheaply made. I haven't had a problem. I'm not doubting the others stories, it just hasn't been a problem for me. It's not the most expensive one out there, but nobody can argue its effectiveness.",
    "an old favorite at a great price and the sheath is high quality as is the knife. Highly sort after frame. Great price",
    "We bought this for a girls soccer team. As you know soccer season is unpredictable. This has really been nice for the girls when the weather conditions have been less than perfect!",
    "This is the second Expedition watch I've bought, and I was happy with the first one. But this one's Indiglo backlight just stopped working one night. The backlight was one of the \"must have\" features I bought the watch for, so now I need a new watch even though everything else works fine.Disappointing, especially since I've read that other Timex buyers have had this problem too.",
    "It seemed like a bit much to pay, frankly, but as it turns out I think that the cost is fine for this holster. I use it with a Colt Defender and the fit is snug and secure. It does take a bit of getting used to having something inside your belt and if you haven't carried this way, I'd suggest that you borrow a holster and try it for a few days to see if the feeling is too annoying. I think that I'd go batty with a full sized 1911 carried this way.Great quality and made in the USA, which matters.",
    "Good pack. I went on a 15+ mile backpacking trip down the Grand Canyon with this pack. It is fairly small and only intended for a night or two. The upside is that it keeps you from packing too much weight. The pack itself is pretty light and made of a thin vinyl type of material. Though it is thin material it held up really well. 15 miles and still looks like new. the straps are really comfotable and all adjust to make the pack fit almost perfectly. The only other way to get a better fit is to spend twice the money and get a fitted pack with a custom molded hip belt. The only reason the pack isnt getting five stars is the lack of easily accessible pockets and maybe even the location of the hydration bladder pouch. All total, it was well worth the 60 something dollars that I paid.",
    "I am pleased with the \"feel\" of the chips, something hard to quantify. The case is nice enough. I made a direct call to the retailer and had the colors made to my specific needs instead of evenly distributed. Very nice over the phone. The set shipped on time and was received early. As some have said, the included cards are used sets from a real casino. I considered that a plus, as they have character, but I can see that not everyone likes that. I would buy from them again and recommended this set to my poker friends.LONG TERM FOLLOWUP: It has been several years of at least weekly use, and these chips are holding up extremely well. The color is holding fast (I have white, red, blue, black, and yellow) and not a single one has been chipped or cracked. The case is holding together, but losing the feet. It still contains and protects ships, which is the key thing.",
    "I use my inversion table every day, and have for the eleven months that I've owned it. It has stabilized a crippling case of sciatica so that I can function like a normal human being again, I can sleep at night, all without pills, doctors, chiropractors, and without pain! Any time my back starts to \"go out\" from doing firewood or twisting and lifting or whatever, I just go hang upside down for a few minutes and I'm ready to go again. It has also done wonders for my neck...I was getting so that in the last few years I could barely turn my head far enough to look both ways at intersections when I drive. Now I can painlessly and effortlessly turn my head when backing up, etc. Also, when my upper back locks up from sewing too long or being at the computer too long in one position, I can pop the kinks out of it in seconds on the inversion table. And I used to pay a chiropractor to fix these ailments, and the inversion table works better, faster, and certainly cheaper. It's paid for itself hundreds of times. One complaint- the foam handles have cracked and split, I think perhaps from UV degradation, as the table was sitting in front of a window all summer. This doesn't really bother me, as I really don't use the handlebars much, but the foam covering didn't hold up very well. Otherwise, the table is well built, easy to use, and a real good buy.",
    "this bike is very easy to assemble. both my boys love it, infact one rides while the other stands on the back. a good solid bike which will endure the throws a the roughist kid",
    "does what it's supposed to. works great with my standard weights. i recommend lifting with some gloves or the bar will tear up your palms a bit.",
    "My sister, nephew and I are in the south. Our family is from the North- all Yankee fans. I ordered this and my newborn nephew wore this to his first Thanksgiving dinner.THE FAMILY WENT CRAZY!!!! Everybody loved it, we got lots of compliments and of course lots of pictures were taken.We loved it!",
    "Seems like a well built bucket. Decent paint job and I like the handles being a part of the bucket itself, not an addon to unit.",
    "The seat is very uncomfortable, and there are no gears in case I might want to challenge myself.Going to put all that aside and try to get the best work out I can,,,,Here comes the Summer....",
    "I ordered this as it was advertized as being professional grade, like what you would expect to find in a good health club gym or the like. This ball seems no different than most others i've seen and used. I'm about 210lbs and when i use the ball for any exercise that involves sitting on it or laying on it the ball changes shape temporarily. When i get off of the ball it's not a ball so much as an orb. it returns to a round shape but for being as sturdy as Go-Fit seems to claim this thing seems to be crap. I'd recommend looking for something that is actually heavy duty if that's what you're needing. There are way too many junk exercise balls on the market and this one is a slightly better than average version. The 75cm size is really large too.",
    "I use this on a rig for warm water bass and bluegill (or whatever else may be biting). It's held up well to a year of regular use. Low memory, casts smoothly, and a 40 foot cast is doable even for an amateur. It sometimes gets dragged through branches and rocks, but has not shown any signs of wear.",
    "This net is perfect--especially with one simple alteration.Easy to assemble, large and sturdy--with some extras.If used outside in grass and anchored down, I am convinced it will collect real golf balls hit very hard and not topple over--but I don't know for sure.Here's the alteration. If you take the front floor strap that connects the left front to the right front and shorten it a bit by tying some knots, the whole thing will stand upright on its own. If you put it inside a house or in a garage and can't anchor it down, this little trick will make it stand upright and if you use wiffle balls, it will collect them without toppling over. However, if you need to move it around, it will twist and contort as you like to move it around, but when you are ready to set it, just push the legs out to their fullest extent and it is set.I use it in the garage with wiffle balls and pitching wedges to work on my stroke (I don't have enough head room for a full swing).",
    "I can not imagine not having one of these in my pocket at all times. They are so handy to have and the size make them easy to carry in all types of clothing. The sissors, blade and screwdriver are all you need for most situations. And, at this price who can pass them up?",
    "I really didn't expect such a solid machine for the price. It was a breeze to put together and fits in a compact space. Very sturdy with smooth performance. It's a machine that will be used and enjoyed. Great product!",
    "I brought these skates for my daughter who is 6yr old. I think these are a gr8 buy, they adjust to ur childs foot size. and they are much prettier than the website shows them to be, I am very happy. I tried buying pair of roll blades from target, walmart, even sporting good store they cost an average of $60 and up, good job amazon.",
    "Better quality than the original factory part. It was very easy to mount. The only negativewas that the cable was too long which you should expect on a universal replacement.",
    "Having been a runner most of my life my knees have told me more than once it is time to switch to a less impact workout. So I began a walking program. The Omron HJ112 was an excellent tool to help me log both steps and miles. Once calibrated to my gait I can now walk anywhere and get the mileage recorded. Well worth the price. PS. I have had no problems with my pedometer coming lose from the clip. I carry mine on mine hip side into my shorts or belt.",
    "colors are nice and vivid, but the quality of the flag is pretty low for the price. It will serve the purpose, but a white dowell with a orange piece of cloth would have served as well for the price.",
    "I guess it is my fault for not completely reading the description. My hubby can only wear 100% cotton socks...which I thought these were. Well, they also have synthetic fibers which make his feet stink. So again, I'm not 100% satisfied but that is really from my lack of reading the full description.",
    "I wasn't expecting the quality of this mat to be as good as it was. The density makes doing floor exercises much easier and the \"folding function\" makes it easy to store behind the couch. Update...after 2 months of use, the handles have begun to rip from the seam. All I've done is pick it up and put it back behind the couch 3 times a week. The pad is still good, but perhaps attaching a handle was a bad idea.",
    "i make jewelery and i use it for everything . cheaper this way then from a craft store.",
    "With a 3-digit combination, this lock is better used to protect against accidental (read kids') use rather than theft/illegal use. In my view, the lock successfully achievies this purpose. The lock is much easier to use than the cable locks typically supplied with new firearms.The lock has sliding little plastic \"knobs\" as well as softer stationary \"spikes\" to keep it in position. On my lock, the little knobs have a tendency to stick. It is not a big deal, just something to mention.Also, on my Glock 30, positioning the lock is a bit difficult - it helps to dry-fire and leave the trigger in the back position - not a fault of the lock itself, just be aware that fit may not be universal.Overall, I would recommend this lock for anyone with children or under statutory requirements to secure firearms.",
    "I just got this knife. I like it a lot! Everything seems to work great. It has a lot of tools that you would use and none of the ones that you wouldn't. It seems to be made very nicely. I would recommend it! As always, you can't beat Amazon's price!!!",
    "Very heavy duty horseshoe set. The only issue I have is I left them in the yard and the blue and red on the shoes faded in the sun. Other than that I am very pleased.",
    "Great product. Fits true to size. Kept my petite girls warm during a Stingray City snorkel trip in December. Would definitely purchase this item again.",
    "I recently got the chance to use my tent and it was definitely put to the test. It survived (with rainfly attached) a very turbulent Texas thunderstorm, only after the 3rd or 4th hour of rain did we get minimal seepage into the tent. Probably due to the tarp that we used to protect from punctures pooling water on top, it performed above expectations and was easy to set up. Good Buy!",
    "Knife was exactly what I was looking for, and was as described. This was a high quality knife at a reasonable price.",
    "The purchase of the high-step went very smoothly, delivery was quick and without event. The step itself is well constructed and as advertised. It is very stable and has good nonskid surfaces. It is used daily and seems to be holding up without problems.",
    "I bought one of these about three years ago. I put it on the dashboard of my pickup to keep the battery charged, as the truck did a lot of sitting in the driveway. It worked fine for at least a year. Actually I don't know how long it worked. One day, just on a lark, I put a multimeter on it to see if it was still working, and found that it wasn't putting out 12 volts. After almost two years since I bought it, I sent it back to Sunforce (in Canada) and they sent me a brand new one! I've since had the new one installed in the truck for over a year. Just checked it yesterday and it's still cranking out the volts. I have it wired directly to the battery, as my Toyota pickup cigar lighter outlet isn't active unless the ignition is on.I am buying another one for backpacking to run a AA battery charger and keep GPS battery charged. Because it's so lightweight, it should be very good for this purpose.Nice of them to send me another one after nearly two years!When I got the first one I checked to see if it would run a small AM/FM/SW radio without batteries. It did, with no problems.Good buy.",
    "Even though my waist is not small, there is only so much room on the duty belt. I prefer these straps to the more traditional handcuff case because they take up less room. Read the directions- they only snap and unsnap in one direction, providing extra security (and extra frustration if you dont know how to operate the snaps).",
    "First one I ordered has rust looking element where handle bars connect to scooter. Ordered a replacement (got quick - thanks amazon), but replacement also had some rust looking element, but not as bad. This is a sturdy scooter and holds my weight well (160 lbs). However, also noticed the back wheel brake is bent (and not from my riding it). Anyway, I think it is a good product for the price, but was not wowed by it as some reviewers on amazon.",
    "This compass is worth every cent. It has smooth movement and every feature that I need to get accurate and precise readings.",
    "This tool is great and the magnet is very strong. The added ball marker was an awesome bonus. Taking the ball marker out of the tools is a little hard but manageable.",
    "Really nice for car camping. Had coffee perking in about 15 min. A bit hard to adjust to low heat. Two burner is probably handier if you're not camp fire cooking too.",
    "I just tried using my pellet gun a few months ago but haven't fired it in a few years. It pumps hard and the pellet gets 1/2 way down the barrel and hangs up. Would like to take it apart but can't find a schematic for reference. And I'm sure a gunsmith might charge what the gun is worth so I'm kind of hanging out there.",
    "I couldn't find these anywhere but at a good price here! Love em' and wouldn't wear any other sunglasses especially as they are equipt with a script!",
    "This was a great find for our aerobic program. It's very sturdy, yet it is small enough to fit inside our equipment closet AND the dumbbells stay organized!I have to say - the folks at Amazon really helped out. At first, this was going to cost $140 for shipping alone from any other wholesaler/retailer. Amazon came to rescue by finding it FOR me in their supplies and they shipped it for free with Amazon Prime. Amazon is GREAT!",
    "The materail was a little thin but the size I requested fits well and has held up well after several washes.",
    "This Item was perfect for my boyfriends fathers day gift. My son and him had the same jerseys with his last name on the back. Perfect gift!",
    "These goggles are the best goggles I've ever used. They don't leak and they barely leave a mark around my eyes. The double straps keep these goggles in place. Infact, you don't have to go too tight with the straps. I used them right out of the box and they were perfect.",
    "i gave it a 4 out of 5. this probablybisnt the absolute best but is pretty damn close. the red light is useless but the white light floods out great",
    "As a newcomer to airsoft, this is the fifth gun (second rifle) I have purchased. It is the most accurate airsoft gun I have tried and feels far more realistic and solid than the others due to its good construction and obvious added weights (inside the gun).One thing others complained about, the cocking handle being prone to breakage, doesn't seem to be a problem in my case. I'm also not running around outside and working the action as fast as I can, so it's possible the handle is fine for casual use and not for serious use or abuse.As a longtime firearms shooter and collector, I was seeking an airsoft rifle with decent accuracy, so I could get some casual target practice in the house, when weather or time prevents me from going to the range. This rifle can put all its shots into a 1 1/2 inch bullseye at about 16 feet- the only airsoft gun I own that can do this. My Crosman R36 (M4) can't even keep its shots in a paper plate at the same distance!Also, while the red dot sight packed with this rifle is garbage, the two magazines are top-notch.Well worth the price I paid ($29.99).",
    "Great classic airgun with lots of potential, but in need of an aftermarket spring kit. This stock was better than the new ones out and well worth the price.",
    "I bought this for snorkeling to keep camera and passports dry while in the water. It was a disaster. It may have been submerged momentarily at times but not much at all. When I opened the bag to get the camera out, there was about a pill bottle full amount of water in the bag. The camera was ruined and is now garbage and the passports were soaked. Unless you just want it for the beach and not go in the water, don't bother with this product. Thanks to Amazon for their fabulous return policy all is not lost. I think I'll be looking at the Otterbox products or equivalent. They look much better made to keep \"dry\".",
    "after the first 50 shells with my twenty gauge I had a shoulder bruise for 6 days..screw this and after checking at Gander for like 40 to 80 bucks I found this very good value to stop the bruising and make auto trap more fun...Look I think the manufacturers should offer this product with the sale of the weapons..maybe I am a wus but shotgun bruising is nuts...Simple fix for a old old problem",
    "I am used to a dive mask so these were easy to get used to. I hated how traditional swim goggles left that annoying ring and I am not a racer so the extra drag doesn't bother me. They are great. After I bought them, my mother and father got a pair for them as well. They enjoy them and my dad gets more use out of them than I do now.",
    "First off I'm not an expert at snorkeling, but I have spent a good amount of time snorkeling. This is one of the better mask sets I have used. The Snorkel is wonderful. The automatic closing never had any problems keeping the water out, and the purge on the bottom did a great job if water did get in, which was only when I let the snorkel out of my mouth. The mouth piece is very soft and didn't cause much fatigue. The mask sealed well to my face, and I never had any leaks. This is an amazing mask /snorkel set and highly recommend it for anyone from novice to intermediate.",
    "This video is broken down into 3 parts Strong Legs, & Abs 2) Chest, shoulders & Triceps 3) Back Biceps & Abs.You can do the whole video at one time or do rhe video one section a day.Cathe is a great instructor and this is a great video It has an gym style feel and she will work you. It does use a barbell and a step bench. I do this video at least once a week. along with my FIRM videos. This is a great strength workout It's not for wimps be prepared to WORK IT!!!!!!",
    "This camera does everything it says it will. I love it. I have used it to film kayak trips, and playing in the pool, it is great. Also, I had a small issue with the case, and I contacted GoPro, they had FANTASTIC customer service! They resolved my issue immediately and got me a new case sent out.buy this camera, you can't lose for the $$.",
    "I really wanted this leatherman. I got it for a great $$! I love this wave leathermen. The ease of use is amazing! I use the screwdriver and pliers mostly. It is very easy to open and find them and then close without looking at what your doing.",
    "last september i sunk one of these bad boys into an elk at 25yards with a 65lb bow. Good penatration clear to the fletchings, and a healthy sized enterence hole. the blood flutes that run parellel down the sides of the blades did there job well leaving a solid line blood trail right to my bull, granted he only made it about 30yards before falling dead. With a little carving the striker came out in just as good of shape as it came out of the package.i also stuck a mule deer with one. hit a rib on the enterence, and still passed through like paper althou it did put a ding in one of the blades. not a big deal as replacement blades are like $6. He ran about 10 yards layed down and was out.g5 has made me a beleaver of the reinforced tip, and i would incurrage anyone looking a drop an elk to give these a spin. There durable, and accurate.",
    "The hammock is very light in weight, and packs in a little football shape. You'll need the webbing to secure it to trees or whatever, though.The material is nylon based and soft on the skin. If it gets wet, it dries fast.The carring bag is sawn to the hammock's side, so you'll never loose it.I recommend using buying it with a travelling pillow also.",
    "A no mess scent drag that alows you to apply scent when you want. I hook mine on the back of my boot loop and drag it behind me . when I reach my hunting spot I either reel it in or just take it off of my boot and hang it from a tree branch. At the end of the day just reel it in and close the cap and your done.",
    "Purchased the Schwinn 418 after reading several favorable reviews and not seeing any negative comments. After using it for 2 weeks it developed an annoying squeal in the pedal cranks. I disassembled them and greased them using wheel bearing grease and within a few minutes of use again, started squealing. I called Schwinn, got voice prompts and ultimately a voice mail, left message, also sent e-mail asking if this has been an issue, if so, do they have a fix for it. 4 days have passed and they still have not responded.I like the design and the computerized programs, makes it fun to use after having a manual elliptical for many years. Overall, I think it is a good product, if only we could get it to stop squealing.",
    "We have used this tent twice now and I like it more each time. Even in a summer monsoon the inside was totally dry. I have a bad back and got tired of bending to get in & out of a tent. This one is perfect! The family we camp with is thinking of getting it now too.",
    "The Road Morph G pump sets the standard for frame pumps. It is well designed and powerful. The gauge is hard to read, but does provide a good enough reading of tire pressure. I went with this frame pump over CO2 cartridges because I want reliability on an upcoming century. It is not as sexy as a smaller pump, but the extendable hose means this pump won't destroy fragile valve stems. If I run into cyclists stuck at the side of the road, this pump will always be available.Two thumbs up.",
    "I've been using it since I got it and the results are great. I'm losing fat and building muscles at the same time.I feel good. Get one.",
    "These are great chaps. I like that they are easy to clean and easy to put in and take off. nice and tight! These are just great to everyday use in english riding. These are one of those products that needs to be a part of your attire. New to english riding buy these there not expensive and look great. They are just Great and I love these chaps!",
    "Sean T kicks my butt! Love it and love the fact I can work out in my own house without anything but these dvds.",
    "It's a good carrier, but I hate having skis in my hand. Makes it tough to walk. I'm looking for one I can wear on my back.",
    "This is an excellent entry level heart rate monitor at a bargain price.I was looking for a heart rate monitor just to do the basic job, and at the least price i could find, when i found this monitor. at just $13 here on amazon the price was too low to miss, even it were not to work. well to my astonishment it worked perfectly.The monitor provides a watch, heart rate reading and percentage of MHR (maximum heart rate). how much time you have been training (actually for how long the monitor has been detecting a signal from the chest strap) and calories burnt.to my astonishment the chest strap that came with this monitor works with my treadmill, a proform, and vice versa. the signal form the chest strap that came with the monitor is a bit weak though, so you have to be really close to the treadmill receiver to pick up a signal. but i guess the reason is that it was designed to be picked up by the watch in your hand, which it does perfectly. the opposite though is a great convinience, since i can use my treadmill chest strap with the watch. since the chest strap that came with the watch is a bit bulky, I found this as a great advantage to be able to use my treadmill chest strap.in addition to the bulky chest strap, the other disadvantage is that the watch does not have a stop watch. you can use the training time timer as a stopwatch by resetting it just before your event, but this is not as accurate nor as convenient as having a simple stop watch. i dont know how they missed that.if this watch was priced in the regular $40 zone i would have gived it a 4 star for the lack of stopwatch and the bulky chest strap. but at $13 i think it is worth every penny and much more. and it does the basic job i bought it for pefectly.",
    "This rifle is long and kind of thin. The quality is good but I wish there was a stronger loading lever instead of the bendable plastic one they make it with. Also, it took me a while to figure out the direction of the loading door in the stock for the BBs but after a series of deductions I found the angle needed. There's nothing in the manual that indicates the direction to open it. Try not to break it off. heh",
    "I purchased this pedometer last week from Amazon, and had it set up and going in no time flat. The instructions were easy to understand and the pedometer was easy to program. Accuracy is unmatched compared to other pedometers I have tried. This pedometer is rated highest by Consumer Reports, and I would have to agree. My only complaint, and the reason that I gave it 4 stars instead of 5, is that, using the belt clip, I have had it fall off several times, and in fact I thought I had lost it altogether but ended up finding it under the bed in a room where it had fallen off while I was vacuuming. It has also fallen off when I was walking. Thankfully it did not break. I would say it is impact resistant since it fell onto hard surfaces several times without incident. This model does come with a strap, which I will now use every time. Otherwise, I am very pleased with this pedometer and would highly recommend it. I would definitely purchase it again.",
    "I purchased this for my husband who's a truck driver. This stove crisps pizza, heats stews wonderfully, and steams veggies. I recommend using heavy duty foil to avoid spills which will burn on the bottom. Hubby is the envy of his co-workers and a very happy man......which makes for a very happy wife.",
    "Cheap stuff that does it`s job as needed. Sturdy and practical, all you need to set up/mount your board. What more do you want?",
    "The watch is beautiful and has held up great in the 3 yrs I've owned it. The band on the other hand is horrible, I have had to have it repaired several times due to the black links falling off. I liked this band for my husband better due to it being more sporty rather than dressy, however I now wish I would have purchased this watch with the all titanium band.",
    "I searched everywhere for a trunk mounted bike rack for my car. I purchased the Hollywood Rack express3 because of the reviews and the price value. The rack was very easy to mount and holds my bike rock solid. I have a 50 mile commute to work and the bike trails every day and I do not worry about my bike moving or coming off. The mount is so solid it feels like it is part of the car! My bike does not move at all. As instructed I check the straps regularly (especially when they were new) It has a utilitarian but quality look about it. Overall I am very happy with my purchase and have no problem recommending this rack.",
    "I have been using the powerblock system for 12 years.......I'm a 63 year Old Special Forces Vietnam Vet.......I also hold a personal training certification from ACE........I have been trainng and body building for over 40 years.........And I can tell you that the powerblock systemis the finest dumbell system i have ever used......I use mine 3-4 times a week...I get a excellent workout, that helps me stay very fit.........And i must tell you i like the feel of the product as well as the sturdiness....of the blocks...of course you have to be careful as you would with any heavy weight set... just use common sense and keep training....I would not use another brandand I reccomend them highly",
    "Very nice watch. This was my first premium watch purchase. The watch is very eye catching and the quality is superb. It has a nice fit and finish to it. I would say its up there with Omegas and Tag's from what I can tell. I have only had it for a few days now but so far so good!",
    "This an excellent buy for someone looking to increase the amount of shots on 1 fill. It is so far the cheapest 20 oz I have found on the internet.I chose standard shipping and received the package right on time! The packaging is fair and the tank is in top-notch condition except for a minor knick in the coating which does not affect the performance of the tank in the least. I've shot about 200 balls through it and it's performed excellently.Also the Hydro date is very recent:)GREAT BUY!!",
    "I ride a bike indoors during the winter months. I wear a sweat band in an attempt to cut down on the sweat dripping onto my bike and the floor. I purchased three of these and have found them lacking in absorbency. I have other bands purchased from a different manufacturer and can ride a good 20 miles before the band is saturated. These bands barley make it 5 miles before the sweat is dripping from my forehead. They are comfortable and fit well, but their ability to hold moisture is severely lacking.",
    "Superb instruction and very complete. Don't even think about strapping on a kite or board until you watch this.. even before taking kiteboarding lessons. Keep it as a go-to guide while you progress and learn since all levels are covered from beginner to expert and many lessons are provided on safety and what to do when you get in trouble. Have fun!",
    "just as the title suggests, this is a great snorkel set for what it is... a relatively inexpensive \"all-in-one\" kit. The fins give pretty good propulsion for what they are... SNORKEL fins (not SCUBA fins)... if you plan to use these for scuba, sure they'll work, but you'll be disappointed in performance. Snorkeling however, they work just fine, perhaps even above average with the dual-flex type fin materials. The mask fits well (though this may vary with facial feature shape & size) and offers good visibility. The silicone material really seals well, and for normal snorkeling, shouldn't need to be SUPER tight... just snug. As for the snorkel, as another reviewer pointed out, it's not really a true \"dry snorkel\"... this is more of a \"splash-resistant\" design, which is just fine for the average vacation snorkeler. Face it, if you're a hard-core snorkeler, you most likely wouldn't be looking at ANY \"all-in-one\" set... you'll be looking at individual components tailored to your needs and preferences, where each component will far exceed the cost of this all-in-one kit. This is great for a weekend warrior... or for someone planning a beach vacation. Buying this set will cost the same as one or two rentals of the same equipment at a beach resort area... and you're not worried about how well the rental place sanitizes the items. Again... for the price, you can't go wrong for what you're getting.",
    "The light is bright, but has 2 major problems. 1) as stated in other reviews the switch is very poorly designed. Most of my low light riding is early spring and fall, when I often need full finger gloves. The switch is hard to use bare fingered, impossible with gloves on. It isn't really a switch, just a marked spot on the case. Which leads to, 2) I turned the light on yesterday when caught in light rain (wanted visibility), reached back to my bag and pressed the switch. Apparently that was enough to open the case, because when I went to turn it off after the rain, the light was gone, all that was left was the back and the clip. For $25 I expect much better.",
    "These Aero bags are the perfect bag for mountain or road biking. I do recommend the small for road and the medium for mountain if all you care about is carrying along emergency and maintenance supplies. The medium on the road bike looked to big. Also the velcro mount may be better for certain mountain bike saddles with suspension seat posts or if you ride with your saddle far forward.",
    "My son just received this as a 3rd birthday gift. It seems very sturdy, was easy to assemble, and the handlebar height is in fact, adjustable. Always use knee pads and helmet with this - just incase.",
    "My wife and I bought 2 of these several years ago when it was just the two of us and a small tent. We addedd 3 more sets for our sons. The nesting style makes these easy to keep track of and pack. The case they come in was much sturdier when we bought our first sets years back. I'm not sure how long the cheaper plastic case will last. The set is durable and easy to clean.",
    "I used my Leki Travellers for a hike across northern Spain to Santiago Campostela, about 160 miles total. I have a torn ACL in one knee and arthritis in feet/ankles. Combined the Leki poles with Z-Coil walking shoes and had no problems (unlike several fellow walkers with normal knees & feet). I'm sold on these sticks; they really DO relieve the burden on knees and ankles. They're light and folded easily so they went into even smallish luggage. They improve the workout with upper body exercise...I just fly! They're my best walking buddies.",
    "Does exactly what I hoped it would - accurate, easy to use, very motivating without being annoying. Even survived a brief plunge into a hot tub!",
    "I bought this for my wife as a Christmas present. She will love it! And we will be the envy of all of our University of Alabama neighbors! :)",
    "Best tire for the price. At half the price of most tubulars you get solid performance, good weight, and good grip. Great for criteriums and shorter races. If centuries and high miles are your thing invest in a more expensive pair of tubies.",
    "So far these jump ropes have held up very well. We have only had them for a few months, but so far, so good. Wish they had more color options.",
    "Regarding I am currently in Africa, and all my orders have been delivered via P.O. Box in NY City, I am more than satisfied. Moreover, all the purchases I made, but one, Kingston memory, were delivered on time, with no problems at all regarding the state of product, package, etc. That's the way how to do the job. I will continue to be your customer because of your full profesionalism.Best regards.Mario Sebetovsky",
    "I got this for my Husband to go in a survival kit. He tested it out and the flame it made was huge! He was very pleased!",
    "This Winchester 22-41206 Large Bowie Knife with Sheath is everything as advertised. The quality, look and feel is superior. The sheath is very good and fits the knife very well. The shipping and delivery was as advertised and arrived in good condition, and within the timeframe expected. I HIGHLY RECOMMED the seller and will purchase from them again.",
    "you don't need a review for this, if you are looking for a decent, inexpensive watch. get it. I like this one more than the one with the velcro band because the bad doesn't get so disgusting after wearing for a year straight.",
    "This light won't stay clipped on to the back of a Topeak rack (one of the major reasons I got the light and the rack). Everytime you hit a bump if the light doesn't fly off the batteries bounce and the light is turned off. Took off my Topeak rack and went back to my little seat bag and my Planet Bike flashing red light. What a waste of time and money.",
    "Excellent product - much higher quality that I purchased 2 mos B4 at Big5 Sports, Seattle area, and at same price. Bought the yellow ball; but it arrived with green perm. ink stains on it. Ink stains do not affect performance in any way; just looks crummy.",
    "Definitely not as quick to start as lint/cotton balls (sometimes takes more than 1 match) so don't expect it to replace tinder especially if you use flint and steel, but once started they last for a long time (surprisingly long) and seem to burn pretty hot, so they should be able to get hard to light wood started where shorter burning tinder might fail.",
    "I found this HR Monitor and watch to have a lot of functionality but I had a hard time getting it to work correctly and match up so that I could use it appropriately. I used it for a little while and just stopped using it.",
    "I gave this floating table tennis game to my son and granddaughters. They started playing with it in the pool the day they got it. It has so far survived numerous games and one wind storm which blew it out of the pool.",
    "This watch is awesome! My sister had gotten the newer version of it and told me how neat her's was. I had been using a cheap-o heart monitor watch that I'd gotten at Target and I just didn't feel like it was giving me an accurate reading for my workouts. This watch continually takes your heart rate (via the chest strap) and relates it to the watch so that you can read it. It also communicates with newer cardio equipment like the Cybex and Elliptical machines. You can also change the battery yourself, which cuts down on maintenence costs big time. One complaint is that on the first day that I wore the chest strap, I experienced some chafing. However, I later learned that it was user error as I'd made it too tight.",
    "there is no question about the rotation of the ball with this pitching aid, great for warm-up and/or practice of new pitches",
    "Initially looking at this Suburito, I expected it to be like a Boken, light and fast. It isn't. However, that's not to say I don't like it. Its extra heft makes it much harder to block and a much more effective training tool. If you want to build up some arm muscles to use a Katana, or you just want more heft than a Boken, this is a great pick!",
    "I purchased this item for a gift and had it shipped straight to my father for his birthday. When he installed it onto his bike,it kept the correct milleage but did not keep the correct speed and he had to send it back. They don't like purchaseing on-line due to this problem. I wanted to show them that one could purchase items on-line and get the correct item and an item that worked.SincerelyBetty Jean Richmond",
    "this is a great product, the angle of the stock is the most comfort ive felt in a low cost stock. Before my regular stock used to rub on my cheek, now i dont have that problem. Thanks amazon, delivery was great however it took more than 5 days to recieve it but it was worth the wait.",
    "This is at least the third pair of these that my son has had. It is the only headgear that he has asked for again, before he always switched each time he needed new ones. Wore out one pair, only had to get a new one this time because his old ones had tape on them, all the wrestlers like to tape the straps and this year our state school association does not allow for any \"modification\" of headgear, so we bought these. An excellent product, I'm sure when he wears these out we will buy another.",
    "I have been using lexol for years. It works great on leather car seats making them supple and soft without leaving an oily residue. I use lexol on just about all leather applications, belts, wallets, gloves, and sofas. It will not change the color of most leather products, including boots and shoes. Leather products that are treated with Lexol will last decades.The large container shown is this review is a good value and can be used to refill the smaller spray bottles of Lexol.",
    "While I can't complain about the quality of the construction of the pan, I did have a significant issue with it. Somehow, when moving, the moving company lost the pan from my old 505 scale. This replacement pan was too heavy for the scale. I was unable to adjust the scale wheel enough to zero the scale with the pan on it. The pan was a 4.5 grains too heavy. So rather than attempt to weigh powder charges and subtract 4.5 grains each time (a big issue when loading 6.6 grains of Unique for 44 Specials, for example) I ground and filed away metal from the outside upper edges of the pan until I was able to zero it on the scale. This may have been needed because my scale is old (late 80s), I'm not sure, but if I had this trouble others may as well.",
    "I couldn't find a better value, if I kept looking. They seem to average about 4-5 dolars a piece, including shipping. That is about the same price as the LED \"whirly gigs\" kids play with, but these offer good light during an emergency, as well as being someone entertaining for nighttime imaginary play.Like other reviews, fragile, not for kid play if you want them to last for along time, but you get three at a time. I think they are better than equivalently priced flash lights.For the price, you could buy two three packs easy, and light your whole house during an emergency and keep your kids calm and entertained.I folded kleenex and placed it in the battery compartment to keep the batteries in place. No safety lock, so I would say supervised play for any child under 4. Light section unscrews relatively easy should you need to replace the battery and it looks like they use a standard flashlight battery.Lastly, I really like them for the AA batteries that I buy in bulk.",
    "The reflective stripes on the vest are undoubtably reflective. A friend once took a picture of me with the vest on at night with a flash camera and I came out as a big white blob due to the reflection. Another benefit is that it is very light weight and can be easier stuffed into a laptop bag or briefcase if needed. However, less than a year of owning the vest, the seams are already coming apart. I have never used the pocket in the back but are skeptical it would hold up to much weight.",
    "These rings will be great if you plan on using the open sights on your 22 along with your scope. Thus far, I have not used my open sights.",
    "The product is well made, we expect it to last the life of your small work horse. The quality is good and it washese easily as our horse loves to roll in the mud!",
    "This knife has everything you will probably need and nothing more [except the hook thingie i've yet to use] in a slim package. My fav over the years.",
    "Nice water proof carrier with room for most things you would carry on a bike. It mounts easily to almost any bike rack. But watch out for the the lid when it raises: In order to open it, and not hit the bike seat, it must be located 4-5 inches back of the bike seat. That wastes about a third of the length of your bike rack and forces you to mount the carrier so far back it overhangs the bike rack by about the same amount. Ideally it would mount flash to the bike seat, but with the current hinge design it's impossible. I recommend a redesign by the manufacturer to hinge on the side (two side by side hinges in the center of the side with opposing snap locks near the corners). Then you could open it and still have it mount flash to the back of the bike seat.",
    "I tried these goggles after I kept getting headaches from the usual type of swim goggles that fit closer in the eye socket. These are very comfortable (for goggles, anyway) and dont leak. I also dont get the deep indents in my face that I get from other goggles.",
    "This cap fits perfectly. The fabric is soft, there's a little bit of elasticity, and it's the kind of old school ball cap that the players used to wear. The New Era hats (the kind that the pros currently wear) look funny and don't feel right. This cap, however, is excellent. I plan on getting one for my dad for Father's Day.",
    "I bought this product for my husband it fits well washes great. We have never been disappointed with Carhartt products yet.",
    "I bought this so that I could tell how many miles I was riding and how long I had been riding while riding. I found it extremely difficult to initially set up even using the instructions. Once I did set it up, it would display my speed while I was riding, but I couldn't get anything on the bottom line to show time or distance, it just blinked the same number over and over. When I got home, I was able to figure out how far I went and the time I was riding, but couldn't figure out how to zero it out for next time. It also kept falling off the bike. The last time I used it, it flew off when I hit a small bump and I didn't even stop to retrieve it.",
    "Easy to set up, well engineered and sturdy. 20 minutes and just changing positions using your own bodyweight will give you an excellent workout, this is the machine!",
    "Received as promised. No need to contact company. Purchased for company gatherings. If there are breathing problems with strong odors recommend opening package outside.",
    "I purchased a new D-cell LED-Maglite since I gave my old non-led one away but I forgot to take the anti-roll device off my old one. Well I figured I could live without it, but whenever i went to put the light down, it would roll away!I quickly purchased this kit and solved the problem!I used the mount on the seat bracket of my Jeep and it holds it nice and snug, On a 2 cell Maglite you can probably get away with using just one mount since it holds the light so snugly.The lenses you can use with the anti-roll device, you dont have to take the head apart on the maglite to put them in, like everyone else I will probably never use them.",
    "I received my cue stick by UPS in the time frame indicated by Amazon. It arrived well wrapped in plastic bag and protected by an additional plastic covering. The box was perfect size. I have yet to use the cue, but I certainly give high marks to the seller. The stick is STRAIGHT! That certainly can't be said for some of the wooden sticks my son has. I am excited to play with my new STRAIGHT cue stick!",
    "Overall, I like the pocket rocket. It's easy, compact, lightweight and effective at boiling water. However, because the flame is essentially a torch, it would not be appropriate if you'll be sauteing or frying fish or anything like that. So if you're a backcountry chef, look elsewhere. If you just want pasta or dehydrated meals, the pocket rocket's price can't be beat.",
    "I bought this for my Marlin 60 that has a large scope. Fits perfectly and the thick padding protects it very nicely. I was told value equals quality and features divided by the price. I cannot even find another gun case that comes close to the value of this product.",
    "A recent heart attack (my second) has re-motivated me to keep up on my physical condition. I refuse to join a Gym (kinda fussy about wallowing around in other peoples sweat). I found it was far too easy to \"skip a jog\" because it was too late, or because the weather was not ideal, or whatever. This purchase eliminated all those excuses and more. This machine is nearly silent during operation (I huff and puff louder than the beeps and clicks it makes). It can be moved around, and does not take up as much space as some of the other home Gym equipment we have all seen. It took me less that 1.5 hours to assemble, and everything worked when I was done. The assembly instructions were not the best, and you need to be careful not to over tighten the hardware (the screw threads strip easily), but for the money I think this is a great product. The shipping company was a little rough with the shipment, as one of the heaver components had poked a big hole in the side of the box. I'm amazed that none of the smaller parts were lost due to the compromised container. The part that had poked through the box was slightly bent, but it still functions properly and it wasn't worth whining about (I sure wasn't going to ship this heavy beast back!). The lack of a display back light is a bit of a bother (but only when using the machine after dark), however I would not pay the extra money for the next model up just to have that functionality. I have already modified some parts of the unit to allow me to hook up my Garmin forerunner and its cadence/distance sensors. It took a bit of fidgeting around, but with the modifications I can now track and record all my work outs on my computer (running, hiking, mountain biking, and elliptical trainer). I would recommend this product to a friend.",
    "Plenty of room for any person. Good for hot or cold. Easy to wash.",
    "good quality but not as cushioned as I expected. also doesn't come as far up my calf as I expected. I'm looking for other socks.",
    "It's very good for training from the free throw line, my son even shoots over. Just be mindful of your distance.",
    "I had a yellow Xertube and used it a lot with the exercise program I'm currently doing (CLX by BeachBody). But, the yellow one is the easiest resistance level, so I wanted something to use that offered more resistance. So far, I have used the red option and it is definitely harder than the yellow band I had before.These bands are reliable and easy to use. I like using them as a way to add resistance to the lower body.",
    "The trunk bag is execellent. It arrived in very good shape, boxed appropriately and within the committed ship date. Very satisfied and would purchase from the store again.",
    "I recently purchased a Powertec Hyperextention/roman chair... the machine itself is solid as a rock, pads are good, love the machine itself...the problem I have is when the machine was delivered to my house the box looked like it had been ran over, thrown off a truck, beat with ball bats and anything eles you could think of. There were parts of the box that were actually ripped all the was through. The machine was scarred in several places, 2 plastic sleeves that insert into the foot slide platform were destroyed and the worst thing of all was the one peice that locks the seat into position was missing. I could deal with the other things but at this point I can't even use the bench because the seat will not lock into place. I started calling Powertec and they would transfer me to the parts department where I would go into a voicemail box...mind you I was not asking for a free replacement, I was willing to pay for the part...I would leave messages and never get a return call. Took me 2 weeks to actually talk to someone in the parts dept, at which time he said he would send me the parts at no cost...sounds good, right? I was promised the parts would ship on Monday 8/1/11. Today, 8/11/11, I still do not have the parts, been over a month now, so at this point I have with shipping cost all together $384 tied up in a machine that I can still not use. I am to say the least very unhappy with Powertec and to be honest with Amazon. I have tried to find some place on their site to file a complaint or get some help and not been very successful. At this point I would have to say I am very disappointed with both...I hate to think I paid this much for a product and may have to end up making the part I need myself use to be able to use a machine I paid $384 to get.",
    "The chair is as good as others claim, but be warned, the rocket scientists ship it in a box with pictures all over of what is inside!! So don't plan on any surprises once it gets shipped!",
    "The Schwinn 430 eliptical was very easy to put together. I am a woman and put it together by myself in a few hours. I couldn't get the electronics to work, but called customer service and they were very helpful and sent me the parts I needed. The machine is very quiet and the operation very smooth. The computer console is easy to understand and program. It's well worth the money.",
    "great product. buck makes a quality, durable knife that will give many years of service. would buy it again. perfect for a gift.",
    "I bought these instead of the Casabellas that I usually use - just to give them a shot. My main problem with the kitchen gloves is that they end up with holes in the fingers and get water inside - which drives me crazy. I thought these being thicker would last longer... But I was wrong. So, they're pretty much the same quality (for me) in terms of longevity.",
    "Popped in 4 AA batteries and hit switch and it did exactly what it was supposed to do. I ran it for two hours out in a field before calling it a day. The magnetic attachment makes it easy to put away as does unscrewing the solid steel post. The item is well built very well, without any flaws, requires no tools to set up or take apart including changing the battery.",
    "I am not that familiar with harness straps so this feature might be standard. However I am very pleased with how it hooks up. It's more that big enough for my 6mm mat.",
    "I have 2 types of chips, both 11.5 gram. One is from a 1,000 chip set (a nice one) and the remainder are \"dice-style\" from Wal-Mart. These trays are a little tight with the chips from the nice set, but perfectly fitted for the chips from the Wal-Mart set. Overall, this product should be excellent for any user.",
    "I'm accustomed to Dansko, Sanita, and Allegria shoes, which are all very comfortable, but require a break in period. I'm ok with that. But these never seemed to get broken in. Maybe my feet are just used to soles on my regular brands. I'm on my feet 9 hours a day, on concrete, walking around and up and down stairs, for several miles a day, sometimes with long periods standing (I'm an adult-education instructor). I have heard so many great things about chucks and really wanted a different shoe I could wear from time to time, and was hoping these would be it. I wear a 10 (40) in women's and the 8.5 chucks fit my foot well (thankful I read the other reviews and knew what size to order) but they just aren't the shoe for me.",
    "I live in the deep South and I wear these mainly to work in the yard. They are light weight and fit well.",
    "Im not a competitor or anything so I only use this gun for target practice i.e. shooting cans or targets. It's pretty powerful for a pistol. I love the laser and the flashlight feature however the silencer is useless becasue the sound of this bb gun cannot be muffled. After a while of continuous shooting of this gun It might start to hurt your hands every time you reload because this is a spring powered gun. It comes with glasses which are a nice safety accessory",
    "I bought this because it was one of the only ones that I could find that ould fit me. I'm kinda big guy and have a treadmill at home that doesn't monitor my heartrate and this one did the job right outa the box. It's basic and all I needed I would buy again.",
    "After having played the 2006 version, I'm REALLY disappointed and want a refund, but oh well. The game is really bare bones, and somewhat buggy. I came on here to write this review because some of the game is annoyingly buggy. A linebacker went past my quarterback, not even close to tackling him, but the quarterback fell down and lost yardage. Also, running plays that go up the middle is completely a game of chance because the middle turns into a blob and you just have to hope that the back jumps or something. Then, there is the momentum meter that makes fumbles and interceptions magically happen, all too often. I hope Madden 07 is better than this.",
    "For the price, I thought this was a really good deal. Dual suspension and aluminum frame. Unfortunately, the other reviews regarding the condition of the bike through shipment are absolutely true. Upon receipt of the first bike, the shifter was bent, so I had to return it. Upon receipt of the second bike through a return, the rear wheel was warped and the clamp for the seat was missing. I would think that there is a better way to ship this bike to avoid these issues.",
    "I love this little gizmo. I am not a gizmo person. I struggle with tech. So it is easy to set, and easy enough to change the battery (which is good for about 18 months). This is my second of these pedometers. I like it that much. I had others and they were awful,regardless of price. I have spent over $100 on one that was not as good. So price for this unit (under $30) is great. Battery did not last very long on the first one, second battery was better. Had to replace first one because it did not survive a trip in the washer/dryer. Bummer. But this unit is great. I will buy another when it wears out. I have it on me all day every day for over four years now. It has a belt clip which I do not use (no belt usually) and a little leash which I do use to keep it from slipping out of my pocket. I will buy another. I call it my \"accountability partner\". As a WeightWatcher I must get the 10K steps per day into my routine...and this little gadget is better than a day planner for keeping me on track. Go for it.",
    "Really big shooters box, lots of room. Gun rests hold all of my rifles securely, but the problem is storing the removable rests. They are somewhat awkward, do not fit together for storage, and take up a good chunk of room in the bottom. A better design would incorporate a snap-onto storage bracket on the sides or top. The removable tray is very handy. I cut some foam and put it into the bottom and cut holes in the foam to hold things like bottles of solvent and oil, cans of compressed air, etc. Would like to give 5 starts but cannot because of rests taking up space. I would recommend this product to someone else but would like them to know what to expect.",
    "The Sigg dropped off the kitchen counter and is really one of a kind...A big sigg with a dent bigger than the one on my fender.I got caught up in the Sigg hype...but this little personal item is still cheaper and cooler than an IPod...",
    "As an electrician I use this lamp on a daily basis. From underneath a home, in a attic, or repairing a generator at night in the snow. Always lots of light thrown down exactly where I need it with an extremely easy to adjust lamp even with gloves on. This main lamp on this unit is very bright, not Surefire e2d bright but much brighter than my Petzl lamp or my AA mag LED. Once the headband is correctly adjusted it stays put and is comfortable to wear for hours on end. I use this headlamp for any of my outdoor or any this is going to suck type of jobs with my petzl unit being used for the easier jobs.Cons:This thing blows thru batteries on high output, however par for the course for how much light you getWeight: It's no Petzl in size, this would not be my first headlamp of choice if weight was an issue such as back packingFragile: This is my 3rd apex headlamp, if you are any sort of rough on your equipment you will eventually break this unit.Pro:Great light output with different light outputs selectionsPrice: $60 at this time of writing is a great bang for your buckAA Batteries: Easy to get everywhere.",
    "I used this Hover Disc this summer at a school camp where I teach. The students and adults alike loved playing with it. Like anything you throw, tree interference can be an issue. This disc can be grabbed by the wind, due to its hovering quality, and flung on roofs, power lines, and trees, so I suggest large fields for play. It was torn after five weeks of daily usage by fifty people, but you really can't beat that for ten bucks.",
    "It's exactly as described. The quality is very good. I'm amazed that I find new pockets almost every day. It's a useful and fun to have vest.",
    "Crap. This lasted less than one school year and started tearing at the top seam near the zipper. I wouldn't let my dog carry his prosthetic testicle in this piece of Hong Kong fooey.",
    "This stand is very sturdy and holds bicycles in a variety of positions that allow work to be performed easily on all aspects of the bicycle. It can be moved readily to the work location and stores well when not in use.",
    "I really think I wasted money for buying this stuff.....it's just worthless and not working at all.",
    "The lubricant works fine BUT it is very difficult to spray to the center of the belt.It will also spray onto the top of the belt and on the edges of the machine making it slippery.A better spraying device with some type of \"straw\" might perform better. Next time I will use another brand.I would not recommend this to a friend.",
    "I bought one of these for my girlfriend (now wife) when we first started dating. She had lost he other Twins keyring/bottle opener and this was the only one I could find. It is pretty heavy and bulky for a keyring but she loves it. That was 3 1/2 years ago and it's been banging around on her keyring ever since and still looks brand new.",
    "the lantern was not repaired by the trplacement of this part. I could not reach Coleman on thr Phone so I got a new on",
    "she put them on. they looked cute. she was happy and in turn so was I. 5 stars are deserved.",
    "This skateboard is well built has a lot of pop and there seems no difference between this board and other more expensive skateboards.The wheels and bearings roll very good too.Highly recommend it.",
    "With my daughter now playing volleyball, we have several balls rolling around the house. While this bag was bigger and a bit more expensive than I wanted to spend, it has worked out great. It is a very good quality bag that can easily hold twelve youth sized volleyballs.",
    "This airbed is exactly what I've been longing for. It has a built in motor and is twice the height of the first two airbeds that I had. To me, it's also worth the price. It's also very firm and comfortable!",
    "These are the greatest T shirts both for working out and for general wear. They last forever, look great and are extremely comfortable. I only wish they came in more colors!",
    "This hooked up fairly simply even though there were no instructions. ONce my son was on it though he told me that it obediently went up to 10mph and then pegged on the maximum setting - I have no idea why it has this problem (I tried it, just to say if he had his facts straight - he did!) - this wasn't that much money and I have yet to send it back for a refund - that's my next move.",
    "Just what I wanted. Does the job. Haven't had any trouble through numerous flat repairs with this cement. The tube's larger and won't fit in previous store-bought patch kit boxes. Pax Rubber Cement Patch Kit Glue Tube Tire is a cent cheaper.",
    "The Topeak Alien II tool set is the perfect new addition to my bike bag.It has all the necessary tools you might need on or off the trail including gimmicks like a knife and bottle opener just in case.I found that separating the two halves make work a lot more practical since you get a better grip for each tool, much better than if it had been a big blob of tools.If you need tools for your bike I would definitely recommend this kit!",
    "I would give this 5 stars if there was some sort of space on the charger where you can store the extra heads. I'm pleased this product is not excessively loud, I live in an apartment and don't feel self-conscious about blowing up my guest beds. Also, it works super fast, my twin coleman quickbed mattresses blow up in less than a minute. I recommend purchasing this product.",
    "The lead wires on this unit are a very small size. The unit is sealed, so they cannot be changed.I have installed other solar controllers and was able to use a decent size wire for more currentcapacity. I will opt for one with a terminal connection in the future.",
    "bought the same product in a retail store and paid $10 more a few months prior. we needed something comortable for visitors- meets the need. fast and easy set up and break down. just what we were looking for at an affordable price :)",
    "I wear a size 4 - 6 or small in misses' clothing or a 5 - 7 or small in juniors' clothing. Because these shorts are made of a 50/50 poly-cotton jersey knit, I ordered them a size larger than I normally wear--medium--thinking that even though they initially might be a bit big, they would shrink enough to be a good fit on me. Unfortunately, the medium was far too small for me. In fact, I'd guess that the medium would be a perfect fit for someone who normally wears a small. I have reordered the shorts in a large because they are nicely made and exactly what I need. My only complaint is that the sizing seems very inaccurate. They definitely run about a size smaller than other knit shorts in the same size.",
    "The Misty mate is amazing! Even in 110+ tailgating temps the Misty Mate made it bearable. A single fill lasts 15-20 minutes of very cool and refreshing moisture. This is a well made product and is well worth the money. I've got 2 of them and really like them",
    "If anyone is thinking about buying these, DON'T. Do not waste your money on these strings. If you like to precisely control what you're playing (especially if you play Metal), do not get these strings. The coating is too slippery and feel uncomfortable. And most importantly!! The tone is NOT bright and the sustain is horrible. They can't hold a chord without fading quickly especially if you bend a lot. If you want amazing, well manufactured, loud and controllable strings I suggest checking out GHS Boomers. With GHS you will not be disappointed, unlike Elixir. ( I personally use GHS Boomers TnT [thin top heavy bottom])",
    "Heart Rate Monitors are the best way to train. They will help you do 'quality workouts'. Too many people exercice to loose weight, but out of the 'good zone' so they don't achieve the results they want. Also, many runners will do 'junk miles' because they are not training at the right level. I did both...Since I bought that watch, I did not train once without it.I agree with 'A guest from Seattle'. This is a great HRM for the money. Contrarely to what he said, this watch will NOT give you the average HR or time in zone. You need the similar model with either 50 or 100 memory (ex: 51601) from Timex. Target does not sell those models.For rikrik456 from DECATUR, pressing the 'Heart Rate' button on the watch in Chrono mode will toggle the HR with the CHRONO, putting the HR in the larger window.For Kathy from VT or anyone else, the instructions can be downloaded from http://www.timex.com/instructions/w17Instr.pd f. They match the ones I had when I purchased my watch.Regarding Jim Deerkoski's from Rockville comment, to my knowledge all the HRM but MIO use chest bands. MIO do not use a chest band but you must put 2 fingers on the watch. Sounds interesting? Not at all, the watch become a HRMeasuring device instead of a HRMonitor because it won't be able to tell that you are out of the target zone unless you put your fingers on the watch!!!If you are looking for more features, see the high-end Polar HRM. If it is your first HRM, keep your money in your pockets and buy this one.",
    "The mount fits great, and holds the GPS really well. Have ridden over 100 miles with it on my dirt bike, and it hasn't shaken loose. The only down side is that there's nothing to dampen the shock to the unit, so it hits every rock, bump and jump just as hard as the bike does.",
    "I bought this seat to replace the skinny,hard, uncomfortable seat that came on my mountain bike. This seat makes it much more supportive and comfortable for longer distance rides. I'd highly recommend it.",
    "I bought my first can of Sno-Seal about 10 years ago for my work boots; and I'm still using the same can. The whole reason I'm writing this review is that I was looking on the internet for another can because I ran out and the store I bought some from went out of business. But, I found some on Amazon (figures). This is the best stuff I've ever used, period. Not only does it waterproof your boots it will make them last a long time. I've tried other protectants, both spray-on and rub on, but Sno-seal is the best. Every pair of work boots I've used it on, the soles wear out looong before the leather does and that's because I put Sno-Seal on them once a year. I highly recommend heating your boots up first (I usually put mine in the oven on 150 for 10 minutes or so) then apply the protectant. Best 5 bucks you will ever spend.",
    "These are a set of very nice swimming goggles. Works very good in sunlight as well as when the pool is indoor. The glassy surface tends to get some touch marks which require a soft cloth to clean up but its ok, it does not damage your goggles or obstructs you view while swimming. Comes with 3 nose-hooks which you can choose according to which fits you well.",
    "Control of the flames appears to be good, the product appears to be well made, it is nice and sturdy. It is quite heavy so I wouldn't want to carry it around but I will travel with it in my truck so it doesn't matter to me. I like the product so far!",
    "I love the quickness and lightness of this rod. Very strong also. This is my second time buying this telescopic rod and reel. I allowed someone to cut the first one, just had to have another one.",
    "I bought these trays for use with the Venerati line of chips from Sidepot. They are a little loose, but not too bad.",
    "Be careful with this knife. It is both super fast and quite light. It is very easy to cut yourself when opening it if your hand is in the way. The safety though keep the blame solely on yourself for doing that though.",
    "This product is excellent for people who are just starting to become a serious tabble tennis player. This is by no means the top of the top racket, but for the money, it is a great blade.",
    "This was exactly what I was looking for, it is almost invisible and works great for small beading projects. It arrived very quickly and there were no problems with the packaging.",
    "I have three boys....13...6...4....and they love this! Pretty sturdy and stays together well.They have played with it almost every day for the last month. Keeps them active rather than sitting playing video games.Very happy with this....well worth the money....and it should last for years.",
    "The product title \" Hornady Sure Lock Lock Rings\" as well as the item photo suggest a SET of two rings. I was supremely disappointed when a single ring arrived. While a vast improvement over conventional locking mechanisms, consumers deserve proper representation for the items they purchase. Please change the item description to \"Hornady Sure Lock Lock Ring\" and depict an image of a single lock ring!",
    "I ordered these for my daughter for x-mas but she refused to wear them. I'm sure they are super for snow and yukky weather, but they look very orthopedic and clunky. They were a little hard to get on with socks and she said it felt like wearing bricks on her feet. She (and I) prefer snow boots or Merrell's in place of these, but they probably have their place.",
    "What can I say- I checked reviews for a number of different brake cables, decided that I wanted PTFE coating, but didn't want to pay a fortune. This cable fit the bill, and appear to be good quality. I have been using it for about four months. No sign of stretching, just seem to be excellent cables that do what they are supposed to, and at a reasonable price.",
    "This was alright, but the front tire was a hard to use, it was almost impossible for using this as a stroller, but if removed it worked great on just the bike.",
    "Great Product. Great Price. Worth the purchase, if you plan to use it (or even if you don't).",
    "Great umbrella but it has no auto close button and I have difficulty closing it down when I'm in a hurry",
    "UPDATED REVIEW: Strings keep breaking and it's only been in service for 2 or 3 weeks. The last one made it years. I don't see that happening here. Coghlan must have changed something over the years because this ain't the robust one I bought years ago. Disappointed.Original review: Used to buy these at Walmart for $8. Since they no longer sell it, I guess you gotta buy it here at about twice that price. At $8 it's a 5 star. At $15+ it gets 4 stars.It is small and not made for heavy use. However, I can tell you that if you don't leave it out in the Sun it will last years. And it can support the weight of two people ;-) for a total weight that exceeds 350.If you do leave it out in the NV Sun all season it will make it about 1 or 2 seasons. The strings start to break down in the Sun and one by one...\"ting\" they snap away.Lets see, left out in the Sun, forced to support two, used hard and put away wet, lasts longer than expected (yearS if not left out)..... it is a fine little compact hammock. Buy it with confidence.",
    "cheap. top had to be glued upon arrival. light is too bright to use to do movie critiques/reviews. but it does work well for a pen light. just would be better if a red light as bright green light.",
    "I have been using this for about 3 months and even with light being left on or accidentally getting turned on in bag I have still not had to swap out batteries yet. The LED's are bright. The flash rate makes it very noticeable without quite crossing the line into being annoying. And the mounting: versatile, durable, holds light well in place even through flipping bike completely over, and most importantly it is not stiff and shows no sign of weakness from being removed daily. No stiff, cheap plastic here. As a lifetime biker I very highly recommend this, especially to other MTB riders and commuters who need something capable of either taking a beating or being removed often.",
    "Nice product. Keeps water cool with blanket insulation. Easy to fill and to carry. I would recommend this product. I purchased one and I will buy another to keep in my boat.",
    "I purchased this product based on an article I saw in a Parenting magazine saying it was the only thermal jar to pass some test for keeping food warm at a safe temperature for 5 hrs. BULL! After 2 hrs, you can expect food that was piping hot when placed in the thermos to be lukewarm, at best. It's nice to have in terms of storage (doesn't leak), but it surely doesn't keep food all that warm. At least not mac n cheese. Maybe soup will stay warmer. Haven't tried that yet. I give it a 3.",
    "This ball didnt last 3 months. My teenager played foot ball with it and with his friends. The strings started coming out after about 4 games. After a while, it just completely fell apart. Very dissapointing.",
    "Excellent product for use to attach woman's bicycles to car bike rack. Product delivered as described.",
    "I love this knife and was happy to be able to get this discontinued model at the price I got it for.",
    "I bought it for my 6-year-old son along with Razor scooter. The size is right, and it should fit him perfectly, if there had been the thick pad, which is supposed to come with it. There was only a thin pad in the package and the helmet does not stay on his head. According to the instruction, you need a thick pad. My older son has the same kind of helmet and both thin and thick pads came with it. I sent and e-mail to the Razor customer service to send me a pad. Hopefully they will send it to us.",
    "I bought this to wear under my wetsuit. It makes changing in public much easier. Yes, surfers do that occasionally. It's comfortable and low profile so your wetsuit goes on and off easily.",
    "I use this mat mainly for yoga, but every once in a while I also use it for P90X, which is heavy duty.I break into a sweaty mess 10 minutes into the workout, and the mat loses all of its stickiness, causing me to have to correct my pose every 15 seconds because my feet spin and slip out of control. Of course, this is a major inconvenience.So, if you sweat more than the average guy or girl, consider getting another mat. This one is otherwise very fine.",
    "Purchased this saw for Mountain Bike Trail Maintenance in Wharton State Forest in the Pine Barrens of South Jersey. We had a rough winter storm season and had many large trees down. We are not allowed to use chain saws so I got this saw for the job. It worked great. I used a bike tube looped through the handles and wore it like a quiver across my back while we rode into the work area. With some WD-40 for lube it made quick work of the number of trees that needed to be removed to clear the trail. What we had thought would be a multiple session task to clear the trail was accomplished in one with this saw and a great crew of people.",
    "Decent watch for the price. It survived a week of diving in Mexico, and thats all I could ask for. The movement is a little loud, but not too bad. A pretty good watch for all around activities that I don't care about beating up.",
    "I am very happy with my cork block. It is a nice size and is heavy enough that it doesn't tip as easily when I use it to steady a pose.",
    "(BJJ adult) The metal buckle holding the chin strap to the ear guard snapped within 2 weeks of using it. Looking at the metal that snapped, it was pretty thin. It looks like anyone using it in live rolling would break it sooner rather than later. It's unfortunate, because there were positives if it had sufficient construction. The rubberish foam piece that was in contact with the head was very comfortable, and didn't absorb sweat at all. After working out, I would wipe the sweat off quickly and consider it clean, and it never began to stink. The ear space was large, and rarely moved enough to come in contact with the ear lobe. I was also able to hear out of it better than other head gear. And of course with the colors, it looked good.Too bad they chose to cut the wrong corner on a higher priced product that should have been 90+% profit already.",
    "This was a fun combo pack for our whole family, with room to ride, it was quite the hit with my grandson",
    "This purchase was for my wife. I am a boxer and I use expensive, $200 gloves for my training. So, I'm picky. I wanted to get something for my wife so that she could protect her hands and add a little weight/resistance to her at home cardio workouts. We decided to start with the Everlasts, just to see if she liked boxing and would keep up with it. These turned out to be very well-built and protective. Ventilation is good and they won't develop any smells as long as you don't leave them in a closed area (like a gym bag). Padding is well-distributed. Material is fairly durable (not as good as leather, though). My wife is 5'6\", 110lbs and fits the 8oz glove snugly, without wraps. If you are hitting a bag, use wraps and go for a larger glove.Though these are a \"cheap\" glove, they are very adequate for someone starting out. If you find yourself getting into boxing, your next step would be quality leather gloves in the $50 to $80 range. But, as a starter, I can recommend these. Shes proud to own them and they encourage her to stay active.",
    "I agree with most everyone else-even following the directions I lost more air than added. Then the handle came off. You'll be better off with another brand.",
    "I have had them on for about a week. For the most part I like them. They have the perfect amount of snap to them and I love the feel of the coating. It makes playing a real joy. Even more than before. But they almost seem to bright for me. Maybe they will mellow out a bit. All in all though they are worth every penny!",
    "I had to send the shoedryer back two days after Christmas when the middleof the units both started to melt.. I have to say I have always heard awesome things regarding this product so I was caught off guard. It has been a couple of weeks since I sent the product back and I have still not heard a word. I would like to think it was just a flaw in this unit. I am requesting another unit to replace it to give it one more shot.. Plsdont \"Peet\" disappoint me:)",
    "Easy to install D.I.Y. and provides great visibility in poor light conditions. It is better that you can be seen and it can save a life. I recommend.",
    "i bought these for my wife who has raynaud's syndrome, so cold seriously effects her fingers. these gloves are perfect for her! prior to these gloves she was lucky to ride in latter September (live in Kentucky) Now she can finally ride into November without any pain. She loves these gloves.",
    "So when I became a military aviator, I decided to test out some things and see what they were made of during survival school. Used this knife at every obstacle during sere I could think of, and it chewed right through them. Did some blade maintenance in the field with a tungsten dog tag shaped sharpener. Worked well.I've taken that same knife backpacking with me countless times and it's never failed me. I've sharpened it between uses with diamond sharpening stones of variable grit, and occasionally honed it !Every deployment I make sure to pack this in my bug out bag, just in case. I have that much faith in it. A bug out bag is no joke... As this knife is not either. (That's what ? A triple negative when added to the 'no joke' ?)Pros of knife:Heavy, solid knife (You feel powerful when you unsheath this behemoth)Tie down points to turn into a spear (Big enough for 550 cord)Lanyard hole on butt of knife (big enough for 550 as well)Rubberized handle is comfortable and easy to hold. Absorbs some vibration as wellHalf serrated blade for any and every thing conceivableSharp, high carbon straight edge keeps the edge even when chopping wood (I know, some knife enthusiast out there is cringing)Thick spine of the knife helps you split wood (They're cringing again) and also adds to weightThe back is sharp, and can be used for all sorts of good stuff (Skull cracking is possible, but not recommended by US Law :P)Pros of Sheath:#1, the sheath is on par with the knifeRubberized plastic has durable feel to itCeramic sharpening rods built into the case allow 2 things:A. Emergency sharpening at a high bevel angle (Good for rough tasks, not slicing tomatoes)B. You can see the knife sheathed (Not sure why I get such great satisfaction out of that)The sheath can be detached, to be only a sheath (rubberized part)The velcro that attaches the sheath to the cordura part does so quite well, and has MOLLE II attachment ports (Handy for people in my line of work)The cordura backing on the sheath is durable, and has a belt loop built into the top.Two straps turn it into a drop leg holster. No complaints there really. I've used it like that before, and the rubber woven into the cordura grips the fabric of your clothes. So it is possible to chafe.Cons of knife:Barely any...If you use it enough, you may blister your hands on the grip. But that just means next time you'll remember to protect your handsCons of sheath:Nothing notable... Seems well put together.Bottom line:Recommended for anyone who likes knives, survival gear, camping/backpacking, woodsman like activities, or is deploying.",
    "great boots perfect for rainy weather outdoor work and walking through streams and rivers. i wear them at work to keep my feet dry all day and they have no problem doing that and my feet do not overheat in these boots which is a big plus for me",
    "Great knife. Only thing is the laminated sealant strips very easily. Just remember that nice black finish will be blemished quickly after use. Within 10 minutes it was blemished. But it still works well. It was fairly sharp out of the box, but you will still need to sharpen it before you take it into the field to make sure it will be ready. You could use it out of the box if you're just using it for battoning or basic use.",
    "Buck could have a real winner here, but I think the handle is a bit weak. The blade is typical Buck quality and the lock back is very solid. It appears the handle is made of some kind of rubberized plastic and it will be interesting to see how it holds up.",
    "Nice pair of gloves. In the process of breaking them in and they're working out great. The wrist support is better than I expected.",
    "My wife just bought this watch for me and I'm very impressed. It's a large (not too large), masculine timepiece and very attractive. The gold plated Miyota movement keeps time very well and looks great contrasted against the dark, textured face. All the details on the face (and elsewhere) are flawless. The solid surgical steel case and bracelet links give this watch some heft and reinforce your confidence in the build quality. Overall, this beautiful watch is simply a great value and it was a perfect gift.",
    "I bought these thinking it was going to be easy to put on and off but it takes 2 hands to compress it enough in order for it to slide on the end of my bar and i am no panzy. i think for the price golds gym offers a way better product.",
    "The pants first came to me only a couple days after ordering them. They were a size one. I had ordered a size 7, but I think it was MY fault for having not re-clicked on the size button after leaving the order page and then coming back to it to place the order. None-the-less, the fine folks I ordered them from took them back, and re sent the size seven in immediate fashion. No muss, no fuss. There is no real way to express my gratitude for that kind of service except to say that I am their customer for all my martial arts needs as of now.The pants are of the highest quality for the price. I wear them on a daily basis to work in as well. They are comfortable and durable.Thanks again guys/gals!!John",
    "Excelente de muy buena calidad tal como lo esperaba los recomiendo ampliamente y llego en el tiempo estipulado , !",
    "One or two swipes with this works like a charm. I've used this on a few somewhat neglected firearms and it has done a wonderful job of cleaning and oiling with hardly any time spent.",
    "My 6-year old son bought this with own money and wasn't disappointed. He loves to put the helmet on his stuffed animals to play football.",
    "it's a piece of crap, and not a product as described, i wouldn't buy this. it's not at all as the picture portrays,",
    "This medicine ball is exactly what I was looking for. Its relatively small size combined with the heavy weight is ideal for my purposes. I use it in boxing training to simulate receiving the impact from body blows (weight transfer etc.).My students get the feel of receiving the blow without suffering the bruising and soreness encountered in actually taking a body punch... The strike and return also serves as a plyometric exercise.",
    "Serengeti has, in my opinion, the best optics on their glasses of any I've ever tried (and I've tried quite a few in my time). Additionally, this seller has excellent service and I have ALREADY purchased additional items from them. Keep up the good work.",
    "I loved this program! It was SOOOO HARD. But, after I was done, I noticed I had abs for the first time in my life. I would not recommend this program for anyone who has any injuries, because it is extremely intense. If you give it your all, you will see results.",
    "We bought this hammock to replace a hammock that we loved that had been munched on by mice. This hammock was reasonably priced, so we bought it - and after trying it w/ our young and very lightweight daughter - promptly threw it out. It's loosely constructed with very little support and not comfortable at all. Don't waste your money!",
    "It worked fine for me, my dad recommended it and it works. A little hard to get used to but then you soon forget that you have it on.",
    "These pants are so wide at the feet it's ridiculous...I'm 5'8\" and originally ordered these in Medium, way too long, then got them in a small and now they're the right length and waist size, but way too baggy.Don't waste your money",
    "It is a very warm sleeping bag, but shoddily made. The bottom (feet side) zipper area, the stitching holding the zipper and fabric has broken, thus creating a hole (Kind of voids the idea of having a sleeping bag). Mind you, it is not a rip, but there is a hole. I only slipped into the sleeping bag and this happened, so apparently you need to be very careful when using this if you don't want to damage this so called \"rugged\" item. I won't return the item because I know how to sow and can fix this problem, but I'm just saying that for the money (I know I could have spent more, but for the price it shouldn't have broke after 2 days) there could be a little more quality.Also, the pillow that comes with the bag is a joke, but that really shouldn't be why you are buying the bag in the first place.",
    "Overall I really like this watch. The only, not even complain, but remark - it is really hard to tel their size. They look a bit smaller on the wrist than many other G-Shock models. Probably, because of its less rugged appearance.Still, it's a great watch and it does exactly what promised.",
    "Enables me to push myself without endangering my health. You can spend more, but why would you? This monitor works perfectly.",
    "This is a great pack! I actually own two. One I have as my every day pack. I walk five miles to and from work (in the city granted so its not a death hike) and this bag is very comfortable. The other is stuffed with survival gear and is in the trunk of my car in case of an accident. The compression straps make the bag small, compacts and squareish. My friends get a kick out of me unpacking all of my crap from the bag, repacking it, and using the compression straps to shrink it. I am going to be purchasing another as a gift. A friend is going to south america and she is looking for a good bag. With the more than reasonable price of this bag it will be perfect for her.",
    "About the only thing this was good for was plunking cans at very short distance. Would not buy again. But the price was right.",
    "I loved this scoops. I like that they came in different colors so the students can be easily divided into teams when using them for PE activities. I think these are going to prove to be great tools for learning in my gym.",
    "I bought 2 of these Scepter Jeep Style cans thinking \"higher price = better quality\". I was very concerned with the spill proof (aka: CARB) spouts on the other cans I was considering. Ohhh - so wrong indeed. One can, the spout never worked. The other one, well, it worked for a few months, but required a lot of force to get the spill proof valve to open. Now, it too doesn't work.So, . . . instead of paying 3x as much to avoid reliability issues versus the \"cheap can\" at the Blue or Orange big box store, . . . I am now out three times as much cash.My bad. Manufacture doesn't appear to respond to EMAIL either. Do I blame the manufacturer or our own government for passing a stupid law that requires these CARB spill proof spouts? Both actually - we as humans like to get in our own way for safety at times. That said, if someone builds a product, they should make sure it works reliably. Oh wait - it still is a spill proof spout, . . . it works so well nothing comes out, no matter what you try.",
    "The Hickory Hiking Staff is very attractive, an excellant value & very functional. The purchase was made due to an up coming trip to Japan & climbing Mt. Fuji. We were successful in reaching the summit of Mt. Fuji by greatly relying on the Hickory Staffs. The metal tips made gripping the rocky surface very stable.The only negative was enability to have our hiking staffs branded at the top of Mt.Fuji due to the fine lacquor finish.",
    "I got this case on sale for a few bucks off list price and am giving 5 stars based on that price. At full price I'd drop one star. The positives are: a hard shell that protects a gun, a fairly secure hole that accepts a solid lock and a foam lining. The hinge, fasteners and exterior look durable. The case definitely will protect a handgun though you may want to wrap a sock or cloth around the gun to prevent it from bouncing around inside. You get a lot for five bucks!The only negative is that it shouldn't be described as a large case, it certainly won't hold a 5.5\" Ruger Mark II pistol or a revolver with a 6\" barrel. A couple friends also got this case and we've found that a full size 45ACP fits well as does a Hi-Power, Luger, medium size Glock and a 4\" K-frame revolver. I'd say many 4\" revolvers and 5\" semiautos will fit.",
    "I really like these socks. They're soft on the inside and fit comfortably around the ankle. For some reason, the green pair felt a little smaller than the other two pairs in the package. I also like the different texture of the material on top of the foot -- it makes the socks more breathable. There is decent cushioning on the bottom of the socks and the toe seams are not bulky.",
    "This is a great fridge for use in a truck or SUV. Large size for a long road trip with a lot of people. However, I find I always use my smaller cooler and not this one because of the plug design. The power plug is in the back of the device in the center. It interfears with being able to put the back of the fridge against a seat, door or wall.",
    "I got this as a gift from a fellow basketball coach. He told me this would be a great tool to use as I prepared for the season. I got home and watched it and it is beyond great. Izzo does a great job of breaking down the plays (Chest, Horns, Thumb series) including showing the viewer multiple options within each series. The drills in the beginning are great as well. All of my players set screens and come off screen the way Izzo recommends. This video is great! i highly recommend for any basketball coach - esp. high school.",
    "So I don't know anything about tournaments or actual pro badminton.All i do is smack thoose with my cousin on weekends for couple hours to break some sweat.I received couple of generic shuttlecocks with the set of rockets. They were horrible. First of all made all of plastic that deformed in shipping, second of all they were way to light to play with them outdoors.Victor Gold are made with real feathers which adds a lot to the aeorodynamics of it, and are heave enought to play with them outdoors on even with a little of wind.I can't tell you how durable they are in the real game, but what I can tell you is that mine are treated pretty harsh, often hit with the wrong part of rocket, they land in gravel or mudy grass and are even stolen and chewed by my Great Dane ... after all of that one shuttlecock is still enought for a few hours of play on weekend.That said and happy with the purchase, and because of the price/quality ratio those will be my first pick for future purchase.",
    "Sleeping bag washing instructions are for front loader machine only. We have washed the pillow in our top loader on a delicate/cold cycle. Color faded a tiny bit after 1st washing.My 4-yr old needed this for daycare. I wanted a sleeping bag that he could use beyond his \"Deigo\" and \"Cars\" years.The sleeping bag is reversable.Also, the bag was delivered about one week after I ordered it (much sooner than the company advertised!)I have already recommended this bag to other parents!",
    "Wow.....I was surprised how big and roomy the bag is. It will carry your Colman 2 burner stove in the bottom....and extra propane bottles, cookware, lantern, and the kitchen sink!",
    "Exactly as advertised. The item was promptly shipped and arrived in excellent condition.",
    "They pack up in about half the size of cotton boxers. They dry after being washed in the shower in less than 4 hours. With two pairs you could travel the world.",
    "I didn't know much about horseshoes but after some quick research found this to be the best bang for the buck. The colors are great, the shoes feel solid and balanced in your hand, and its a good feeling to buy from an original American company. The case is a nice touch and the manual inside was very helpful for setting up the court and knowing all of the rules of the game. My only need is to mount the stakes into a block and then bury the block. Just driving them into the ground in my area allowed them to wobble a bit and move after a few good ringers."
]